{
    "id": "bffbe181-46a4-403d-baae-bf8fead09485",
    "created_at": "2024-06-25T07:48:12.888295Z",
    "updated_at": "2024-11-22T02:03:25.261119Z",
    "deleted_at": null,
    "sha1_hash": "33526bc385294f1ad7de8971b4a9505b2a2f2fa0",
    "title": "Flax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog",
    "authors": "",
    "file_creation_date": "2024-06-25T06:53:49Z",
    "file_modification_date": "2024-06-25T06:53:49Z",
    "file_size": 697535,
    "plain_text": "6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nFlax Typhoon using legitimate software to quietly\naccess Taiwanese organizations\nmicrosoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwaneseorganizations\nAugust 24, 2023\n\nBy Microsoft Threat Intelligence\n\nSummary\nMicrosoft has identified a nation-state activity group tracked as Flax Typhoon,\nbased in China, that is targeting dozens of organizations in Taiwan with the likely\nintention of performing espionage. Flax Typhoon gains and maintains long-term\naccess to Taiwanese organizations\u2019 networks with minimal use of malware, relying\non tools built into the operating system, along with some normally benign software\nto quietly remain in these networks. Microsoft has not observed Flax Typhoon using\nthis access to conduct additional actions. This blog aims to raise awareness of the\ntechniques used by this threat actor and inform better defenses to protect against\nfuture attacks.\nMicrosoft has observed a distinctive pattern of malicious activity almost exclusively\naffecting organizations in Taiwan using techniques that could be easily reused in other\noperations outside the region and would benefit from broader industry visibility. Microsoft\nattributes this campaign to Flax Typhoon (overlaps with ETHEREAL PANDA), a nationstate actor based out of China. Flax Typhoon\u2019s observed behavior suggests that the\nthreat actor intends to perform espionage and maintain access to organizations across a\nbroad range of industries for as long as possible. However, Microsoft has not observed\nFlax Typhoon act on final objectives in this campaign. Microsoft is choosing to highlight\nthis Flax Typhoon activity at this time because of our significant concern around the\npotential for further impact to our customers. Although our visibility into these threats has\ngiven us the ability to deploy detections to our customers, the lack of visibility into other\nparts of the actor\u2019s activity compelled us to drive broader community awareness to further\ninvestigations and protections across the security ecosystem.\nIn this blog post, we share information on Flax Typhoon, the current campaign targeting\nTaiwan, and the actor\u2019s tactics for achieving and maintaining unauthorized access to\ntarget networks. Because this activity relies on valid accounts and living-off-the-land\nbinaries (LOLBins), detecting and mitigating this attack could be challenging.\nCompromised accounts must be closed or changed. Compromised systems must be\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n1/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nisolated and investigated. At the end of this blog post, we share more mitigation steps and\nbest practices, as well as provide details on how Microsoft 365 Defender detects\nmalicious and suspicious activity to protect organizations from such stealthy attacks.\n\nWho is Flax Typhoon?\nFlax Typhoon has been active since mid-2021 and has targeted government agencies\nand education, critical manufacturing, and information technology organizations in\nTaiwan. Some victims have also been observed elsewhere in Southeast Asia, as well as\nin North America and Africa. Flax Typhoon focuses on persistence, lateral movement, and\ncredential access. As with any observed nation-state actor activity, Microsoft has directly\nnotified targeted or compromised customers, providing them with important information\nneeded to secure their environments.\nFlax Typhoon is known to use the China Chopper web shell, Metasploit, Juicy Potato\nprivilege escalation tool, Mimikatz, and SoftEther virtual private network (VPN) client.\nHowever, Flax Typhoon primarily relies on living-off-the-land techniques and hands-onkeyboard activity. Flax Typhoon achieves initial access by exploiting known vulnerabilities\nin public-facing servers and deploying web shells like China Chopper. Following initial\naccess, Flax Typhoon uses command-line tools to first establish persistent access over\nthe remote desktop protocol, then deploy a VPN connection to actor-controlled network\ninfrastructure, and finally collect credentials from compromised systems. Flax Typhoon\nfurther uses this VPN access to scan for vulnerabilities on targeted systems and\norganizations from the compromised systems.\n\nFigure 1. Flax Typhoon attack chain\n\nAnalysis of current campaign\nInitial access\nFlax Typhoon achieves initial access by exploiting known vulnerabilities in public-facing\nservers. The services targeted vary, but include VPN, web, Java, and SQL applications.\nThe payload in these exploits is a web shell, such as China Chopper, which allows for\nremote code execution on the compromised server.\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n2/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nPrivilege escalation\nIn cases where the process compromised via web shell does not have local administrator\nprivileges, Flax Typhoon downloads and runs a piece of malware that exploits one or\nmore known vulnerabilities to obtain local system privileges. Microsoft has observed the\nactor use Juicy Potato, BadPotato, and other open-source tools to exploit these\nvulnerabilities.\n\nPersistence\nOnce Flax Typhoon can access Windows Management Instrumentation command-line\n(WMIC), PowerShell, or the Windows Terminal with local administrator privileges, the\nactor establishes a long-term method of accessing the compromised system using the\nremote desktop protocol (RDP). To accomplish this, the actor disables network-level\nauthentication (NLA) for RDP, replaces the Sticky Keys binary, and establishes a VPN\nconnection.\nWhen using RDP, NLA requires the connecting user to authenticate to the remote system\nbefore a full remote session is established and the Windows sign-in screen is displayed.\nWhen NLA is disabled, any user attempting to access the remote system can interact with\nthe Windows sign-in screen before authenticating, which can expose the remote system\nto malicious actions by the connecting user. Flax Typhoon changes a registry key to\ndisable NLA, allowing them to access the Windows sign-in screen without authenticating,\nwhereupon the actor will use the Sticky Keys shortcut.\nFigure 2. Flax Typhoon command disabling NLA\n\nSticky Keys is an accessibility feature in Windows that allows users to press modifier keys\n(such as Shift, Ctrl, Alt) one at a time instead of simultaneously. It includes a shortcut\nwhere the user can press the Shift key five times in succession to launch sethc.exe, the\nprogram that manages Sticky Keys. The user can invoke this shortcut at any time,\nincluding at the sign-in screen. To take advantage of this feature, Flax Typhoon changes\na registry key that specifies the location of sethc.exe. The actor adds arguments that\ncause the Windows Task Manager to be launched as a debugger for sethc.exe. As a\nresult, when the actor uses the Sticky Keys shortcut on the Windows sign-in screen, Task\nManager launches with local system privileges.\n\nFigure 3. Flax Typhoon command altering Sticky Keys behavior\n\nAt this stage, Flax Typhoon can access the compromised system via RDP, use the Sticky\nKeys shortcut at the sign-in screen, and access Task Manager with local system\nprivileges. From there, the actor can launch the Terminal, create memory dumps, and\ntake nearly any other action on the compromised system. The only issue the actor faces\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n3/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nwith this persistence method is that RDP is most likely running on an internal-facing\nnetwork interface. Flax Typhoon\u2019s solution is to install a legitimate VPN bridge to\nautomatically connect to actor-controlled network infrastructure.\n\nCommand and control\nTo deploy the VPN connection, Flax Typhoon downloads an executable file for SoftEther\nVPN from their network infrastructure. The actor downloads the tool using one of several\nLOLBins, such as the PowerShell Invoke-WebRequest utility, certutil, or bitsadmin. Flax\nTyphoon then uses the Service Control Manager (SCM) to create a Windows service that\nlaunches the VPN connection automatically when the system starts. This could allow the\nactor to monitor the availability of the compromised system and establish an RDP\nconnection.\nFigure 4. Flax Typhoon command downloading a SoftEther VPN executable\nFigure 5. Flax Typhoon command creating a service to launch the VPN connection\n\nFlax Typhoon takes several precautions with their VPN connection to make it harder to\nidentify. First, the actor uses a legitimate VPN application that could be found in\nenterprise environments. As a result, the file itself is almost certain to go undetected by\nantivirus products. Second, the actor almost always renames the executable file from\nvpnbridge.exe to conhost.exe or dllhost.exe. These names imitate the legitimate Windows\ncomponents Console Window Host Process and Component Object Model Surrogate\nrespectively. Third, the actor uses SoftEther\u2019s VPN-over-HTTPS operation mode, which\nuses protocol tunneling to encapsulate Ethernet packets into compliant HTTPS packets\nand transmit them to TCP port 443. This makes the VPN connection very difficult to\ndifferentiate from legitimate HTTPS traffic, which most network security appliances would\nnot block.\nIn cases where Flax Typhoon needs to move laterally to access other systems on the\ncompromised network, the actor uses LOLBins, including Windows Remote Management\n(WinRM) and WMIC.\nMicrosoft has observed Flax Typhoon routing network traffic to other targeted systems\nthrough the SoftEther VPN bridge installed on compromised systems. This network traffic\nincludes network scanning, vulnerability scanning, and exploitation attempts.\n\nCredential access\nOnce Flax Typhoon becomes established on the target system, Microsoft observes the\nactor conducting credential access activities using common tools and techniques. Most\ncommonly, Flax Typhoon targets the Local Security Authority Subsystem Service\n(LSASS) process memory and Security Account Manager (SAM) registry hive. Both\nstores contain hashed passwords for users signed into the local system. Flax Typhoon\nfrequently deploys Mimikatz, a publicly available malware that can automatically dump\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n4/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nthese stores when improperly secured. The resulting password hashes can be cracked\noffline or used in pass-the-hash (PtH) attacks to access other resources on the\ncompromised network.\nFlax Typhoon also enumerates restore points used by System Restore. Restore points\ncontain data about the Windows operating system that the system owner can use to\nrevert changes to the system if it becomes inoperable, rather than a backup of user data.\nFlax Typhoon could use this information to better understand the compromised system or\nas a template for removing indicators of malicious activity.\nThis pattern of activity is unusual in that minimal activity occurs after the actor establishes\npersistence. Flax Typhoon\u2019s discovery and credential access activities do not appear to\nenable further data-collection and exfiltration objectives. While the actor\u2019s observed\nbehavior suggests Flax Typhoon intents to perform espionage and maintain their network\nfootholds, Microsoft has not observed Flax Typhoon act on final objectives in this\ncampaign.\n\nMitigation and protection guidance\nDefending against techniques used by Flax Typhoon begins with vulnerability and patch\nmanagement, particularly on systems and services exposed to the public internet. The\ncredential access techniques used can also be mitigated with proper system hardening.\n\nWhat to do now if you\u2019re affected\nAffected organizations need to assess the scale of Flax Typhoon activity in their network,\nremove malicious tools and C2 infrastructure, and check logs for signs of compromised\naccounts that may have been used for malicious purposes.\n\nInvestigating Suspected compromised accounts or affected systems\nFind LSASS and SAM dumping to identify affected accounts.\nExamine the activity of compromised accounts for any malicious actions or exposed\ndata.\nClose or change credentials for all compromised accounts. Depending on the level\nof activity, many accounts may be affected.\nAffected systems should be isolated and forensically examined for artifacts of\nmalicious activity.\nBecause Flax Typhoon alters the configuration of the operating system to produce\nmalicious behavior, affected systems may need to be decommissioned or restored\nto a known-good configuration.\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n5/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nDefending against Flax Typhoon attacks\nKeep public-facing servers up to date to defend against malicious activity. As prime\ntargets for threat actors, public-facing servers need additional monitoring and\nsecurity. User input validation, file integrity monitoring, behavioral monitoring, and\nweb application firewalls can all help to better secure these servers.\nMonitor the Windows registry for unauthorized changes. The Audit Registry feature\nallows administrators to generate events when specific registry keys are modified.\nSuch policies can detect registry changes that undermine the security of a system,\nlike those made by Flax Typhoon.\nUse network monitoring and intrusion detection systems to identify unusual or\nunauthorized network traffic. If an organization does not use RDP for a specific\nbusiness purpose, any RDP traffic should be considered unauthorized and generate\nalerts.\nEnsure that Windows systems are kept updated with the latest security patches,\nincluding MS16-075.\nMitigate the risk of compromised valid accounts by enforcing strong multifactor\nauthentication (MFA) policies using hardware security keys or Microsoft\nAuthenticator. Passwordless sign-in methods (for example, Windows Hello, FIDO2\nsecurity keys, or Microsoft Authenticator), password expiration rules, and\ndeactivating unused accounts can also help mitigate risk from this access method.\nRandomize Local Administrator passwords with a tool like Local Administrator\nPassword Solution (LAPS) to prevent lateral movement using local accounts with\nshared passwords.\nReduce the attack surface. Microsoft customers can turn on the following attack\nsurface reduction rules to block or audit some observed activity associated with this\nthreat:\nBlock credential stealing from the Windows local security authority subsystem\n(lsass.exe).\nBlock process creations originating from PSExec and WMI commands. Some\norganizations may experience compatibility issues with this rule on certain\nserver systems but should deploy it to other systems to prevent lateral\nmovement originating from PsExec and WMI.\nHarden the LSASS process by enabling Protective Process Light (PPL) for\nLSASS on Windows 11 devices. New, enterprise-joined Windows 11 (22H2 update)\ninstalls have this feature enabled by default. In addition, enable Windows Defender\nCredential Guard, which is also turned on by default for organizations using the\nEnterprise edition of Windows 11, as well as Memory integrity (also referred to as\nhypervisor-protected code integrity or HVCI) for stronger protections on Windows.\nSet the WDigest UseLogonCredential registry value via Group Policy Object to\nreduce the risk of successful LSASS process memory dumping.\nTurn on cloud-delivered protection in Microsoft Defender Antivirus to cover rapidly\nevolving attacker tools, techniques, and behaviors such as those exhibited by Flax\nTyphoon.\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n6/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nRun endpoint detection and response (EDR) in block mode so that Microsoft\nDefender for Endpoint can block malicious artifacts, even when your non-Microsoft\nantivirus does not detect the threat, or when Microsoft Defender Antivirus is running\nin passive mode. EDR in block mode works behind the scenes to remediate\nmalicious artifacts that are detected post-compromise.\n\nDetection details and hunting queries\nMicrosoft 365 Defender detections\nMicrosoft 365 Defender is becoming Microsoft Defender XDR. Learn more.\nMicrosoft Defender Antivirus\nMicrosoft Defender Antivirus detects threat components as the following malware:\nHackTool:Win32/Mimikatz\nTrojan:Win32/Swrort\nHackTool:Win32/Badcastle\nBehavior:Win32/CobaltStrike\nBackdoor:ASP/Chopper\nMicrosoft Defender for Endpoint\nThe following alerts might indicate threat activity related to this threat. Note, however, that\nthese alerts can also be triggered by unrelated threat activity.\nMalicious credential theft tool execution detected\nSuspicious access to LSASS service\nUse of LOLBin to run malicious code\nSystem file masquerade\n\nHunting queries\nMicrosoft 365 Defender\nMicrosoft 365 Defender customers can run the following queries to find related activity in\ntheir networks:\nNetwork activity with Flax Typhoon network infrastructure\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n7/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nlet ipAddressTimes = datatable(ip: string, startDate: datetime, endDate:\ndatetime)\n[\n\"101.33.205.106\", datetime(\"2022-11-07\"), datetime(\"2022-11-08\"),\n\"39.98.208.61\", datetime(\"2023-07-28\"), datetime(\"2023-08-12\"),\n\"45.195.149.224\", datetime(\"2023-01-04\"), datetime(\"2023-03-29\"),\n\"122.10.89.230\", datetime(\"2023-01-12\"), datetime(\"2023-01-13\"),\n\"45.204.1.248\", datetime(\"2023-02-23\"), datetime(\"2023-05-09\"),\n\"45.204.1.247\", datetime(\"2023-07-24\"), datetime(\"2023-08-10\"),\n\"45.88.192.118\", datetime(\"2022-11-07\"), datetime(\"2022-11-08\"),\n\"154.19.187.92\", datetime(\"2022-12-01\"), datetime(\"2022-12-02\"),\n\"134.122.188.20\", datetime(\"2023-06-13\"), datetime(\"2023-06-20\"),\n\"104.238.149.146\", datetime(\"2023-07-13\"), datetime(\"2023-07-14\"),\n\"139.180.158.51\", datetime(\"2022-08-30\"), datetime(\"2023-07-27\"),\n\"137.220.36.87\", datetime(\"2023-02-23\"), datetime(\"2023-08-04\"),\n\"192.253.235.107\", datetime(\"2023-06-06\"), datetime(\"2023-06-07\")\n];\nlet RemoteIPFiltered = DeviceNetworkEvents\n| join kind=inner (ipAddressTimes) on $left.RemoteIP == $right.ip\n| where Timestamp between (startDate .. endDate);\nlet LocalIPFiltered = DeviceNetworkEvents\n| join kind=inner (ipAddressTimes) on $left.LocalIP == $right.ip\n| where Timestamp between (startDate .. endDate);\nunion RemoteIPFiltered, LocalIPFiltered\n\nSoftEther VPN bridge launched by SQL Server process\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n8/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nDeviceProcessEvents\n| where ProcessVersionInfoOriginalFileName == \"vpnbridge.exe\" or\nProcessVersionInfoFileDescription == \"SoftEther VPN\"\n| where InitiatingProcessParentFileName == \"sqlservr.exe\"\n\nSoftEther VPN bridge renamed to \u201cconhost.exe\u201d or \u201cdllhost.exe\u201d\nDeviceProcessEvents\n| where ProcessVersionInfoOriginalFileName == \"vpnbridge.exe\" or\nProcessVersionInfoFileDescription == \"SoftEther VPN\"\n| where ProcessCommandLine has_any (\"conhost.exe\", \"dllhost.exe\") or\nFolderPath has_any (\"mssql\", \"conhost.exe\", \"dllhost.exe\")\n\nCertutil launched by SQL Server process\nDeviceProcessEvents\n| where ProcessCommandLine has_all (\"certutil\", \"-urlcache\")\n| where InitiatingProcessFileName has_any (\"sqlservr.exe\",\n\"sqlagent.exe\", \"sqlps.exe\", \"launchpad.exe\", \"sqldumper.exe\")\n\nFile downloaded by MSSQLSERVER account using certutil\nDeviceFileEvents\n| where InitiatingProcessAccountName == \"MSSQLSERVER\"\n| where InitiatingProcessFileName == \"certutil.exe\"\n\nFile renamed to \u201cconhost.exe\u201d or \u201cdllhost.exe\u201d, downloaded using certutil\nDeviceFileEvents\n| where InitiatingProcessFileName == \"certutil.exe\"\n| where FileName in (\"conhost.exe\", \"dllhost.exe\")\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n9/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nNetwork connection made by SoftEther VPN bridge renamed to \u201cconhost.exe\u201d or\n\u201cdllhost.exe\u201d\nDeviceNetworkEvents\n| where InitiatingProcessVersionInfoOriginalFileName == \"vpnbridge.exe\"\nor InitiatingProcessVersionInfoProductName == \"SoftEther VPN\"\n| where InitiatingProcessFileName == \"conhost.exe\"\n\nNetwork connection made by MSSQLSERVER account, using SoftEther VPN bridge\nDeviceNetworkEvents\n| where InitiatingProcessVersionInfoOriginalFileName == \"vpnbridge.exe\"\nor InitiatingProcessVersionInfoProductName == \"SoftEther VPN\"\n| where InitiatingProcessAccountName == \"MSSQLSERVER\"\n\nMicrosoft Sentinel\nMicrosoft Sentinel customers can use the TI Mapping analytics (a series of analytics all\nprefixed with \u2018TI map\u2019) to automatically match the malicious domain indicators mentioned\nin this blog post with data in their workspace. If the TI Map analytics are not currently\ndeployed, customers can install the Threat Intelligence solution from the Microsoft\nSentinel Content Hub to have the analytics rule deployed in their Sentinel workspace.\nMore details on the Content Hub can be found here:\nhttps://learn.microsoft.com/azure/sentinel/sentinel-solutions-deploy.\nMicrosoft Sentinel also has a range of detection and threat hunting content that\ncustomers can use to detect the post exploitation activity detailed in this blog in addition\nto Microsoft 365 Defender detections list above.\n\nIndicators of compromise\nIn addition to compromised SOHO devices and compromised devices used for traffic\nproxying, Flax Typhoon maintains actor-controlled network infrastructure, including virtual\nprivate servers (VPS). Over the course of the campaign, the IP addresses listed in the\ntable below were used during the corresponding timeframes.\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n10/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nIP address\n\nFirst seen\n\nLast seen\n\nDescription\n\n101.33.205[.]106\n\n2022-11-07\n\n2022-11-07\n\nFlax Typhoon network infrastructure\n\n39.98.208[.]61\n\n2023-07-28\n\n2023-08-11\n\nFlax Typhoon network infrastructure\n\n45.195.149[.]224\n\n2023-01-04\n\n2023-03-28\n\nFlax Typhoon network infrastructure\n\n122.10.89[.]230\n\n2023-01-12\n\n2023-01-12\n\nFlax Typhoon network infrastructure\n\n45.204.1[.]248\n\n2023-02-23\n\n2023-05-09\n\nFlax Typhoon network infrastructure\n\n45.204.1[.]247\n\n2023-07-24\n\n2023-08-09\n\nFlax Typhoon network infrastructure\n\n45.88.192[.]118\n\n2022-11-07\n\n2022-11-07\n\nFlax Typhoon network infrastructure\n\n154.19.187[.]92\n\n2022-12-01\n\n2022-12-01\n\nFlax Typhoon network infrastructure\n\n134.122.188[.]20\n\n2023-06-13\n\n2023-06-19\n\nFlax Typhoon network infrastructure\n\n104.238.149[.]146\n\n2023-07-13\n\n2023-07-13\n\nFlax Typhoon network infrastructure\n\n139.180.158[.]51\n\n2022-08-30\n\n2023-07-26\n\nFlax Typhoon network infrastructure\n\n192.253.235[.]107\n\n2023-06-06\n\n2023-06-06\n\nFlax Typhoon network infrastructure\n\nFlax Typhoon hosts its SofEther VPN servers on its own network infrastructure. Because\nthe servers use the HTTPS protocol to disguise network traffic, they must present TLS\ncertificates. Flax Typhoon used the certificates listed in the table below on these VPN\nservers.\nSHA-1 TLS fingerprint\n\nCommon name (CN)\n\n7992c0a816246b287d991c4ecf68f2d32e4bca18\n\nvpn437972693.sednc[.]cn\n\n5437d0195c31bf7cedc9d90b8cb0074272bc55df\n\nasljkdqhkhasdq.softether[.]net\n\ncc1f0cdc131dfafd43f60ff0e6a6089cd03e92f1\n\nvpn472462384.softether[.]net\n\n2c95b971aa47dc4d94a3c52db74a3de11d9ba658\n\nsoftether\n\nReferences\nhttps://attack.mitre.org/techniques/T1190\nhttps://attack.mitre.org/techniques/T1505/003/\nhttps://attack.mitre.org/software/S0020/\nhttps://github.com/ohpe/juicy-potato\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n11/12\n\n6/25/24, 2:53 PM\n\nFlax Typhoon using legitimate software to quietly access Taiwanese organizations | Microsoft Security Blog\n\nhttps://github.com/BeichenDream/BadPotato\nhttps://attack.mitre.org/techniques/T1059\nhttps://attack.mitre.org/techniques/T1546/008/\nhttps://attack.mitre.org/techniques/T1105/\nhttps://github.com/SoftEtherVPN/SoftEtherVPN_Stable\nhttps://attack.mitre.org/techniques/T1543/003\nhttps://attack.mitre.org/techniques/T1036/005/\nhttps://github.com/SoftEtherVPN/SoftEtherVPN_Stable/blob/master/WARNING.TXT\nhttps://attack.mitre.org/techniques/T1572/\nhttps://attack.mitre.org/techniques/T1003/001/\nhttps://attack.mitre.org/techniques/T1003/002/\nhttps://attack.mitre.org/techniques/T1550/002/\n\nhttps://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/\n\n12/12",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2023/2023.08.24_Flax_Typhoon/Flax%20Typhoon%20using%20legitimate%20software%20to%20quietly%20access%20Taiwanese%20organizations%20_%20Microsoft%20Security%20Blog.pdf"
    ],
    "report_names": [
        "Flax Typhoon using legitimate software to quietly access Taiwanese organizations _ Microsoft Security Blog"
    ],
    "threat_actors": [
        {
            "id": "09031838-56db-4676-a2b2-4bc50d8b7b0b",
            "created_at": "2024-01-23T13:22:35.078612Z",
            "updated_at": "2024-11-22T02:00:02.958528Z",
            "deleted_at": null,
            "main_name": "Flax Typhoon",
            "aliases": [
                "Ethereal Panda",
                "Storm-0919"
            ],
            "source_name": "MISPGALAXY:Flax Typhoon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "86c7abc2-1b71-4665-b9e3-1594d6d15a4a",
            "created_at": "2023-09-07T02:02:47.367254Z",
            "updated_at": "2024-11-22T02:02:01.031676Z",
            "deleted_at": null,
            "main_name": "Flax Typhoon",
            "aliases": [
                "Ethereal Panda",
                "RedJuliett"
            ],
            "source_name": "ETDA:Flax Typhoon",
            "tools": [
                "BadPotato",
                "CHINACHOPPER",
                "China Chopper",
                "JuicyPotato",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Metasploit",
                "Mimikatz",
                "SinoChopper",
                "SoftEther VPN"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1719301692888,
    "ts_updated_at": 1732241005261,
    "ts_creation_date": 1719298429000,
    "ts_modification_date": 1719298429000,
    "files": {
        "pdf": "https://archive.orkl.eu/33526bc385294f1ad7de8971b4a9505b2a2f2fa0.pdf",
        "text": "https://archive.orkl.eu/33526bc385294f1ad7de8971b4a9505b2a2f2fa0.txt",
        "img": "https://archive.orkl.eu/33526bc385294f1ad7de8971b4a9505b2a2f2fa0.jpg"
    }
}