{
    "id": "7c6c2e75-2dc0-43d6-b3f7-ed14b07772ce",
    "created_at": "2024-01-03T02:07:15.402687Z",
    "updated_at": "2024-11-22T02:02:56.718745Z",
    "deleted_at": null,
    "sha1_hash": "3f76b2e6e9861c0c3e4205dfeb5a9868539f4bb6",
    "title": "A Look at the Nim-based Campaign Using Microsoft Word Docs to Impersonate the Nepali Government",
    "authors": "Netskope",
    "file_creation_date": "2024-01-02T02:54:01Z",
    "file_modification_date": "2024-01-02T02:54:01Z",
    "file_size": 827426,
    "plain_text": "A Look at the Nim-based Campaign Using Microsoft\nWord Docs to Impersonate the Nepali Government\nnetskope.com/blog/a-look-at-the-nim-based-campaign-using-microsoft-word-docs-to-impersonate-the-nepaligovernment\nDecember 20, 2023\n\nSummary\nThreat actors often employ stealthy attack techniques to elude detection and stay under the\ndefender’s radar. One way they do so is by using uncommon programming languages to\ndevelop malware. Using an uncommon programming language to develop malware provides\nseveral benefits, including:\nEvading some signature based detections\nImpeding analysis by malware analysts that are unfamiliar with the language\nLimited community detection and published analysis\nNetskope recently analyzed a malicious backdoor written in Nim, which is a relatively new\nprogramming language. Netskope Threat labs has observed an increase in Nim-based\nmalware over the past year and expects Nim-based malware to become more popular as\nattackers continue to modify existing Nim-based samples. One of the highest-profile Nimbased malware families was the Dark Power ransomware, which began spreading in the wild\nearlier this year.\nThis blog post provides a breakdown of a recent targeted threat that uses Word document\nbait to deliver a Nim backdoor.\n\nDelivery Method\nA malicious Word document was used to drop the Nim backdoor. The document was sent as\nan email attachment, where the sender claims to be a Nepali government official sending\nsecurity arrangements. Despite the security controls placed around macros in Office files, we\nare still seeing APT-attributed malware using them to drop their payload, like the Menorah\nmalware we analyzed a couple of months ago.\nInitially opening the file will show a blank document with an instruction to enable macros.\nWhen the user clicks “Enable Content,” the auto-trigger routine (Document_Open) in the\ncode will execute. Once the main function is called, the code is executed through additional\nVBA functions inside the document.\n\n1/12\n\nMalicious Word file prior enabling macro\n\nDefense Evasion\nTo help bypass AV and static based detections, the VBA project is password protected and\nmacros are obfuscated using the Chr( ) VBA function and string concatenation. The VBA\ncode is split into the four subroutines in the image below.\n\nsch_task is a function that creates a VBscript named “OCu3HBg7gyI9aUaB.vbs” that will\nserve as the chain trigger. Initially, the VBscript is created in the AppData startup folder\n(C:\\Users\\<user>\\AppData\\Roaming\\Microsoft\\Windows\\Start\nMenu\\Programs\\Startup\\OCu3HBg7gyI9aUaB.vbs) and is set as a hidden file. Oddly, some\nvariables are initialized in one function, but then utilized in a different function/s, which could\nbe meant to confuse static analysis. Some strings referring to directories and libraries are\nsplit and then concatenated to evade static detection.\n\n2/12\n\nVBA code for sch_task routine.\n\nhide_cons is a function to create another VBScript named “skriven.vbs,” which will be used\nby “8lGghf8kIPIuu3cM.bat” as a shell to run other scripts. More detailed info about this batch\nscript is found below. Again, some strings referring to directories and libraries are split and\nthen concatenated.\n\nVBA code for hide_cons routine.\n\nread_shell is a function that creates the payload named conhost.exe, which is inside a ZIP\narchive. As can be seen from the screenshot below of the macro code, it assembles the ZIP\nfrom an array of decimals (by converting each to byte) stored in the “UserForm1” object. The\nresulting byte array is the actual ZIP file and is dropped to C:\\Users\\\n<user>\\AppData\\Local\\Microsoft\\conhost.zip\n\n3/12\n\nVBA code for read_shell routine.\n\nUserForm1 Containing Decimal/Bytes.\n\nvb_chainis a function mainly for creating “8lGghf8kIPIuu3cM.bat”, which will be the stage of\ninfection before the final payload. Exact file paths are generated by the VBA macro before\nwriting to the batch file.\n\n4/12\n\nvb_chain code snapshot.\n\nDropped Files Summary:\ne2a3edc708016316477228de885f0c39.doc drops:\nOCu3HBg7gyI9aUaB.vbs (C:\\Users\\\n<user>\\AppData\\Roaming\\Microsoft\\Windows\\Start\nMenu\\Programs\\Startup\\OCu3HBg7gyI9aUaB.vbs)\nskriven.vbs (C:\\Users\\<user>\\AppData\\Local\\skriven.vbs)\nconhost.zip (C:\\Users\\<user>\\AppData\\Local\\Microsoft\\conhost.zip)\n8lGghf8kIPIuu3cM.bat (C:\\Users\\<jack>\\AppData\\Local\\8lGghf8kIPIuu3cM.bat) drops\nthese in C:\\Users\\<user>\\AppData\\Local:\nunzFile.vbs\nunz.vbs\n2L7uuZQboJBhTERK.bat\n2BYretPBD4iSQKYS.bat\nd.bat\ne.bat\n\n5/12\n\nNim Backdoor\nThe Word document drops a malicious backdoor named “conhost.exe”. The malware is\nwritten in Nim and was likely compiled on September 20, 2023. Nim is a statically typed\ncompiled programming language. Its versatility shines through its ability to be compiled to C,\nC++, or JavaScript, coupled with a Pythonic syntax for a developer-friendly experience.\n\n6/12\n\nThe backdoor runs within the same privilege as the current user logged in. It’s looking to\ncontinue its ploy that the file was from a Nepali authority by imitating government domains for\nits C&C server ([.]govnp[.]org). When this backdoor is left undetected, users are at risk of\nhaving attackers gaining remote access.\nEven though the C2 servers are no longer accessible at the time of analysis, we were still\nable to extrapolate some of its behaviors, which can be seen below.\n\nAnti-analysis Technique\nThe malware performs a simple background check before connecting to its command and\ncontrol server. Initially, the Nim backdoor spawns a command prompt to run tasklist.exe and\nchecks for any processes running from its list of known analysis tools. The backdoor will\nterminate itself shortly if it sees any of the analysis tools from the list running.\n\n7/12\n\nProcesses the backdoor avoids\n\nCommand and control through web protocol\nOnce the backdoor confirms there are no analysis tools running, it will spawn another\ncommand prompt instance to get the machine’s hostname, then connect to its C&C server. It\nencrypts the hostname with a function named bakery. The encrypted hostname is encoded\ntwice in base64, spliced behind a randomly chosen C&C server URL, and then concatenated\nwith the “.asp” suffix at the end to obtain the URL of the final command. The command\ndelivered by the C&C server is obtained through an HTTP GET request.\nResponse data from GET contains the command from the C&C server. If the response data\nis different from the last time it was fetched, it means that the C&C server has issued a new\ncommand. Otherwise it will be dormant and keep requesting the command from the C&C\nserver. Decryption of response data (command) is done by the confectionary function, then\nconcatenated with cmd /c to execute the command. The execution result is also sent back to\nthe server through a GET request. The key used for encryption and decryption is “NPA”,\nwhich may be an abbreviation of NP (Nepal) Agent.\n8/12\n\nScreenshot of network traffic specific to the sample.\n\nThe sample contacts the following C2 hosts:\nmail[.]mofa[.]govnp[.]org\nnitc[.]govnp[.]org\nmx1[.]nepal[.]govnp[.]org\ndns[.]govnp[.]org\n\nPersistence through Startup Folder and Scheduled Task\nTo retain access on the machine, a VBscript named “OCu3HBg7gyI9aUaB.vbs” is placed in\nthe startup folder. The script will initially confirm an internet connection using WMI’s\n“Win32_PingStatus” class to ping https://www.google[.]com. If successful, it will run a batch\nfile named “8lGghf8kIPIuu3cM.bat”.\nThe main task of the batch file “8lGghf8kIPIuu3cM.bat” is to drop files that will further unpack\nand create a scheduled task for the payload. The batch file will create more scripts that will\ncarry out these subtasks:\nunz.vbs is used for decompressing the executable out from the archive into the same\ndirectory\nunzFile.vbs creates unz.vbs\n2L7uuZQboJBhTERK.bat is just for chaining; runs unzFile.vbs then runs\n2BYretPBD4iSQKYS.bat\n2BYretPBD4iSQKYS.bat is just for chaining; runs unz.vbs then runs d.bat\nd.bat creates a scheduled task of the unpacked payload (conhost.exe) then runs e.bat\ne.bat deletes itself and the other scripts created by 8lGghf8kIPIuu3cM.bat\n\n9/12\n\nThe batch file named “d.bat” creates a scheduled task to attain another persistent execution\nof the malware on the target machine. The scheduled task is named\n“ConsoleHostManager” as seen in the below screenshot.\n\nScreenshot for Scheduled Task created.\n\nNetskope Detection\nNetskope Advanced Threat Protection provides proactive coverage against zero-day and\nAPT samples of malicious Office documents using both our static analysis engines and cloud\nsandbox. The following screenshot shows the detection for\ne2a3edc708016316477228de885f0c39, indicating it was detected by Netskope Cloud\nSandbox, Netskope Advanced Heuristic Engine, and Netskope Threat Intelligence.\n\n10/12\n\nConclusions\nMalware written in uncommon programming languages puts the security community at a\ndisadvantage as researchers and reverse engineers’ unfamiliarity can hamper their\ninvestigation. Nim is one of the young programming languages increasingly abused by\nmalware authors. Aside from its familiar syntax, its cross-compilation features allow attackers\nto write one malware variant and have it cross-compiled to target different platforms.\nNetskope Threat Labs will continue monitoring the usage of unpopular programming\nlanguages.\n\nIOCs\nMD5\ne2a3edc708016316477228de885f0c39\n777fcc34fef4a16b2276e420c5fb3a73\nEF834A7C726294CE8B0416826E659BAA\n32C5141B0704609B9404EFF6C18B47BF\nSHA-1\n3aa803baf5027c57ec65eb9b47daad595ba80bac\n5D2E2336BB8F268606C9C8961BED03270150CF65\n4CAE7160386782C02A3B68E7A9BA78CC5FFB0236\n0599969CA8B35BB258797AEE45FBD9013E57C133\nSHA-256\nb5c001cbcd72b919e9b05e3281cc4e4914fee0748b3d81954772975630233a6e\n696f57d0987b2edefcadecd0eca524cca3be9ce64a54994be13eab7bc71b1a83\n11/12\n\n88FA16EC5420883A9C9E4F952634494D95F06F426E0A600A8114F69A6127347F\n1246356D78D47CE73E22CC253C47F739C4F766FF1E7B473D5E658BA1F0FDD662\nNetwork\nmail[.]mofa[.]govnp[.]org\nnitc[.]govnp[.]org\nmx1[.]nepal[.]govnp[.]org\ndns[.]govnp[.]org\nThank you to Juan Diego Huet for helping analyze the sample files and contributing to this\nblog.\nGhanashyam Satpathy\nGhanashyam Satpathy is a Principal Researcher with the Netskope Efficacy team, which\ndrives the detection effectiveness. His background is building threat detection products using\nAI/ML technology for cloud and endpoint security.\n\n12/12",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/rel585pqa8fc80voc96wt9oidsik0pvl"
    ],
    "report_names": [
        "Netskope_Nim-based-Campaign-Word-Docs-Impersonate-Nepali-Gov(12-20-2023)"
    ],
    "threat_actors": [],
    "ts_created_at": 1704247635402,
    "ts_updated_at": 1732240976718,
    "ts_creation_date": 1704164041000,
    "ts_modification_date": 1704164041000,
    "files": {
        "pdf": "https://archive.orkl.eu/3f76b2e6e9861c0c3e4205dfeb5a9868539f4bb6.pdf",
        "text": "https://archive.orkl.eu/3f76b2e6e9861c0c3e4205dfeb5a9868539f4bb6.txt",
        "img": "https://archive.orkl.eu/3f76b2e6e9861c0c3e4205dfeb5a9868539f4bb6.jpg"
    }
}