{
    "id": "c91e617a-de3c-4158-ac41-1f49f75d913b",
    "created_at": "2023-05-06T02:10:01.600796Z",
    "updated_at": "2024-11-22T02:02:54.637647Z",
    "deleted_at": null,
    "sha1_hash": "4e15405b89fc3f787f7c3175d3f9b7b0ffb1b265",
    "title": "2023-02-08 - Investigating Intrusions From Intriguing Exploits",
    "authors": "",
    "file_creation_date": "2023-05-05T01:48:04Z",
    "file_modification_date": "2023-05-05T01:48:04Z",
    "file_size": 451962,
    "plain_text": "Investigating Intrusions From Intriguing Exploits\nhuntress.com/blog/investigating-intrusions-from-intriguing-exploits\n\nSummary\nOn 02 February 2023, an alert triggered in a Huntress-protected environment. At first glance, the alert itself was fairly\ngeneric - a combination of certutil using the urlcache flag to retrieve a remote resource and follow-on scheduled\ntask creation - but further analysis revealed a more interesting set of circumstances. By investigating the event in\nquestion and pursuing root cause analysis (RCA), Huntress was able to link this intrusion to a recently-announced\nvulnerability as well as to a long-running post-exploitation framework linked to prominent ransomware groups. As a\nresult of a combination of quick initial triage and action with deeper investigation, Huntress was able to mitigate and\nprevent an intrusion likely leading to a disruptive ransomware incident.\n\nThe Event\nThe Huntress Threat Operations Center received two alerts for a managed host on 02 February 2023. The first alert\nwas for certutil downloading a file from a remote resource:\n\nUsing certutil to download a file is not malicious by itself. The important question to ask about this activity is always,\n\"What was downloaded?\" In this case we were unable to obtain much information immediately. We tried connecting to\nthe resource ourselves to pull down the file and analyze it, but the port seemed to already be closed.\nLooking at publicly available resources, VirusTotal did show a couple resources that marked this IP as malicious, and\nthat it was physically hosted in Bulgaria. This information was not enough to be sure what was happening, but did\nindicate that the IP address likely was not a known-good IP address associated with the organization.\n\n1/9\n\nSince we are unable to obtain the file, at this point, to analyze it directly, and little information was available publicly, we\nhad to look for other evidence on the system itself to try and find out if this was malicious activity. Looking more closely\nat the first command executed, the file was downloaded to the C:\\users\\Public directory followed by attempted\nexecution of the downloaded file with rundll32.exe. Storing and executing files out of the C:\\users\\Public directory\nis a common tactic used by adversaries, so this made the activity seem more suspicious. Knowing that the DLL was\nalso executed further raised the risk level of the incident, since if it was malware that was downloaded, it is now running\non the system.\n\nThe main question we wanted to answer at this point was: What was the dll? What does it do? Since the file was no\nlonger present on the host, we could not do any Reverse Engineering or Malware Analysis ourselves. However, one\npart of the execution of the dll pointed to what might be happening.\nThe attempted execution command was: rundll32.exe C:\\\\Users\\\\Public\\\\gamft.dll,ChkdskExs indicating the\nexecution of a specified exported resource within the DLL. This is a normal behavior, however this SPECIFIC entry\npoint is not normal and is in fact quite unique, and this resulted in the second alert for this host. Huntress has\npreviously observed this activity from malware named Truebot, which references the same export. This can be seen in\nthe strings of a different known Truebot DLL:\n\n2/9\n\nHuntress was able to further determine the DLL was likely malicious based on the creation of very specifically-named\nScheduled Tasks used as persistence to execute the malicious DLL. These tasks were named:\nNvTmRep_CrashReport3_{B2FE1952-0186-36D3-AAHC-AB80CA35AH5B6}\nNvTmRep_CrashReport2_{B2FE1952-0186-26H3-AAHC-FB80AA35AH5B1}\n\nThese tasks pointed to the same DLL execution previously described: rundll32.exe\nC:\\\\Users\\\\Public\\\\gamft.dll,ChkdskExs Notably, these task names also followed a pattern consistent with recent\nTruebot samples we have seen, illustrated in the following regular expression (regex): NvTmRep_CrashReport[0-9]\n{1}_{[0-9A-Z]{1}2FE1952-0186-[0-9A-Z]{4}-AAHC-[0-9A-Z]{7,8}AH5B[0-9]{1}} .\nThe above regex provided an additional detection touchpoint for Huntress. These names are designed to masquerade\nas legitimate NVIDIA crash report scheduled tasks using NVTmRep.exe, illustrated as follows:\nNvTmRep_CrashReport4_{B2FE1952-0186-46C3-BAEC-A80AA35AC5B8}\n\nThese tasks normally execute a legitimate NVIDIA executable file, such as:\nC:\\Program Files\\NVIDIA Corporation\\NvBackend\\NvTmRep.exe.\nAnother important factor Huntress observed was that these two commands (certutil and rundll32) both were\nexecuted by the user GoAnywhereSvcAcct on a host that was clearly designated to process GoAnywhereMFT\ntransactions.\nThe question with odd commands executed on a server should be, \"Where did they come from?\" In this case the parent\nprocess was tomcat.exe executing from a subdirectory inside the C:\\Program Files\\Linoma Software\\GoAnywhere\ndirectory. Apache Tomcat is an open-source Java Web Application Server, and is typically accessed from the internet as\na web server; this does not normally include executing native utilities such as certutil.exe or rundll32.exe on the host\noperating system!\n\n3/9\n\nThe activity, at this point, appears to be a web server compromise of some kind, which resulted in the download and\nexecution of a malicious file. Initial observations indicate a likely overlap or relationship with Truebot, but insufficient\nevidence is available to support this claim at this point in the investigation.\nThe method used to gain access to the server was unknown at this point, and the intended post-exploitation activity on\nthe host is also unknown, as no further activity had yet been observed via EDR telemetry. Interestingly, Huntress\nidentified that after the server was isolated due to the observed activity, a similar alert was received for another system\nin the organization; this system was also designated for GoAnywhereMFT services. This raised even more suspicion\nabout the nature of this attack and the involvement of the GoAnywhereMFT application, and prompted deeper research\nand analysis.\n\nResearch and Root Cause Analysis\nAfter initial triage and incident response, the Huntress team investigated how and why the observed activity took place.\nCentral to this analysis was understanding the relationship of the observed malicious activity - a combination scheduled\ntask creation, and apparent second-stage payload retrieval - to parent processes and executing users.\nFor both impacted servers, the source of activity appeared to be the same; execution under a service account\n(GoAnywhereSvcAcct) in the context of the Apache Tomcat web server. This combination, along with the names of the\nimpacted servers, link to the GoAnywhere Managed File Transfer (MFT) software. Although precise reasons why this\nsoftware was involved remain indeterminate at this point, Huntress analysts were able to trace compromise activity to\nthis application.\nAt this stage, several possibilities presented themselves; for one, an adversary may have brute-forced remote\nconnectivity for the servers in question to gain access to the environment and then run subsequent commands in the\ncontext of the compromised account. Alternatively, the service itself may have been exploited, resulting in follow-on\nremote code execution (RCE) in the victim environment as child processes under the GoAnywhere software.\nIn the moments of initial analysis and triage, the precise cause or route to adversary command execution was unknown\n- a not unexpected set of circumstances in the middle of time-sensitive managed defense and response. However,\nfurther research and analysis, as well as diligent monitoring of open source reporting and social media posting, would\nsoon prove beneficial in revealing more about this event, and enable proper contextualization of the incident.\n\nOpen Source Analysis and Links\nOn 02 February 2023, roughly in concert with the incident described above, security reporter Brian Krebs posted on\nMastodon regarding a RCE vulnerability in GoAnywhere MFT software. The security advisory, which was not made\npublic and as of this writing has no CVE associated with it,was described as follows:\nA Zero-Day Remote Code Injection exploit was identified in GoAnywhere MFT. The attack vector of this exploit\nrequires access to the administrative console of the application, which in most cases is accessible only from\nwithin a private company network, through VPN, or by allow-listed IP addresses (when running in cloud\nenvironments, such as Azure or AWS).\nBased on this description and given the combination of impacted hosts (GoAnywhere file servers), subsequent\nimpacted users and processes (linked to GoAnywhere operations), and observed actions (attempted second-stage\nretrieval), we arrive at a plausible explanation for the observed alerts. A GoAnywhere server with an externally-exposed\n\n4/9\n\nmanagement interface was compromised on or before 02 February 2023 leading to attempted post-exploitation survey\nand persistence activity.\nFollowing initial analysis and discovery, further research emerged identifying the specific vulnerability in GoAnywhere\nMFT software on 06 February 2023. Given the relative simplicity of the vulnerability (and ability to reverse engineer a\npayload based on the vendor’s non-public advisory), Huntress considers this analysis as effectively the release of a\nproof of concept (POC) for this exploit in the wild. As a result, we anticipate wider activity.\n\nArtifact Analysis and Potential Responsibility\nAlthough Huntress already performed significant analysis of the infected hosts and subsequent actions (attempted or\notherwise) following exploitation, true RCA requires “digging deeper.” While details are somewhat sparse, enough items\nremain, from network infrastructure to a malware sample, to engage in further research and analysis.\n\nInfrastructure Research\nThe IP address referenced, 5.188.206[.]76, is associated with a Bulgarian virtual private server (VPS) provider. While\nthis alone may be suspicious, as analysts we should dig further to understand, if possible, the creation, disposition, and\nuse of this infrastructure.\nBased on the command observed via EDR telemetry and alerting, the remote host had an HTTP listener on TCP 8000\non 02 February 2023. Notably, this port is associated with the GoAnywhere MFT administrative access port, the target\nof the reported RCE. Subsequent research and investigation show that this port (and all others, except SSH) were\nclosed off shortly after the incident, resulting in only remote administration possibilities. It is therefore possible that the\nthreat actor rotates infrastructure frequently, making IP blocklists and similar of limited utility for proactive defense, or\nthis specific piece of infrastructure was recognized as “burned,” and thus “shut down” from further operations.\nThe combination of communication direct to an IP address (i.e., not using a domain name with its corresponding DNS\nlookup) combined with a nonstandard port for a standard service (HTTP over TCP 8000) provides a potential detection\npoint, albeit a limited one. With limited additional details to explore, this avenue of investigation is closed off; we have\nan IP address, but limited ability (given the initial case) to explore further absent additional observations.\n\nBinary Research\nWith network infrastructure research closed off, we can proceed with analysis of the binary in question that was hosted\non the remote resource. Huntress was eventually able to recover a copy of this file, with the following characteristics:\nName: gamft.dll\nMD5: 82d4025b84cf569ec82d21918d641540\nSHA1: 62f5a16d1ef20064dd78f5d934c84d474aca8bbe\nSHA256: c042ad2947caf4449295a51f9d640d722b5a6ec6957523ebf68cddb87ef3545c\n\nThe file was compiled in late January 2023, shortly but not immediately before the incident in question, and contains a\nnumber of interesting characteristics. One item that immediately stands out is the filename. “Gamft” may seem semirandom at first, but appears to be an abbreviation for “GoAnywhere Managed File Transfer.” Huntress is not aware of\nany legitimate DLLs associated with GoAnywhere MFT software or what their naming convention would be, but\ndeliberate mimicry likely represents an effort by the adversary to evade detection or further scrutiny.\nIn addition to the “legitimate” name, the file is a signed binary, using the following signing certificate issued via Sectigo:\nName: SAVAS INVESTMENTS PTY LTD\nStatus: Valid\nIssuer: Sectigo Public Code Signing CA R36\nValid From: 12:00 AM 10/07/2022\nValid To: 11:59 PM 10/07/2023\nThumbprint: 8DCCF6AD21A58226521E36D7E5DBAD133331C181\nSerial Number: 00-82-D2-24-32-3E-FA-65-06-0B-64-1F-51-FA-DF-EF-02\n5/9\n\nQuick searches identify posts on social media as well as other resources flagging this certificate (or at least, certificates\nassociated with “Savas”) as linked to malicious activity.\nFurther investigation reveals signs of functionality, such as strings referencing follow-on PowerShell and WMI\nfunctionality, as well as POST activity to command and control (C2) infrastructure. What stood out though are\nreferences to what appear to be commands or functions for the malware:\nKLLS\n404NO\n\nFinally, analysis of execution identified the C2 infrastructure for this sample:\nhXXp://qweastradoc[.]com/gate[.]php\n\nThe combination of items, including the use of a Sectigo code signing certificate, command string references, and C2\ndomain and infrastructure patterns, aligns closely with a campaign initially described by Cisco Talos in December 2022.\nBased on preliminary analysis, Huntress’ earlier hypothesis on the nature of this malware appears to be correct, that the\nrecovered DLL appears to be an updated version of a malware family referred to as Truebot, associated with a\nRussian-language actor known as Silence.\n\nPotential Responsibility\nWhile Huntress was able to identify and contain this infection event before further adversary actions could take place,\nenough bits of information are available to arrive at some plausible theories on responsibility. As previously mentioned,\nTruebot is linked to a group referred to as Silence. As reported by the French CERT, Silence has been active in some\nform since 2016, with Truebot serving as an initial access, post-compromise tool for the entity’s operations.\nWhile links are not authoritative, analysis of Truebot activity and deployment mechanisms indicate links to a group\nreferred to as TA505. Distributors of a ransomware family referred to as Clop, reporting from various entities links\nSilence/Truebot activity to TA505 operations. Based on observed actions and previous reporting, we can conclude with\nmoderate confidence that the activity Huntress observed was intended to deploy ransomware, with potentially additional\nopportunistic exploitation of GoAnywhere MFT taking place for the same purpose.\n\nDefensive Guidance and Recommendations\nThe incident above spans two distinct security problems: server-side exploitation for initial system access, and postexploitation actions to “break out” of an initial access point toward wider network compromise. Resilient defense\nrequires investing in defensive countermeasures and monitoring across these phases of operations, along with laterstage actions as well had this specific incident not been identified at a relatively early stage.\n\nExploit Detection and Prevention\nIdeally, defenders can identify (or block) exploitation attempts (especially items against external-facing devices that lead\nto RCE). In this specific case, however, we appear to have a true zero day issue, where adversaries have identified a\nflaw in the targeted software (GoAnywhere MFT) before the vendor is able to release a patch. Deploying detections via\nnetwork security monitoring thus becomes implausible, and removing the vulnerability is (as of this writing) not possible\neither.\nApproximately a week after releasing the notice to customers, and after active exploitation as described above,\nGoAnywhere vendor Fortra released a patch to users on 07 February 2023. However, this still leaves an extended\nperiod of vulnerability even if organizations are able to rapidly test and deploy this fix. For events such as these in the\nfuture, organizations should first and foremost work to limit externally-exposed services to only those necessary for\nbusiness function, and work to secure and monitor those remaining items as part of attack surface management.\nUnfortunately, while this advice is sound, it is also difficult to implement and maintain over time. System owners and\ndefenders must therefore extend defense and monitoring beyond the perimeter to ensure that if (or more likely when)\nan adversary gains initial access, options remain for detecting and defeating such activity.\n6/9\n\nPost-Exploit Defense and Identification\nCritically in this incident, Huntress identified and initiated a response very early in this attacker’s lifecycle through\nidentification of post-exploitation behaviors. Defenders must look for opportunities to flag and respond to behaviors\nstrongly correlated with malicious activity. Examples linked to this event include but are not limited to the following\npossibilities:\nUse of certutil to retrieve and decode remotely-hosted content.\nNon-standard or unusual applications (such as Apache Tomcat) spawning processes such as certutil\n(along with other deobfuscation or execution mechanisms such as PowerShell or similar).\nUnusual use of rundll32.exe such as calling binaries from atypical disk locations.\nAttempts to achieve persistent presence on a system through the creation of new scheduled tasks.\nWhile adversaries may gain initial access to the defended network, layered monitoring of post-exploitation activity can\ndetect (and hopefully defeat) adversaries before they can harden their presence within the network, and move laterally.\n\nConclusions\nHuntress identified and mitigated an intrusion associated with exploitation of a zero day through layered monitoring of a\nclient environment. By catching post-exploitation activity at an early stage, the victim organization was able to avoid a\nlikely ransomware event that could have cost the entity dearly.\nThrough a combination of layered detection and monitoring as well as post-incident RCA, Huntress researchers\nidentified not only the likely cause of this incident (exploitation of a vulnerability in GoAnywhere MFT), but also links to\nbroader criminal cyber activity. Through repeated application of these mechanisms - incident response, incident\nanalysis, and post-incident research - organizations can not only ensure adequate response to intrusions, but also\nreveal motivations and deeper technical behaviors that underlie them.\n\nAssociated Intrusion Indicators\nHost Indicators\nSHA256\n\nFile Name\n\nCompilation\nDate\n\nComment\n\nc042ad2947caf4449295a51f9d640d722b5a6ec6957523ebf68cddb87ef3545c\n\ngamft.dll\n\n25 Jan\n2023\n\nTruebot\nDLL\nidentified\nin\nincident.\n\n0e3a14638456f4451fe8d76fdc04e591fba942c2f16da31857ca66293a58a4c3\n\nlarabqFa.exe\n\n18 Jan\n2023\n\nRelated\nTruebot\nDLL\nsample.\n\nc9b874d54c18e895face055eeb6faa2da7965a336d70303d0bd6047bec27a29d\n\nPxaz.dll\n\n11 Jan\n2023\n\nRelated\nTruebot\nDLL\nsample.\n\nNetwork Indicators\n\n7/9\n\nObservation\n\nComment\n\n5.188.206[.]76\n\nHosting location for Truebot.\n\nqweastradoc[.]com\n\nC2 domain for Truebot.\n\n92.118.36[.]213\n\nHosting IP for Truebot C2 domain.\n\nDetection Opportunities\nIn addition to the indicators above, organizations can leverage tools such as Sigma to identify suspicious behaviors\nlinked to this intrusion. Huntress has an example of such a rule, looking for instances of Apache Tomcat spawning a\nprocess.\n\nMITRE ATT&CK Mapping\nTactic\n\nTechnique\n\nDescription\n\nInitial Access\n\nT1190 - Exploit Public Facing\nApplication\n\nAdversary gained initial access via exploit of\nGoAnywhere MFT service.\n\nExecution\n\nT1203 - Exploitation for Client Execution\n\nAdversary gained code execution capability\nthrough exploit of GoAnywhere MFT service.\n\nPersistence\n\nT1053.005 - Scheduled Task/Job:\nScheduled Task\n\nAdversary created scheduled tasks for\npersistence purposes.\n\nDefense Evasion\n\nT1036.004 - Masquerading:\nMasquerade Task or Service\n\nAdversary used file naming conventions to\nimpersonate legitimate-looking processes and\nfiles.\n\nT1553.002 - Subvert\nTrust Controls: Code\nSigning\n\nAdversary used a valid code signing\ncertificate for Truebot payload.\n\nT1078.003 - Valid\nAccounts: Local Accounts\n\nAdversary used account associated with\nexploited process for subsequent\nactions.\n\nT1140 Deobfuscate/Decode\nFiles of Information\n\nAdversary used certutil to decode an\nencoded Truebot payload.\n\nT1218.011 - System\nBinary Proxy Execution:\nRundll32\n\nAdversary used Rundll32 to attempt\nexecution of Truebot payload.\n\nCommand and Control\n\nT1071.001 - Application Layer Protocol:\nWeb Protocols\n\nTruebot payload C2 communications\nperformed over HTTP.\n\n8/9\n\nT1105 - Ingress Tool\nTransfer\n\nAdversary attempted to retrieve and\nbuild Truebot payload via certutil\ncommand.\n\nT1571 - Non-Standard\nPort\n\nAdversary used HTTP over a nonstandard port for Truebot payload\nretrieval.\n\nT1132.001 - Data\nEncoding: Standard\nEncoding\n\nAdversary encoded Truebot payload for\nstandard decoding via certutil.\n\n*Special thanks to Matt Anderson for his help with writing this blog.\n\nJoe Slowik\nThreat Intelligence Manager at Huntress.\n\n9/9",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-08 - Investigating Intrusions From Intriguing Exploits.pdf"
    ],
    "report_names": [
        "2023-02-08 - Investigating Intrusions From Intriguing Exploits.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2024-11-22T02:00:52.404464Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2024-11-22T02:02:01.177634Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2024-11-22T02:00:02.607544Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "GRACEFUL SPIDER",
                "Hive0065",
                "CHIMBORAZO",
                "Spandex Tempest",
                "ATK103",
                "SectorJ04",
                "SectorJ04 Group",
                "GOLD TAHOE",
                "Dudear",
                "G0092"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2024-11-22T02:02:53.082334Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2024-11-22T02:00:52.363982Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2024-11-22T02:02:01.197762Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1683339001600,
    "ts_updated_at": 1732240974637,
    "ts_creation_date": 1683251284000,
    "ts_modification_date": 1683251284000,
    "files": {
        "pdf": "https://archive.orkl.eu/4e15405b89fc3f787f7c3175d3f9b7b0ffb1b265.pdf",
        "text": "https://archive.orkl.eu/4e15405b89fc3f787f7c3175d3f9b7b0ffb1b265.txt",
        "img": "https://archive.orkl.eu/4e15405b89fc3f787f7c3175d3f9b7b0ffb1b265.jpg"
    }
}