{
    "id": "150e3643-6ae1-4721-acda-c1b047343304",
    "created_at": "2023-05-06T02:08:36.375158Z",
    "updated_at": "2024-11-22T02:03:49.237515Z",
    "deleted_at": null,
    "sha1_hash": "67ebb183d4a9cb7ed32406499316aaaa8f637357",
    "title": "2023-04-19 - Ukraine remains Russia’s biggest cyber focus in 2023",
    "authors": "",
    "file_creation_date": "2023-05-05T02:01:26Z",
    "file_modification_date": "2023-05-05T02:01:26Z",
    "file_size": 1177498,
    "plain_text": "Ukraine remains Russia’s biggest cyber focus in 2023\nblog.google/threat-analysis-group/ukraine-remains-russias-biggest-cyber-focus-in-2023\nBilly Leonard\n\nApril 19, 2023\n\nThreat Analysis Group\n\nGoogle’s Threat Analysis Group (TAG) continues to disrupt campaigns from multiple sets of\nRussian government-backed attackers focused on the war in Ukraine. This blog provides\ninsights on attacker trends from primarily January - March 2023, continuing our analysis from\nFog of War: How the Ukraine Conflict Transformed the Cyber Threat Landscape.\nIn the first quarter of 2023, Russian government-backed phishing campaigns targeted users\nin Ukraine the most, with the country accounting for over 60% of observed Russian targeting.\nLooking at information operations (IO), our takedowns reflect a steady pattern of Russian\nattempts to circumvent our policies, details of which are reported in our quarterly TAG\nBulletin.\nHere is a deeper look at notable campaigns TAG has observed since our last update:\n\nFROZENBARENTS targets energy sector, continues hack and leak\noperations\nFROZENBARENTS (aka Sandworm), a group attributed to Russian Armed Forces’ Main\nDirectorate of the General Staff (GRU) Unit 74455, continues to focus heavily on the war in\nUkraine with campaigns spanning intelligence collection, IO, and leaking hacked data\nthrough Telegram.\nAs we described in the Fog of War report, FROZENBARENTS remains the most versatile\nGRU cyber actor with offensive capabilities including credential phishing, mobile activity,\nmalware, external exploitation of services, and beyond. They target sectors of interest for\nRussian intelligence collection including government, defense, energy,\ntransportation/logistics, education and humanitarian organizations.\nFROZENBARENTS continues to exploit EXIM mail servers globally and use these\ncompromised hosts as part of their operational network, a trend going back to at least August\n2019. These compromised hosts have been observed accessing victim networks, interacting\nwith victim accounts, sending malicious emails and engaged in information operations (IO)\nactivity.\n\nEnergy sector targeting\n1/11\n\nThe Caspian Pipeline Consortium (CPC) controls one of the world's largest oil pipelines that\ntransports oil from Kazakhstan to the Black Sea. Since November 2022, FROZENBARENTS\nhas engaged in a sustained effort to target organizations associated with the CPC and other\nenergy sector organizations in Europe. The first campaign targeted CPC employees,\nspecifically the Moscow office, with phishing links delivered via SMS.\nimage of a phishing site spoofing CPC, an energy sector organization\nPhishing site spoofing CPC, an energy sector organization\nThroughout Q1 2023, FROZENBARENTS conducted multiple campaigns against energy\nsector organizations in Eastern Europe, delivering links to fake Windows update packages\nhosted on a domain spoofing CPC. If executed, the fake update would run a variant of the\nRhadamanthys stealer to exfiltrate stored credentials, including browser cookies.\n\nDefense targeting\nBeginning in early December 2022, FROZENBARENTS launched multiple waves of\ncredential phishing campaigns targeting the Ukrainian defense industry, military and Ukr.net\nwebmail users. These phishing emails spoofed security and other system administrator type\nnotifications and in some cases were sent through third-party email campaign management\nservices.\nimage of a phishing site spoofing Ukroboronprom, a Ukrainian defense company\nPhishing site spoofing Ukroboronprom, a Ukrainian defense company\n\nIO, hack and leak campaigns\nActive in the IO space, FROZENBARENTS actors create online personas to create and\ndisseminate news content as well as leak stolen data. These actors promote narratives that\nare pro-Russia, and against Ukraine, NATO and the West. One persona, which TAG\nassesses is created and controlled by FROZENBARENTS actors, is 'CyberArmyofRussia' or\n'CyberArmyofRussia_Reborn', which has a presence on Telegram, Instagram and YouTube.\nBoth the YouTube channel, terminated upon identification, and Instagram account received\nminimal engagement with a negligible number of subscribers or followers.\n\nCyberArmyofRussia YouTube channel\n\n2/11\n\nInstagram posts from CARR\n\n3/11\n\nCyberArmyofRussia_Reborn Telegram channel\nThe CyberArmyofRussia_Reborn Telegram channel has primarily been used for posting\nstolen data and DDoS targets. In several recent incidents, FROZENBARENTS compromised\na webserver of the target organization and uploaded a webshell to maintain persistent\n\n4/11\n\naccess to the compromised system. The attackers then deployed Adminer, a single file PHP\nscript for managing databases, to exfiltrate data of interest. Shortly after exfiltration, the data\nappeared on the CyberArmyofRussia_Reborn Telegram channel.\n\nTelegram phishing\nFROZENBARENTS has targeted users associated with popular channels on Telegram, a\nsocial media platform popular in both Ukraine and Russia. Phishing campaigns delivered via\nemail and SMS spoofed Telegram to steal credentials, sometimes targeting users following\npro-Russia channels.\nimage of phishing site spoofing Telegram\nPhishing site spoofing Telegram\nAn interesting artifact of the Telegram phishing campaigns is a ‘val’ URL parameter in the\nphishing links with a base64 encoded value, providing insight into the operators’ mindset and\ntheir condescending attitude towards Ukraine and the Cyber Police of Ukraine.\nsnippet of Base64 encoded values found in phishing link URL parameter\nBase64 encoded values found in phishing link URL parameter\n\nGRU @bio_genie IO Campaign on Telegram, Substack\nSince April 2022, actors attributed to the GRU have maintained a Telegram channel to\npromote and amplify narratives related to the use of biological weapons in Ukraine and how\nthe United States is responsible for the proliferation of biological weapons around the world.\nThe Telegram channel publishes Russian-language content, and is likely aimed at Russian\nspeaking audiences. In December 2022, they also created a similarly named Substack,\npublished in English. While the Telegram channel receives regular updates, sometimes\nmultiple times per day, the Substack has only received a single post.\nThe actors controlling this channel have conducted email campaigns soliciting input from\nprominent Russian and Belarussian researchers and medical professionals involved in\nepidemiology and microbiology. Additionally, they have attempted to engage with journalists\nglobally in an attempt to drive traffic to the Telegram channel and further amplify their\nnarratives.\nWhile this activity has been conducted from infrastructure similar to known\nFROZENBARENTS infrastructure, TAG is currently unable to confidently assess if this\nactivity has been conducted by FROZENBARENTS, or if this campaign is being conducted\nby a different GRU unit.\nimage of @bio_genie Telegram channel\n@bio_genie Telegram channel\n5/11\n\nimage of @bio_genie substack\n@bio_genie substack\n\nFROZENLAKE uses XSS in phishing against Ukranian users\nIn early 2023, another Russian GRU actor TAG tracks as FROZENLAKE (aka APT28) was\nespecially focused on Ukraine. In February and March, they sent multiple large waves of\nphishing emails to hundreds of users in Ukraine, continuing the group’s 2022 focus on\ntargeting webmail users in Eastern Europe.\nStarting in early February 2023 we saw FROZENLAKE using reflected cross-site scripting\n(XSS) on multiple Ukrainian government websites to redirect users to phishing pages - a new\nTTP for the group. Recent examples of these reflected XSS are included below.\nimage of code\nimage of code\nRecent examples of reflected XSS\nimage of ukr.net phishing page\nukr.net phishing page\nThe majority of observed phishing domains were created on free services and used for a\nshort time, often a single campaign. When a user submitted their credentials on the phishing\nsites, they were sent via HTTP POST request to a remote IP address, which TAG analysis\nidentified as compromised Ubiquiti network devices.\n\nPUSHCHA continues targeting regional webmail providers\nPUSHCHA, a Belarusian threat actor, has consistently targeted users in Ukraine and\nneighboring countries throughout the war. Their campaigns typically target regional webmail\nproviders such as i.ua, meta.ua and similar services. The phishing campaigns are targeted,\nfocused on small numbers of users in Ukraine.\nimage of PUSHCHA i.ua phishing page\nPUSHCHA i.ua phishing page\nimage of PUSHCHA meta.ua phishing page\nPUSHCHA meta.ua phishing page\n\nRussian Information Operations\nMoscow continues to leverage the full spectrum of information operations — from overt\nstate-backed media to covert platforms and accounts — to shape public perception of the\nwar in Ukraine. In the first quarter of 2023, TAG observed a coordinated IO campaign from\n6/11\n\nactors affiliated with the Internet Research Agency (IRA) creating content on Google\nproducts such as YouTube, including commenting and upvoting each other’s videos. The\ngroup has focused particularly on narratives supportive of Russia and the business interests\nof Russian oligarch Yevgeny Prigozhin, especially the Wagner Group.\nAs noted in the Fog of War report, TAG has continued to see IRA-linked actors create\nYouTube Shorts. The Shorts are crafted for a Russian domestic audience, and are often\n\"news\"-like narratives on the Ukraine war. The group was also promoting a new film by\nAurum LLC, a film company partially owned by Prigozhin. This movie has a high production\nvalue and communicates narratives portraying the Wagner Group in a positive light.\nTAG also observed IRA-linked accounts publish coordinated narratives on Blogger. The\nnarratives published by the group continue to focus on regional domestic Russian affairs.\n\nPromotion for movie film about the Wagner Group\n\nScreenshot from a YouTube short supporting the Wagner Group\n\n7/11\n\nScreenshot from a YouTube short with pro-Russian and anti-Ukrainian content\n\nFinancially motivated actors\nCERT-UA previously reported on campaigns using RomCom malware to target government\nand military officials in Ukraine by the group behind Cuba ransomware (despite the name,\nUS CISA reports no indication these actors are affiliated with the Republic of Cuba). This\nrepresents a large shift from this actor's traditional ransomware operations, behaving more\nsimilarly to an actor conducting operations for intelligence collection. TAG also observed\ncampaigns from this actor targeting attendees of the Munich Security Conference and the\nMasters of Digital conference. The attackers are using phishing URLs with spoofed domain\nnames related to ChatGPT and OpenAI. The campaigns have been relatively small in\nvolume, sent from spoofed domains, and targeting users' Gmail accounts.\n\nProtecting our users\nUpon discovery, all identified websites and domains were added to Safe Browsing to protect\nusers from further exploitation. We also send affected targeted Gmail and Workspace users\ngovernment-backed attacker alerts notifying them of the activity. We encourage anyone who\nmight be a potential target to enable Google Account Level Enhanced Safe Browsing and\nensure that all devices are updated.\nWe remain committed to identifying bad actors, disrupting their campaigns, and sharing\nrelevant information with others across industry and governments to raise awareness,\nprotect users and prevent future attacks.\n\nIOCs\nFROZENBARENTS:\n\n8/11\n\ncpcpipe[.]com\ncpcpipe[.]org\n104.156.149[.]126\nc80656fe59bdeb3e701d1f7eeaaba2ef673368b2c4947945f598e3e84a6cb7f8\ntelegram.org.security.ohsxy[.]com\ntelegram.org.4234e8234ad0f.24o1[.]com\nukroboronprom.com.ukr[.]pm\n181.119.30[.]71\n45.76.31[.]101\n45.56.93[.]83\n45.124.86[.]84\nbio_genie IO campaign:\nhttps://t.me/s/bio_genie\nhttps://biogenie.substack.com\nFROZENLAKE:\nsetnewcreds.ukr.net[.]frge[.]io\nukrprivatesite.frge[.]io\nrobot-876.frge[.]io\n85.240.182[.]23\n68.76.150[.]97\nPUSHCHA:\npassport-ua[.]site\npassport-log[.]online\nmeta-l[.]space\nsupport@passport-ua[.]online\nCuba Ransomware / RomCom:\nopenai@chatgpt4beta[.]com\nchatgpt4beta[.]com\nmod2023@masterofdigital[.]org\nmasterofdigital[.]org\n4f0b12caa97e52f3d2edada9133f2e4a3442953d14c8ed12deb7219c722ea197\nPOSTED IN:\nThreat Analysis Group\nRelated stories\n9/11\n\nThreat Analysis Group\nTAG Bulletin: Q1 2023\nThreat Analysis Group shares their Q1 2023 bulletin.\nBy Shane Huntley\nMay 01, 2023\nThreat Analysis Group\nHow we’re protecting users from government-backed attacks from North Korea\nGoogle's Threat Analysis Group shares information on ARCHIPELAGO as well as the\nwork to stop government-backed attackers.\nBy Adam Weidemann\nApr 05, 2023\nThreat Analysis Group\nSpyware vendors use 0-days and n-days against popular platforms\nGoogle’s Threat Analysis Group (TAG) tracks actors involved in information operations\n(IO), government backed attacks and financially motivated abuse. For years, TAG\nhas…\nBy Clement Lecigne\nMar 29, 2023\nThreat Analysis Group\nMagniber ransomware actors used a variant of Microsoft SmartScreen bypass\nNew research from Threat Analysis Group on Magniber's exploitation of Microsoft 0day vulnerability.\nBy Benoit Sevens\nMar 14, 2023\n\n10/11\n\nThreat Analysis Group\nFog of war: how the Ukraine conflict transformed the cyber threat landscape\nBy Shane Huntley\nFeb 16, 2023\nThreat Analysis Group\nOver 50,000 instances of DRAGONBRIDGE activity disrupted in 2022\nAn update on TAG's work to disrupt the information operation network\nDRAGONBRIDGE.\nBy Zak Butler Jonas Taege\nJan 26, 2023\n.\n\n11/11",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-19 - Ukraine remains Russia’s biggest cyber focus in 2023.pdf"
    ],
    "report_names": [
        "2023-04-19 - Ukraine remains Russia’s biggest cyber focus in 2023.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2024-11-22T02:02:01.164557Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2024-11-22T02:00:02.709751Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445",
                "PUSHCHA",
                "Storm-0257"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d58052ba-978b-4775-985a-26ed8e64f98c",
            "created_at": "2023-09-07T02:02:48.069895Z",
            "updated_at": "2024-11-22T02:02:01.215663Z",
            "deleted_at": null,
            "main_name": "Tropical Scorpius",
            "aliases": [
                "DEV-0978",
                "RomCom",
                "Storm-0978",
                "Tropical Scorpius",
                "Void Rabisu"
            ],
            "source_name": "ETDA:Tropical Scorpius",
            "tools": [
                "COLDDRAW",
                "Cuba",
                "Industrial Spy",
                "ROMCOM",
                "ROMCOM RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "555e2cac-931d-4ad4-8eaa-64df6451059d",
            "created_at": "2023-01-06T13:46:39.48103Z",
            "updated_at": "2024-11-22T02:00:02.796953Z",
            "deleted_at": null,
            "main_name": "RomCom",
            "aliases": [
                "Storm-0978",
                "UAT-5647"
            ],
            "source_name": "MISPGALAXY:RomCom",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2024-11-22T02:02:53.09571Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2024-11-22T02:00:52.327181Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2024-11-22T02:02:01.118903Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a90ae795-3c01-4419-8365-07b68df72661",
            "created_at": "2024-07-02T02:00:04.158227Z",
            "updated_at": "2024-11-22T02:00:03.06034Z",
            "deleted_at": null,
            "main_name": "Dragonbridge",
            "aliases": [
                "Spamouflage Dragon"
            ],
            "source_name": "MISPGALAXY:Dragonbridge",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2024-11-22T02:02:53.09478Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2024-11-22T02:02:01.168364Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2024-11-22T02:00:02.469031Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "Pawn Storm",
                "Sednit",
                "IRON TWILIGHT",
                "TA422",
                "T-APT-12",
                "Fighting Ursa",
                "ITG05",
                "UAC-0028",
                "FANCY BEAR",
                "SNAKEMACKEREL",
                "Tsar Team",
                "Group 74",
                "G0007",
                "BlueDelta",
                "Fancy Bear",
                "Sofacy",
                "TG-4127",
                "STRONTIUM",
                "Grizzly Steppe",
                "ATK5",
                "FROZENLAKE",
                "SIG40",
                "Blue Athena",
                "APT-C-20",
                "Forest Blizzard"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2024-11-22T02:00:02.473337Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "VOODOO BEAR",
                "IRON VIKING",
                "ELECTRUM",
                "IRIDIUM",
                "Quedagh",
                "TeleBots",
                "Seashell Blizzard",
                "Blue Echidna",
                "FROZENBARENTS",
                "UAC-0113",
                "UAC-0082",
                "TEMP.Noble",
                "G0034",
                "APT44"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2024-11-22T02:00:52.392704Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2024-11-22T02:02:01.181291Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1683338916375,
    "ts_updated_at": 1732241029237,
    "ts_creation_date": 1683252086000,
    "ts_modification_date": 1683252086000,
    "files": {
        "pdf": "https://archive.orkl.eu/67ebb183d4a9cb7ed32406499316aaaa8f637357.pdf",
        "text": "https://archive.orkl.eu/67ebb183d4a9cb7ed32406499316aaaa8f637357.txt",
        "img": "https://archive.orkl.eu/67ebb183d4a9cb7ed32406499316aaaa8f637357.jpg"
    }
}