{
    "id": "8f5273b6-09f3-4509-a711-b320399b3337",
    "created_at": "2023-05-06T02:09:11.820656Z",
    "updated_at": "2024-11-22T02:03:29.789522Z",
    "deleted_at": null,
    "sha1_hash": "9654ee1a90c581e9862e93bea1485571ac07ce25",
    "title": "2023-04-20 - EvilExtractor – All-in-One Stealer",
    "authors": "",
    "file_creation_date": "2023-05-05T02:05:19Z",
    "file_modification_date": "2023-05-05T02:05:19Z",
    "file_size": 1863537,
    "plain_text": "EvilExtractor – All-in-One Stealer\nfortinet.com/blog/threat-research/evil-extractor-all-in-one-stealer\nApril 20, 2023\n\nFortiGuard Labs Threat Research\nBy Cara Lin | April 20, 2023\nAffected platforms: Windows\nImpacted parties: Any organization\nImpact: Controls victim’s device and collects sensitive information\nSeverity level: Critical\nEvilExtractor (sometimes spelled Evil Extractor) is an attack tool designed to target Windows\noperating systems and extract data and files from endpoint devices. It includes several\nmodules that all work via an FTP service. It was developed by a company named Kodex,\nwhich claims it is an educational tool. However, research conducted by FortiGuard Labs\nshows cybercriminals are actively using it as an info stealer.\n1/5\n\nBased on our traffic source data to the host, evilextractor[.]com, malicious activity increased\nsignificantly in March 2023. FortiGuard Labs observed this malware in a phishing email\ncampaign on 30 March, which we traced back to the samples included in this blog. It usually\npretends to be a legitimate file, such as an Adobe PDF or Dropbox file, but once loaded, it\nbegins to leverage PowerShell malicious activities. It also contains environment checking\nand Anti-VM functions. Its primary purpose seems to be to steal browser data and\ninformation from compromised endpoints and then upload it to the attacker’s FTP server.\nWe recently reviewed a version of the malware that was injected into a victim’s system and,\nas part of that analysis, identified that most of its victims are located in Europe and America.\nThe developer released its project in October 2022 (Figure 1) and has kept updating it to\nincrease its stability and strengthen its module.\nThis article will examine the initial attack method used to deliver EvilExtractor and its\nfunctions.\nFigure 1. EvilExtractor for sale on the web\n\nInitial Access\nThe phishing email with the malicious attachment is shown in Figure 2. It is disguised as an\naccount confirmation request. The attacker also tricks the victim by using an Adobe PDF icon\nfor the decompressed file. The PE header is shown in Figure 3.\nFigure 2. The phishing email\nFigure 3. File header of \"Account_Info.exe\"\nThe execution file is a Python program packaged by PyInstaller. We extracted it with\npyinstxtractor and found that the “PYARMOR” string in its main code file “contain.pyc”, shown\nin Figure 4, is an obfuscating tool for Python script that makes the malware harder to be\nanalyzed and detected. We extracted the key and iv from _pytransform.dll and decrypted the\n“contain.pyc” using AES-GCM.\nFigure 4. Code in \"contain.pyc\"\nIn addition to the Python program, we observed a .NET loader that can extract EvilExtractor.\nFigure 5 is part of the code. It contains Base64-encoded data, which is a PowerShell script.\nThis execution file is generated from the tool “PS2EXE-GUI”, which can convert PowerShell\nscripts to EXE Files.\nFigure 5. .Net Code for EvilExtractor\n\nEvilExtractor\n2/5\n\nAfter decrypting the pyc file, we get the primary code of EvilExtractor. It is a PowerShell\nscript that contains the following modules:\nDate time checking\nAnti-Sandbox\nAnti-VM\nAnti-Scanner\nFTP server setting\nSteal data\nUpload Stolen data\nClear log\nIt first checks whether the system’s date is between 2022-11-09 and 2023-04-12. If not, it\nuses the following command to delete the data in PSReadline and terminate:\nDEL \\\"$env:APPDATA\\Microsoft\\Windows\\PowerShell\\PSReadline\\*\\\" -Force –Recurse\n\nIt then compares the product model to see if it matches any of the following: VirtualBox,\nVMWare, Hyper-V, Parallels, Oracle VM VirtualBox, Citrix Hypervisor, QEMU, KVM, Proxmox\nVE, or Docker, as shown in Figure 6. It also checks the victim’s hostname against 187 names\nfrom VirusTotal machines or other scanner/virtual machines, as shown in Figure 7.\nFigure 6. EvilExtractor comparing product model for match\nFigure 7. Virtual environment and scanner/virtual machine checking\nAfter passing the environment check, EvilExtractor downloads three components from\nhttp://193[.]42[.]33[.]232 used for stealing data. These files are also Python programs that\nare obfuscated using PyArmor. The first is “KK2023.zip”, which is used for stealing browser\ndata and saving it in the folder “IMP_Data”. It can extract cookies from Google Chrome,\nMicrosoft Edge, Opera, and Firefox. It also collects browser history and passwords from the\nfollowing browsers:\nThe second file is “Confirm.zip”. It is a key logger that saves data in the “KeyLogs” folder.\nThe last file, “MnMs.zip”, is a webcam extractor. Its corresponding code is shown in Figure 8.\nFigure 8. Download components for the Keylogger and Webcam Snapshot functions\nEvilExtractor also collects system information by PowerShell script, shown in Figure 9.\nFigure 10 shows the concatenated data in a text file called “Credentials.txt”.\nFigure 9. PowerShell script for collecting system information\n\n3/5\n\nFigure 10. Content of “Credentials.txt”\nEvilExtractor downloads files with specific extensions from the Desktop and Download\nfolders, including jpg, png, jpeg, mp4, mpeg, mp3, avi, txt, rtf, xlsx, docx, pptx, pdf, rar, zip,\n7z, csv, xml, and html. It also uses the command “CopyFromScreen” to capture a\nscreenshot. The code is shown in Figure 11.\nFigure 11. Downloading files and getting a screenshot\nAfter EvilExtractor extracts all the data from the compromised endpoint, it uploads it to the\nattacker’s FTP server, shown in Figure 12. The developer of EvilExtractor also provides an\nFTP server for those who purchase its malware.\nFigure 12. Upload file to attacker’s FTP server\n\nKodex Ransomware\nEvilExtractor also has a ransomware function. It is called “Kodex Ransomware”, as shown in\nFigure 13. We extracted this PowerShell script from the .Net loader mentioned in the\nprevious section, and the script for its ransomware is similar to the one for its stealer.\nFigure 13. Introduction form evilextracom[.]com\nIt downloads “zzyy.zip” from evilextractor[.]com. Details of the unzipped file, a 7-zip\nstandalone console, are shown in Figure 14. Figure 15 shows it leverages “7za.exe” to\nencrypt files with the parameter “-p”, which means zipping files with a password. It also\ngenerates a ransom-demanding message saved in “KodexRansom”, shown in Figure 16.\nFigure 14. File in \"zzyy.zip\"\nFigure 15. PowerShell script for Kodex Ransomware\nFigure 16. Kodex ransomware's note\n\nConclusion\nEvilExtractor is being used as a comprehensive info stealer with multiple malicious features,\nincluding ransomware. Its PowerShell script can elude detection in a .NET loader or\nPyArmor. Within a very short time, its developer has updated several functions and\nincreased its stability. This blog explains how threat actors launch an attack via phishing mail\nand what files are leveraged to extract the EvilExtracrtor PowerShell script. We also detailed\nwhat functions are included, what data can be collected by EvilExtractor, and how the Kodex\nRansomware works. Users should be aware of this new info stealer and continue to be\ncautious about suspicious mail.\n\n4/5\n\nFigure 17. Attack Chain\n\nFortinet Protections\nThe malware described in this report are detected and blocked by FortiGuard Antivirus as:\nW32/EvilExtractor.A!tr\nW32/Infostealer.A!tr\nW32/Keylogger.A!tr\nThe FortiGuard AntiVirus service is supported by FortiGate, FortiMail, FortiClient, and\nFortiEDR, and the Fortinet AntiVirus engine is a part of each of those solutions. Customers\nrunning current AntiVirus updates are protected.\nThe FortiGuard Web Filtering Service blocks the malicious URL and IP address.\nIf you think this or any other cybersecurity threat has impacted your organization, contact our\nGlobal FortiGuard Incident Response Team.\n\nIOCs\nIP Address:\n45[.]87[.]81[.]184\n193[.]42[.]33[.]232\n\nFiles:\n352efd1645982b8d23a841107007c8b4b024eb6bb5d6b312e5783ce4aa62b685\n023548a5ce0de9f8b748a2fd8c4d1ae6c924c40acbde32e9599c868115d11f4e\n75688c32a3c1f04df0fc02491180c8079d7fdc0babed981f5860f22f5e118a5e\n826c7c112dd1ae80469ef81f5066003d7691a349e6234c8f8ca9637b0984fc45\nb1ef1654839b73f03b73c4ef4e20ce4ecdef2236ec6e1ca36881438bc1758dcd\n17672795fb0c8df81ab33f5403e0e8ed15f4b2ac1e8ac9fef1fec4928387a36d\n\nRelated Posts\nCopyright © 2023 Fortinet, Inc. All Rights Reserved\nTerms of ServicesPrivacy Policy\n| Cookie Settings\n\n5/5",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-20 - EvilExtractor – All-in-One Stealer.pdf"
    ],
    "report_names": [
        "2023-04-20 - EvilExtractor – All-in-One Stealer.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1683338951820,
    "ts_updated_at": 1732241009789,
    "ts_creation_date": 1683252319000,
    "ts_modification_date": 1683252319000,
    "files": {
        "pdf": "https://archive.orkl.eu/9654ee1a90c581e9862e93bea1485571ac07ce25.pdf",
        "text": "https://archive.orkl.eu/9654ee1a90c581e9862e93bea1485571ac07ce25.txt",
        "img": "https://archive.orkl.eu/9654ee1a90c581e9862e93bea1485571ac07ce25.jpg"
    }
}