{
    "id": "0044845e-27ab-481d-9aa7-3374d5490021",
    "created_at": "2023-12-12T02:07:29.846898Z",
    "updated_at": "2024-11-22T02:03:37.993036Z",
    "deleted_at": null,
    "sha1_hash": "a224702fbdf785b482d562117dddf5d4fd848208",
    "title": "Kimsuky Group Uses AutoIt to Create Malware (RftRAT, Amadey)",
    "authors": "Ahnlab",
    "file_creation_date": "2023-12-11T02:29:21Z",
    "file_modification_date": "2023-12-11T02:29:21Z",
    "file_size": 872121,
    "plain_text": "Kimsuky Group Uses AutoIt to Create Malware (RftRAT,\nAmadey)\nasec.ahnlab.com/en/59590\nBy Sanseo\n\nDecember 8, 2023\n\nOverview\nInitial Access\n…. 2.1. Spear Phishing Attack\n…. 2.2. LNK Malware\nRemote Control Malware\n…. 3.1. XRat (Loader)\n…. 3.2. Amadey\n…. 3.3. Latest Attack Cases\n…….. 3.3.1. AutoIt Amadey\n…….. 3.3.2. RftRAT\nPost-infection\n…. 4.1. Keylogger\n…. 4.2. Infostealer\n…. 4.3. Other Types\nConclusion\n\n1. Overview\nThe Kimsuky threat group, deemed to be supported by North Korea, has been active since\n2013. At first, they attacked North Korea-related research institutes in South Korea before\nattacking a South Korean energy corporation in 2014. Cases of attacks against countries\nother than South Korea have also been identified since 2017. [1] The group usually employs\nspear phishing attacks against the national defense sector, defense industries, the press, the\ndiplomatic sector, national organizations, and academic fields to steal internal information\nand technology from organizations. [2] (This link is only available in Korean.)\nEven until recently, the Kimsuky group was still mainly employing spear phishing attacks to\ngain initial access. What makes the recent attacks different from the previous cases is that\nmore LNK shortcut-type malware are being used instead of malware in Hangul Word\nProcessor (HWP) or MS Office document format. The threat actor led users to download a\ncompressed file through attachments or download links within spear phishing emails. When\nthis compressed file is decompressed, it yields a legitimate document file along with a\nmalicious LNK file.\nASEC is monitoring the Kimsuky group’s attacks using LNK-type malware and is\ncontinuously posting identified cases of attacks on the ASEC Blog. The Kimsuky group\ninstalls remote control malware to control the infected system after completing such steps to\n\n1/20\n\ngain initial access. Malware used by the Kimsuky group not only include custom-made such\nas AppleSeed and PebbleDash [3], but also open-source or commercial malware such as\nXRat [4], HVNC [5], Amadey [6], and Metasploit Meterpreter [7]. After gaining control, the\nthreat actor ultimately uses RDP or installs Google’s Chrome Remote Desktop [8] to\nexfiltrate information from the infected system.\nHere we analyze Amadey and RftRAT which were recently found being distributed. Amadey\nand RftRAT were constantly used throughout 2023 alongside XRat. However, recent types\nshowed that they were created with AutoIt. This post also covers Infostealers additionally\ninstalled by the Kimsuky group using remote control malware. While remote control-type\nmalware continuously change, the malware installed through these have not changed much\nin the attacks in 2023.\n\n2. Initial Access\n2.1. Spear Phishing Attack\nIn the year 2023, ASEC covered cases of LNK malware distribution in posts such as\n“Malicious LNK File Disguised as a Normal HWP Document” [9], “Malicious LNK File Being\nDistributed, Impersonating the National Tax Service” [10], and “Distribution of Malicious LNK\nFile Disguised as Producing Corporate Promotional Materials” [11].\nBy attaching files or including download links in the emails, the threat actor prompted users\nto download the compressed file and execute the LNK shortcut file inside.\n\n2/20\n\nFigure 1. LNK malware included in compressed files\n\n2.2. LNK Malware\nThe LNK file contains an encrypted compressed file, which in turn holds various malware in\nscript format.\n\n3/20\n\nFigure 2. Malware in script format contained within LNK files\n\nExecuting the LNK file decompresses the file, and ultimately, the script malware is run. The\nBAT and VBS scripts inside can either be used for executing other scripts or contain an\nInfostealer responsible for collecting and exfiltrating information from the infected system.\nThere is also a script for maintaining persistence as well as a downloader that downloads\nand executes additional payloads from an external source.\nAs such, malware in script format that run in infected systems install additional malware from\nan external source, major examples of which are backdoors called XRat, Amadey, and\nRftRAT. While these malware are all packed with VMP when in distribution, recently, Amadey\nand RftRAT variants created with AutoIt have been used. After a remote control malware is\ninstalled, keyloggers and Infostealers are installed to steal internal information and\ntechnology from the organizations.\n\n3. Remote Control Malware\n3.1. XRat (QuasarRAT)\nXRat is a RAT malware developed in .NET and was created based on QuasarRAT published\non GitHub. It was confirmed that the Kimsuky group was using XRat from a much earlier\npoint in time. Recently, instead of in independent executable or DLL file formats, this is being\nused in attacks as an encrypted payload. It consists of the file “ht.dll” which is the loader, the\ndata file “htsetting.ini” holding the configuration data, and an encrypted payload. This method\nseems to be for the purpose of bypassing security products.\n\n4/20\n\nThe loader reads, decrypts, and injects the htsetting.ini file located in the same path. All ht.dll\nloaders identified so far were packed with VMP, and the decrypted binary contained the\nfollowing strings used by the threat actor.\n\nFigure 3. Loader ht.dll packed with VMP\n\nThe configuration file contains the name of the actual encrypted malware, the RC4\ndecryption key, and information on the legitimate file to inject into. Ht.dll references this\ninformation to read and decrypt the encrypted file before injecting it into a legitimate process.\nThe payload that is injected and run in the end can be another malware besides XRat,\ndepending on the encrypted file.\n\n3.2. Amadey\nThe Kimsuky group also used Amadey Bot in their attacks. Amadey is a malware that began\nbeing sold on illegal forums. It is a downloader that installs additional malware from the C&C\nserver. Besides such downloader features, it can also transmit basic information about the\nsystem or exfiltrate screenshots and account credentials saved in web browsers and email\nclients depending on the settings or whether certain plugins are installed.\nThe Kimsuky group uses a dropper to install Amadey. This dropper, in DLL format, creates a\nrandomly named hidden folder in the %PUBLIC% path where it drops the files it holds. The\ncompressed file containing the actual Amadey is among the created files, and examining the\ncompression size shows this file to be large, exceeding 300 MB. This is also presumed to be\nan attempt to evade security products by intentionally increasing the size.\n\n5/20\n\nFigure 4. Amadey-related files created in the Public path\n\nAfterward, it creates the path “%ALLUSERSPROFILE%\\Startup” and registers it to the\nStartup folder. Here, a script named “svc.vbs” is created, which is responsible for maintaining\npersistence. Amadey, which is loaded and executed through the Rundll32.exe process, goes\nthrough svchost.exe before being injected into the iexplore.exe process and run.\n\nFigure 5. The infected system’s information transmitted to the C&C server\n\nEven in 2023, the threat actor installed Amadey in many of their attacks, and in most\ninstances, it was installed by the same type of dropper. Said dropper also included RftRAT\nbesides Amadey. RftRAT, like Amadey, also has a file size exceeding 300 MB.\nThe RftRAT instances identified in these attacks were all packed with VMP like Amadey and\nwere found to contain the keyword “RFTServer” in the decrypted strings. RftRAT is a\nbackdoor that can receive commands from the C&C server and execute them.\n\n6/20\n\nFigure 6. Decrypted strings in RftRAT\n\n3.3. Latest Attack Cases\nIt was recently identified that the Kimsuky group has been using AutoIt to create malware.\nThe Kimsuky group ported Amadey which had been used from the past to AutoIt and also\nused it for the purpose of injecting RftRAT.\nIn past attack cases, only the debug string RFTServer was found, but in recent attacks, a\nmalware containing a PDB path was found. The string within the PDB path shows that the\nthreat actor named this malware “rft” as a RAT type. Accordingly, said malware is\ncategorized as “RftRAT” here.\n\nFigure 7. RftRAT’s PDB information\n\nPDB String:\nE:_WORK\\My_Work\\Exploit\\Spyware_spy\\RAT\\RFT_Socket_V3.2\\Release\\rft.pdb\n3.3.1. AUTOIT AMADEY\n\nAs covered above, Amadey is one of the malware that has been constantly used by the\nKimsuky group. The version of Amadey used by the Kimsuky group is different from the type\nused by other threat actors: Kimsuky group’s Amadey uses Domain Generation Algorithms\n\n7/20\n\n(DGA), and when it scans for antivirus software installed in the infected system, it also\nsearches for product names from South Korean companies.\nThe recently identified Amadey is ported into the AutoIt language and has the same format\nas the types identified in the past attack cases. The threat actor installed both a legitimate\nAutoIt executable file and a compiled AutoIt script in the infected system. The compiled\nAutoIt script is 100 MB in size for the purpose of hindering analysis and contains dummy\ndata as shown below.\n\nFigure 8. The compiled AutoIt script file used in the attacks\n\nAlthough written in a different language, the decrypted AutoIt script can be considered to be\nthe Amadey malware. The HTTP request structure for sending the system information\ncollected from the infected system to the C&C server is identical to that of the typical\nAmadey.\n\nFigure 9. The structure of the HTTP packet that Amadey sends to the C&C\nserver\n\nBesides this, it also has a routine for checking for products from South Korean companies\nwhen retrieving the list of antivirus products installed in the infected system. Furthermore, it\nsupports the feature to download additional payloads in not only an exe format, but also dll,\nPowerShell, vbs, and js formats.\n\n8/20\n\nFigure 10. The script where Amadey’s routine is implemented\n\nAs mentioned above, the Amadey used by the Kimsuky group supports DGA. DGA, also\nknown as Domain Generation Algorithm, dynamically generates a domain (C&C server\naddress) instead of a fixed form. After dynamically obtaining the C&C server address based\non the date, the Kimsuky group used this as a subsidiary C&C server. When the connection\nto the C&C server was down, the subsidiary C&C server generated through DGA was used\nfor communication.\n\nFigure 11. Amadey’s DGA\n\n3.3.2. RFTRAT\n\n9/20\n\nThe AutoIt scripts used in the attacks include Amadey and RftRAT. The AutoIt executable file\nand the malicious AutoIt script are also created through a dropper. The following ASD log\nshows the execution log of “d015700.dll”, which is the dropper that installs RftRAT, and the\nlog showing RftRAT ultimately creating an Infostealer after being injected into svchost.exe.\nAdditionally, AppleSeed, another malware used by the Kimsuky group, was additionally\ninstalled in the same system afterward.\n\nFigure 12. Kimsuky group’s attack log\n\nThe RftRAT used in previous attacks is in DLL format and packed in VMP, so an exact\ncomparison is difficult. However, it was categorized into the past version of RftRAT due to the\nfact that the same library file is used, that ICMLuaUtil is used to bypass UAC, and that the\npath names used for saving C&C communication and command results are almost the same.\n\n10/20\n\nFigure 13. Strings in a past version of RftRAT similar to the latest version\n\nThe compiled AutoIt script is similar to the Amadey in the case above, but it is actually an\ninjector that executes svchost.exe and injects RftRAT into it. The ultimate payload RftRAT\ncannot be executed independently. Data must be read in from a mapped file named\n“A1CCA2EC-C09F-D33C-4317-7F71F0E2A976_0”. The injector AutoIt script writes the\npaths of the AutoIt executable file and script into this file.\n\nFigure 14. The paths of AutoIt-related files transmitted through a file mapping process\n\n11/20\n\nThe transmitted paths of the AutoIt executable file and script are used later on in the UAC\nbypassing stage. RftRAT uses the ICMLuaUtil interface of the CMSTPLUACOM component\nto bypass UAC and execute itself as administrator. After being run as administrator, RftRAT\ncollects basic information about the infected system and sends it to the C&C server.\nOffset\n\nData\n\n0x0000\n\nSignature (0x963DA7EF)\n\n0x0004\n\nInfected system’s ID\n\n0x0044\n\nIP address\n\n0x014\n\nComputer name\nTable 1. Data delivered to the C&C server\n\nFigure 15. The packet used for communication with the C&C server\n\nAfterward, it receives commands from the C&C server. RftRAT writes the received\ncommands to the path “%APPDATA%\\asc\\t1.pb” before decrypting them. Decryption yields\nthe actual commands, which are written to the same file and reread to be executed. The\ncommand, the execution results, and the additionally downloaded file are created in the\npaths below.\n\n12/20\n\nPath\n\nDescription\n\n%APPDATA%\\asc\\t1.pb\n\nCommand downloaded from the C&C server\n\n%APPDATA%\\asc\\t2.ax\n\nCommand execution results\n\n%APPDATA%\\asc\\t3.br\n\nFile downloaded through the download command\n\nTable 2. Files generated during the C&C communication and command processes\n\nCommand\n\nDescription\n\n0x00\n\nDownload file\n\n0x01\n\nUpload file (zip compressed)\n\n0x02\n\nLook up driver information\n\n0x04\n\nChange file name\n\n0x05\n\nCreate directory\n\n0x06\n\nDelete file\n\n0x07\n\nExecute file (with UAC Bypass)\n\n0x08\n\nLook up process information\n\n0x09\n\nTerminate process\n\n0x0A\n\nReverse shell\n\n0x0B\n\nTerminate process and delete file\n\n0x12\n\nTerminate\n\n0x14\n\nWait\nTable 3. RftRAT’s commands\n\n4. Post-infection\nAfter taking control of the infected system, to exfiltrate information, the Kimsuky group\ninstalls various malware such as keyloggers and tools for extracting accounts and cookies\nfrom web browsers. The group also installs Mimikatz and RDP Wrapper, which have both\nbeen steadily used for many years.\n\n4.1. Keylogger\n13/20\n\nThe keylogger is usually installed in the path\n“%ALLUSERSPROFILE%\\startup\\NsiService.exe”. It persists in the system and monitors key\ninput from the user, which is saved in the path\n“%ALLUSERSPROFILE%\\semantec\\av\\C_1025.nls” or\n“%ALLUSERSPROFILE%\\Ahn\\av\\C_1025.nls”. Additionally,\n“%ALLUSERSPROFILE%\\semantec” is a folder where the keylogger is installed, along with\nvarious malware covered in this article.\n\n4.2. Infostealer\nMalware for collecting information from web browsers were created in the\n“%ALLUSERSPROFILE%\\semantec\\” path under the names “GBIA.exe”, “GBIC.exe”,\n“GBS.exe”, and “GPIA.dll”. While most target account credentials and cookies saved in web\nbrowsers, there are types that collect files in the “Local Extension Settings” path, which is the\nconfiguration data related to Chrome extensions.\n\nFigure 16. Stealing account credentials from a web browser\n\nBesides these, the tool named “GPIA.exe” looks up all paths in the infected system and\ndisplays the files in each folder. Because the file containing the paths of all files is naturally\nlarge, it also allows this file to be split-compressed.\n\n14/20\n\nFigure 17. System path lookup tool\n\n4.3. Other Types\nA notable fact about the Kimsuky group is that it often abuses RDP for information theft.\nAccordingly, it either installs RDP Wrapper or uses a patcher malware for multiple sessions.\nRecently, there was a discovery of a malware that monitors the login records of the user. This\nseems to be for the purpose of finding out when the user logs in to use RDP to connect\nduring idle times.\nThe file “taskhosts.exe” installed in the path “%ALLUSERSPROFILE%\\semantec\\” is an\ninjector that injects “ipcheck.dll” into the “explorer.exe” and “runtimebroker.exe” processes.\n“ipcheck.dll” monitors the user’s log-on/log-off activities by hooking the\n“WinStationQueryInformationW()” and “ExitWindowsEx()” functions and the log is saved in\nthe path “%PUBLIC%\\Log64.txt”.\n\n15/20\n\nFigure 18. Log-on and log-off records saved in the log file\n\nThe threat actor also used proxy malware. Proxy tools in the past were run by receiving\ncommand line arguments, but the type used by Kimsuky reads and uses a configuration file\nnamed “setting.ini”. The port number 3389 configured in the default address indicates that it\nis likely to establish an RDP connection to a private network.\n\nFigure 19. Proxy malware\n\n5. Conclusion\n\n16/20\n\nThe Kimsuky threat group is continuously launching spear phishing attacks against South\nKorean users. Recently, malicious LNK files have been distributed to South Korean users\nwith various topics, so users are advised to practice particular caution.\nThe group usually employs the method of distributing malware through attachments or\ndownload links in emails. When a user executes them, the threat actor may be able to take\ncontrol of the system that is currently in use. The Kimsuky group has been newly creating\nand using various malware to control infected systems and steal information. Recently, the\ngroup has been using AutoIt to create malware to bypass security products.\nUsers must carefully check the senders of emails and refrain from opening files from\nunknown sources. It is also recommended to apply the latest patch for OS and programs\nsuch as Internet browsers and update V3 to the latest version to prevent such malware\ninfection in advance.\nFile Detection\n– Downloader/Win.Amadey.R626032 (2023.11.30.00)\n– Backdoor/Win.Agent.R626033 (2023.11.30.00)\n– Downloader/Win.Amadey.C5462118 (2023.07.28.03)\n– Trojan/AU3.Loader (2023.11.22.01)\n– Dropper/Win.Agent.C5542993 (2023.11.17.02)\n– Trojan/Win.Agent.C5430096 (2023.05.20.00)\n– Infostealer/Win.Agent.R622445 (2023.11.17.02)\n– Downloader/Win.Amadey.C5479015 (2023.08.31.01)\n– Trojan/Win.Agent.C5485099 (2023.09.11.03)\n– Trojan/Win.Agent.C5479017 (2023.08.31.01)\n– Trojan/Win.Loader.C5479014 (2023.08.31.01)\n– Trojan/Win.Agent.C5465186 (2023.11.30.00)\n– Infostealer/Win.Agent.C5542999 (2023.11.17.02)\n– Infostealer/Win.Agent.C5542997 (2023.11.17.02)\n– Trojan/Win.Agent.C5451959 (2023.11.30.00)\n– Trojan/Win.Agent.Prevention.C5446554 (2023.11.30.00)\n– Trojan/Win.Agent.R589022 (2023.06.28.02)\n– Trojan/Win.Loader.R588248 (2023.11.30.00)\n– Trojan/Win.Agent.C5444839 (2023.11.30.00)\n– Trojan/Win.Stealer.C5441397 (2023.11.30.00)\n– Trojan/Win.KeyLogger.C5430090 (2023.05.20.00)\n– Malware/Win.Generic.C5430065 (2023.11.30.00)\n– Trojan/Win.Stealer.R579484 (2023.05.20.00)\n– Trojan/Win.Loader.C5430091 (2023.05.20.00)\n– Trojan/Win.KeyLogger.C5430092 (2023.05.20.00)\n\n17/20\n\n– Trojan/Win.Loader.C5430099 (2023.05.20.00)\n– Trojan/Win.Proxy.C5430093 (2023.05.20.00)\n– Trojan/Win.Agent.C5430095 (2023.05.20.00)\nBehavior Detection\n– Persistence/MDP.AutoIt.M4766\n– Injection/MDP.Hollowing.M4767\nIOC\nMD5\n– f5ea621f482f9ac127e8f7b784733514 : RftRAT Dropper – AutoIt (d009086.dll)\n– 7b6471f4430c2d6907ce4d349f59e69f : Amadey – AutoIt Script (adal.au3)\n– 14a7f83d6215a4d4c426ad371e0810a2 : RftRAT – AutoIt Script (run.au3)\n– 74d5dac64c0740d3ff5a9e3aca51ccdf : RftRAT – AutoIt Script (chkdisc.au3)\n– a7c9b4d70e4fad86598de37d7bf1fe96 : RftRAT – AutoIt Script (run.au3)\n– 32696d9e1e72affaf8bc707ab271200d : Loader (ht.dll)\n– 4b667f7ea5bdc9d872774f733fdf4d6a : Loader (ht.dll)\n– 7f582f0c5c9a14c736927d4dbb47c5fa : Loader (ht.dll)\n– 94aef716b23e8fa96808f1096724f77f : Loader (ht.dll)\n– 0786984ab46482637c2d483ffbaf66dc : Loader (ht.dll)\n– 1f63ce3677253636a273a88c5b26418d : Loader (ht.dll)\n– 6f7cd8c0d9bfb0f97083e4431e4944c1 : Amadey Dropper (10.dll)\n– 4fc726ab835ce559bada42e695b3d341 : Amadey Dropper (11.dll)\n– 0fc1c99fd0d6f5488ab77e296216c7c6 : Amadey Dropper (10.dll)\n– f9c4d236b893c0d72321a9210359f530 : Amadey (svc4615.dll)\n– e22336eaf1980d2be5feed61b2dbc839 : Amadey (svc7014.dll)\n– 862a855557cc274ab86e226e45338cff : Amadey (mtms2883.dll)\n– 0f5762be09db44b2f0ccf05822c8531a : Amadey (ad53.dat)\n– c87094e261860e3a1f70b0681e1bc8c5 : Amadey (ad54.dat)\n– bac7f5eefe6a67e9555e93b0d950db59 : Amadey (d021999.dll)\n– c5a1305aba22c8fedd6624753849905b : Amadey (mtms02.dat)\n– 068d395c60e32f01b5424e2a8591ba73 : Amadey (adal66.dat)\n– f3caa0f922600b4423ebcb16d7ea2dc6 : RftRAT Dropper (_e2.dll)\n– 355817015c8510564c6ac89c976f2416 : RftRAT Dropper (_d2.dll)\n– d541aa6bae0f8c9bd7e7b6193b52e8f2 : RftRAT Dropper (d010943.dll)\n– 093608a2d6eb098eb7ea917cc22e9998 : RftRAT Dropper (30.dll)\n– f76cde928a6eda27793ade673bcd6620 : RftRAT (msc1439.dll)\n– aaa42b1209ed54bfcbd2493fe073d59b : RftRAT (mtms1929.dll)\n– 1003a440c710ddf7faa1a54919dd01d8 : RftRAT (rtm8668.dll)\n– b67e6e4c16e0309cfc2511414915df15 : RftRAT (cmms1106.dll)\n– 4d4d485d3bfd3cbc97ed4b9a671f740f : RftRAT (cmms2366.dll)\n– cf3440fa165e3f78d2a2252a6924f702 : RftRAT (mtms7794.dll)\n\n18/20\n\n– c55da826e50e2615903607e61968778f : RftRAT\n– d070cf19b66da341f64c01f8195afaed : RftRAT (r2.dat)\n– e665a985f71567f24a293ea430aad67d : RftRAT (r2.dat)\n– c52410ed6787c39db87c4158e73089d4 : RftRAT (r1.dat)\n– 1ac0b0da11e413a21bec08713e1e7c59 : RftRAT (40.dat)\n– 39e755c08156123e4cabac6bf8d1fd3a : RftRAT (a2.dat)\n– 187aa9b12c05cd1ff030044786903e7e : KeyLogger (NsiService.exe)\n– b1337eb53b21594ac5dbd76138054ffb : KeyLogger (NsiService.exe)\n– d820ddb3026a5960b2c6f39780480d28 : KeyLogger (NsiService.exe)\n– 5c2809177bb95edc68f9a08a96420bb7 : Stealer – Web browser (GBIA.exe)\n– 0bf558adde774215bb221465a4edd2fe : Stealer – Web browser (GBIA.exe)\n– aa2cf925bae24c5cad2b1e1ad745b881 : Stealer – Web browser (GPIA.dll)\n– baa058003bf79ba82ac1b744ed8d58cb : Stealer – Chrome extension (GBS.exe)\n– 38182f1f0a1cf598295cfbbabd9c5bf4 : Stealer – File path (GPIA.exe)\n– 272c29bf65680b1ac8ec7f518780ba92 : Stealer – File path (GPIA.exe)\n– e860dac57933f63be9a374fb78bca209 : Proxy (svc.exe)\n– e96ca2aa7c6951802e4b17649cc5b581 : Injector (taskhosts.exe)\n– 4eddf54757ae168450882176243d2bd2 : Injector (sihosts.exe)\n– 119063c82373598d00d17734dd280016 : LogonMon (ipcheck.dll)\nC&C\n– hxxps://prohomepage[.]net/index.php :Amadey – AutoIt Script\n– 45.76.93[.]204:56001 : RftRAT – AutoIt Script\n– 91.202.5[.]80:52030 : RftRAT – AutoIt Script\n– 192.236.154[.]125:50108 : RftRAT – AutoIt Script\n– hxxp://brhosting[.]net/index.php : Amadey\n– hxxps://topspace[.]org/index.php : Amadey\n– hxxps://theservicellc[.]com/index.php : Amadey\n– hxxps://splitbusiness[.]com/index.php : Amadey\n– hxxps://techgolfs[.]com/index.php : Amadey\n– 23.236.181[.]108:52390 : RftRAT\n– 152.89.247[.]57:52390 : RftRAT\n– 172.93.201[.]248:8083 : RftRAT\n– 172.93.201[.]248:52390 : RftRAT\n– 209.127.37[.]40:52390 : RftRAT\nSubscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to\ncheck related IOC and detailed analysis information.\nCategories:Malware Information\nTagged as:Amadey,Kimsuky,RftRAT,xRAT\n\n19/20\n\n20/20",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/xs2z8yf59q58ph1qn5sqr92sj2g6zefo"
    ],
    "report_names": [
        "Ahnlab_Kimsuky-Group-AutoIt-Malware-RftRAT-Amadey(12-08-2023)"
    ],
    "threat_actors": [
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2024-11-22T02:02:53.101712Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2024-11-22T02:00:02.551126Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "G0086",
                "APT43",
                "Emerald Sleet",
                "THALLIUM",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Thallium",
                "Springtail",
                "Black Banshee",
                "Operation Stolen Pencil"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark",
                "RevClient"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2024-11-22T02:00:52.30662Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2024-11-22T02:02:01.064081Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1702346849846,
    "ts_updated_at": 1732241017993,
    "ts_creation_date": 1702261761000,
    "ts_modification_date": 1702261761000,
    "files": {
        "pdf": "https://archive.orkl.eu/a224702fbdf785b482d562117dddf5d4fd848208.pdf",
        "text": "https://archive.orkl.eu/a224702fbdf785b482d562117dddf5d4fd848208.txt",
        "img": "https://archive.orkl.eu/a224702fbdf785b482d562117dddf5d4fd848208.jpg"
    }
}