{
    "id": "5839270a-0b3c-48b9-b5a7-81f6798c682e",
    "created_at": "2023-12-21T02:05:19.327517Z",
    "updated_at": "2024-11-22T02:03:18.241998Z",
    "deleted_at": null,
    "sha1_hash": "c4e23fff156bef106fb15a96734b9fcf44d37061",
    "title": "ITG05 operations leverage Israel-Hamas conflict lures to deliver Headlace malware",
    "authors": "IBM",
    "file_creation_date": "2023-12-19T09:36:02Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 3010042,
    "plain_text": "ITG05 operations leverage Israel-Hamas conflict lures to deliver\nHeadlace malware\n\nAuthors: Golo Mühr, Claire Zaboeva, Joe Fasulo\nSource: IBM Security Intelligence\nhttps://images3.cmp.optimizely.com/Zz0wOGM0ZjRkYzk0NzMxMWVlYThkMWNlYmYxYWViYzM5Mg==\n\nAs of December 2023, IBM X-Force has uncovered multiple lure documents\nthat predominately feature the ongoing Israel-Hamas war to facilitate the\ndelivery of the ITG05 exclusive Headlace backdoor. The newly discovered\ncampaign is directed against targets based in at least 13 nations worldwide\nand leverages authentic documents created by academic, finance and\ndiplomatic centers. ITG05’s infrastructure ensures only targets from a single\nspecific country can receive the malware, indicating the highly targeted\nnature of the campaign.\nX-Force tracks ITG05 as a likely Russian state-sponsored group consisting of\nmultiple activity clusters, sharing overlaps with industry-identified threat\nactor groups APT28, UAC-028, Fancy Bear and Forest Blizzard.\nThe contents of each lure contain themes relevant to a unique audience\ninterested in research and policy creation. The nature of the lures suggests\nactivity is directed at entities with direct influence on the allocation of\nhumanitarian aid, primarily those based in Europe. Our discovery includes\nmultiple legitimate documents associated with finance, think tanks,\neducational organizations and government and nongovernment organizations\n(NGOs) leveraged as lure materials. These files are featured in larger\ninfection chains associated with the delivery of the ITG05 exclusive Headlace\nbackdoor capable of facilitating multiple malicious actions on objectives.\nIt is unclear precisely how many entities were impacted by the campaign, but\nour analysis indicates that organizations in the following countries were\n\ntargeted: Hungary, Türkiye, Australia, Poland, Belgium, Ukraine, Germany,\nAzerbaijan, Saudi Arabia, Kazakhstan, Italy, Latvia and Romania. Of note, all\nbut one of the 13 nations featured in the geolocations perimeters for\ndownloading Headlace are United Nations Human Rights Council members.\nIt is highly likely the compromise of any echelon of global foreign policy\ncenters may aid officials’ interests with advanced insight into critical\ndynamics surrounding the International Community's (IC) approach to\ncompeting priorities for security and humanitarian assistance.\n\nKey Findings\n• This is the first known use of the Israel-Hamas conflict by ITG05 to\nconduct campaigns delivering the exclusive Headlace backdoor.\n• The campaign leverages documents associated with the United Nations,\nthe Bank of Israel, the United States Congressional Research Service,\nthe European Parliament, a Ukrainian think tank and an AzerbaijanBelarus Intergovernmental Commission.\n• X-Force observed the deployment of Headlace and secondary payloads\nto be specifically targeted toward at least 13 nations.\n• Some of the uncovered lures are contained in a .RAR archive exploiting\nthe CVE-2023-38831 vulnerability, others use DLL-hijacking to run\nHeadlace.\n• Headlace is a multi-component malware including a dropper, a VBS\nlauncher and a backdoor using MSEdge in headless mode to\ncontinuously download secondary payloads, likely to exfiltrate\ncredentials and sensitive information.\n\nBackground\nIn early September 2023, CERT-UA reported APT28 was attempting to use\nnew malware named Headlace to access a critical energy infrastructure\nentity in Ukraine. This involved APT28 using the Mockbin and Mocky API\nwebsites to stage malicious archives retrieved by Javascript droppers. In late\nSeptember 2023, Zscaler published a similar campaign targeting the theft of\nNTLM hashes from victims in Poland, Austria and Belgium by using adultthemed lures and the Mockbin API for data extraction.\nIn late 2023, X-Force uncovered eight lure documents created between early\nAugust and early December 2023 likely leveraged in phishing campaigns\ncrafted to ultimately distribute ITG05's Headlace backdoor. X-Force research\nconfirmed the majority of the files are directly derived from publicly available\nofficial documents created by the Bank of Israel, the U.S. Congressional\nResearch Service, the United Nations, the European Parliament, the French\ndigital education service Cahier de Prépa and the Ukraine-based Razumkov\nCentre think tank.\nThe remaining lures appear to be internal documents belonging to, or\nassociated with, what appears to be legal amendments to a Turkish manual\nregarding technical installations, and interstate agreements facilitated by the\nJoint Intergovernmental Commission between the Republic of Azerbaijan and\n\nthe Republic of Belarus on Economic Cooperation. Of note, the majority of\nthe lure documents contents feature news, updates or information regarding\ndevelopments in Ukraine and the Levant.\nThe use of official documents as lure material is a departure from previously\nobserved ITG05 activity featuring the delivery of the Headlace backdoor,\nwhich featured adult-themed material to engender victim engagement. This\nchange in lure content may be indicative of ITG05's increased emphasis on a\nunique target audience whose interests would prompt interaction with\nmaterial impacting emerging policy creation. State-sponsored cyber\ncapabilities will likely continue to be leveraged to furnish domestic decisionmakers with exclusive access to the political resolve and resource priorities of\nthe IC and individual states.\n\nAnalysis: From decoy documents to phishing\nlures\nPreviously, ITG05 operations featuring the Headlace backdoor were\npreceded by numerous decoy documents featuring adult themes. However,\nduring the past month, X-Force observed a change in tactic with the threat\nactor instead also using the decoys as lures to trick users into accessing the\nattachments. The majority of the uncovered lures feature English-language\ntext except for a Turkish language and a single Russian-language document.\nThe text of each of the decoys contains themes that would likely not appear\nas alerting to a unique audience interested in research and policy creation.\nThe following is a selection of uncovered lure documents used in conjunction\nwith Headlace:\nExample lure 1: Letter of invitation to the expert discussion on\nthe Razumkov Centre\nThe earliest uncovered lure document titled \"Letter of invitation to the expert\ndiscussion on the Razumkov Centre,\" dates from early September 2023 and\nwas first reported by Google TAG. It leverages a publicly available\ndocument uploaded one day preceding the presentation of the legitimate\nevent hosted by the Razumkov Centre in partnership with the United States\nAgency for International Development (USAID) under the auspices of the\nUSAID/ENGAGE pact. The invitation presents the findings of the paper \"War\nof Attrition: Comparison of Potentials and Assessment of Prospects\" on\ncurrent results of the conflict in Ukraine, combat potentials and policy\napproaches for avoiding stalemate. The campaign is directed at Romaniabased targets based on the geolocation of the targeted download.\nhttps://images2.cmp.optimizely.com/Zz03NDljZTNmNDk0NmUxMWVlYmMxNDRhZDJiYTFiODhmNQ==\n\nFig. 1: Lure document \"Letter of invitation to the expert discussion on the\nRazumkov Centre\"\n\nNotably, this lure was contained in a .RAR archive exploiting\nCVE-2023-38831. If opened with WinRAR versions below 6.23, the exploit\ncauses Headlace to silently execute if a user tries to open the benign PDF file.\nExample lure 2: SEDE-PV-2023-10-09-1_EN.docx\nUploaded in mid-October 2023, the lure document titled \"SEDEPV-2023-10-09-1_EN.docx\" features the publicly available Minutes of the 9\nOctober 2023 meeting of the Subcommittee on Security and Defence of the\nEuropean Parliament. Included in the adopted agenda is the question of \"The\nsecurity situation after the attack by Hamas against Israel, exchange of views\nwith the EU’s Police Mission for the Palestinian Territories (EUPOLCOPPS)\nand the EU’s Border Assistance Mission in Rafah (EUBAM Rafah).\"\nhttps://images1.cmp.optimizely.com/Zz1hYWYwMDEzNDk0NmUxMWVlYjE0YzIyYTAzYTkxM2JjOA==\n\nFig. 2: Lure document \"SEDE-PV-2023-10-09-1_EN.docx\"\nExample lure 3: war.docx\n\nUploaded in early November 2023, the document titled \"war.docx\" features\nan authentic copy of the publicly available Advance Unedited Version of the\n\"Report of the Special Committee to Investigate Israeli Practices Affecting the\nHuman Rights of the Palestinian People and Other Arabs of the Occupied\nTerritories\" presented at the seventy-eighth session of the General Assembly\nof the United Nations. The contents feature policy questions and historical\ncontext related to the Levant between September 2022 to September 2023,\npreceding the surprise October 2023 attacks.\nhttps://images4.cmp.optimizely.com/Zz1jOWQ5OTBlYzk0NmUxMWVlYmNiZjFhNmIxMWQ4M2NkMw==\n\nFig. 3: Lure document \"war.docx\"\n\nExample lure 4: Roadmap.docx\nIn mid-November 2023, a 15-page document titled \"roadmap\" was uploaded\nby multiple Azerbaijan-based users featuring what appears to be the internal\nmark-up version of a proposed \"Roadmap on the development of cooperation\nbetween the Republic of Belarus and the Republic of Azerbaijan until 2025\"\nassociated with the Joint Intergovernmental Commission between the\nRepublic of Azerbaijan and the Republic of Belarus on Economic\nCooperation. The document features two lines for signatures of approval by\nthe respective state ministers, followed by a fillable date pre-populated with\nthe year 2023. The document appears to be authentic given the metadata\nassociated with user modifications.\nhttps://images1.cmp.optimizely.com/Zz1lNTc0NzQ3MDk0NmUxMWVlYjk1NjVlYmU0ZTY4YTQzYw==\n\nFig. 4: Lure document \"Roadmap.docx\"\nExample lure 5: 2023-12-bois-position-on-accessing-capital-pr.docx\nhttps://images4.cmp.optimizely.com/\nZz0yOWQ0ZTQzODk0NmYxMWVlOTZiOWZhMGIzZGI2NWMyMw==\n\nFig. 5: Lure document \"2023-12-bois-position-on-accessing-capital-pr.docx\"\nIn early December 2023, X-Force uncovered an ITG05 lure leveraging the\nauthentic 5 December 2023 press release published by the Bank of Israel.\nThe document titled 2023-12-bois-position-on-accessing-capital-pr.docx\ndetails the “Main Points of the Bank of Israel’s Position Presented to the\n\nKnesset Economics Committee Regarding Nonbank Entities Accessing\nSources of Capital to Expand their Provision of Loans Due to the War.”\nExample lure 6: IN11897.pdf\nhttps://images4.cmp.optimizely.com/\nZz00YjNlNGJmMDk0NmYxMWVlYTEzYTdlOGMzM2EyMjBmNw==\n\nFig. 6: Lure document \"IN11897.pdf\"\nIn early December 2023, X-Force uncovered the ITG05 lure titled\nIN11897.pdf, which leverages the 20 November 2023 CRS update on\n“Russia’s War Against Ukraine: European Union Responses and U.S.-EU\nRelations.” The publicly available document features key updates informing\npolicymakers regarding the War in Ukraine distributed by the public policy\nresearch institute of the United States Congress.\n\nInfection chain\nThe following represents X-Force's detailed analysis of the multiple infection\nchains associated with the lures above, ultimately delivering Headlace\nmalware.\nhttps://images4.cmp.optimizely.com/Zz1kZTQ3NGQ1ZTk1NTgxMWVlOWJiNjhhYjFkYjM5OWVkZg==\n\nFig. 7: Headlace full infection graph\nThe diagram above is a high-level depiction of the Headlace infection flow. A\ndeep dive into the different components impacting delivery including the\nabuse of commercial hosting services, multi-stage malware, exploitation, and\ncommand and control are explored in the following sections.\n\nAbusing commercial hosting services\nIn September 2023, CERT-UA reported spear phishing emails containing\nURLs that led recipients to malicious archives hosted on abused, publicly\navailable, commercial infrastructure; like the Mocky and Mockbin APIs and\nthe Infinityfreeapp service.\nIn early campaigns, the threat actors used the Mockbin service to deliver\nmalicious ZIP files containing decoy images, as well as a .CMD file which was\nidentified as Headlace malware.\nExample URLs:\nhttps://run.mocky[.]io/v3/027fab50-2478-4dd2-962f-bb525b36810d\nhttps://mockbin[.]org/bin/229f6d51-f534-466f-b642-e86811631083/<result_of_whoami>\n\nLater, in late October through November 2023, X-Force observed a second\nlegitimate service \"infinityfreeapp.com\" used to host malicious payloads.\nIn the same timeframe, CERT-FR reported malicious activity by APT28 that\nincluded the use of Mocky, Mockbin and infinityfreeapp services in attacks\ntargeting French government systems.\nThe threat actor created several subdomains over the course of the\ncampaigns. The phishing URL would contain a unique hardcoded URL\nparameter \"id\". This ID is necessary to be able to download the lure archive\nas well as Headlace's secondary payloads and likely allows ITG05 to track\ninfections through all stages. Once a victim visits the URL and passes the\nbrowser check, the site redirects to its filedwn.php script using the same \"id\"\nparameter. This causes the download of a ZIP file, again containing the\nHeadlace payload. Instead of the Mocky service, the Headlace backdoor uses\nthe hardcoded id parameter to download the next payload via a URL calling\nthe hosted execdwn.php file.\nExample URLs:\nhttps://downloadingdoc[.]infinityfreeapp[.]com/?id=61726832e715-4f79-99e8-1587300c1035\nhttps://downloadingdoc[.]infinityfreeapp[.]com/filedwn.php?id=61726832e715-4f79-99e8-1587300c103\nhttps://downloadingdoc[.]infinityfreeapp[.]com/execdwn.php?id=61726832e715-4f79-99e8-1587300c1035\n\nBrowser checker\nBefore payloads are downloaded from the legitimate staging services, a\nJavascript-based browser enumeration script verifies the user agent and in\nsome cases the geolocation of the victim. Different versions of the script are\nused up to three times within a single infection. Infections start with the\nphishing URL, which redirects to the first download site after a first check.\nThere, the second check takes place, which involves a user agent and\ngeolocation check via the \"https://ipapi[.]co/json\" service (see screenshot\nbelow). After a successful lure download, the victim is redirected\nto www.msn.com.\nhttps://images2.cmp.optimizely.com/Zz0wYTA3YWNlODk0NzAxMWVlYWZmNjA2NTM0ZTVjZmVkZA==\n\nFig. 8: Browser enumeration script verifying a geolocation in Germany,\nbefore dropping an archive payload\nAs visible in the screenshot above, the browser script drops one of two\ndifferent payloads, depending on the result of the location check. Should the\nrequest originate from a different country other than the one targeted, ITG05\nwill drop a non-weaponized version of the archive. This version would only\ncontain the benign lure. In the case of the campaign above, it contains a\n.CMD file only faking a Windows update, but without installing the malicious\nHeadlace backdoor.\nThis campaign was active from late September until the end of November,\ntargeting Kazakhstan, Hungary, Germany, Saudi Arabia, Ukraine and\nAzerbaijan. Later campaigns using policy-themed lures employed the same\ntechnique of dropping only benign lures should any of the checks fail.\nAfter the successful execution of the Headlace dropper, the backdoor uses a\nsecond download site to stage secondary payloads. These are downloaded in\nMS Edge headless mode, so the corresponding browser scripts check if the\nuser agent contains the string \"edge\". Often the second download site\nperforms another geolocation check:\n\nhttps://images1.cmp.optimizely.com/Zz0yYzFmODJiMDk0NzAxMWVlOGMzNTAyMzEzYWMzMDJlNA==\n\nFig. 9: Browser enumeration script verifying geolocation in Turkey before\ndropping a payload disguised as a .CSS file\nX-Force observed large numbers of browser enumeration scripts specifically\ntargeting the following countries:\n• Hungary\n• Türkiye\n• Australia\n• Poland\n• Belgium\n• Ukraine\n• Germany\n• Azerbaijan\n• Saudi Arabia\n• Kazakhstan\n• Italy\n• Latvia\n• Romania\nLater variants of the enumeration and verification scripts are likely\nimplemented server-side with a specific hardcoded ID, which is provided in\nthe first phishing URL and is required during all later stages as a URL\nparameter.\n\nHeadlace\nX-Force observed three possible execution chains implemented by ITG05 for\nexecuting the Headlace malware:\nExecution via WinRAR vulnerability\nIn this chain, a victim is targeted via the CVE-2023-38831 WinRAR\nvulnerability. If the victim has a vulnerable WinRAR application and opens the\narchive, the lure document is presented while the Headlace dropper is\nexecuted in the background.\n\nExecution via DLL hijacking\nThe DLL-hijacking chain involves delivering a legitimate Microsoft Calc.exe\nbinary that is susceptible to DLL-hijacking. This involves the victim clicking\non Calc.exe to load a malicious DLL that is packaged alongside Calc in the\nmalicious archive. The DLL then executes the Headlace CMD dropper file. In\norder to trick victims into running the executable, Calc.exe is renamed and\ncontains whitespace padding before its extension, which may prevent users\nfrom spotting the suspicious .EXE extension.\nDirect Execution\nIn this chain, the threat actor directs the victim to execute the Headlace CMD\ndropper directly by disguising it as a Windows update script and reporting\nfake update status messages in the console.\nHeadlace is a new backdoor discovered by CERT-UA in September 2023. It\nconsists of three components: a .CMD dropper, a .VBS launcher and a .BAT\nbackdoor. The initial dropper starts by writing both other components into\nthe %PROGRAMDATA% directory. It then runs the .VBS launcher and after a\nshort timeout it displays the lure as a decoy and deletes its traces from the\ndirectory it was started in.\nhttps://images1.cmp.optimizely.com/Zz1jMjFmODFjNjk1NWExMWVlODljODEyODVmNzcyMzRjNA==\n\nFig. 10: Headlace dropper script\nThe .VBS launcher uses the Wscript.Shell object to execute the .BAT file,\nwhich acts as a backdoor. In regular intervals, it runs msedge in headless\nmode to download another payload from a hardcoded URL, execute it and\nsubsequently delete it:\nhttps://images4.cmp.optimizely.com/Zz1jN2Q0NzAxODk1NWExMWVlOWIxNjFhMDBjN2Q1YzllYg==\n\nFig. 11: Headlace backdoor script\nDuring the last campaign, X-Force observed a new infection chain leading to\nHeadlace. The malicious ZIP file would contain several hidden files and only\none visible executable, with a long whitespace-padded filename, in order to\nhide the extension. The binary is a copy of the legitimate calc.exe, which is\nvulnerable to DLL hijacking. Once executed, it searches the current directory\nfor WindowsCodecs.dll, one of the hidden files, and loads it. The DLL's main\nfunction was overwritten to execute the hidden .CMD file that is the Headlace\npayload. By using indirect execution, the malicious activity is more difficult to\ndetect.\nAnother variant of Headlace would disguise itself as a Windows update.\nWhen launching the script, right after dropping and launching its malicious\ncomponents, Headlace would print out fake status messages at regular\nintervals, imitating an update mechanism to an untrained user.\nhttps://images4.cmp.optimizely.com/Zz1lNzFiMzI3Njk0NzAxMWVlOGUwOWMyOTcxYTUyNmNkYg==\n\nFig. 12: Headlace dropper faking a Windows update\n\nActions on objective\nAccording to observations of CERT-UA, once a foothold has been established\non the system, several follow-up payloads are used to capture NTLM\ncredentials or SMB hashes of user accounts and attempt to exfiltrate them\nvia the TOR network. X-Force has observed variants of Nishang's \"StartCaptureServer.ps1\" script, which were modified to exfiltrate credentials\nthrough Mockbin. This activity was also reported on by Zscaler in the \"StealIt\" campaign. In addition, ITG05 is also known to leverage custom exfiltration\ntools such as Graphite and Credomap.\n\nConclusion\nX-Force assesses with high confidence that ITG05 will continue to leverage\nattacks against diplomatic and academic centers to provide the adversary\nwith advanced insight into emergent policy decisions. Given recent\noperations, ITG05 remains adaptable to changes in opportunity within the\ncyber threat landscape by exploiting public CVEs and leveraging\ncommercially available infrastructure.\n\nRecommendations\nX-Force recommends all individuals and entities engaged in or informing\npolicy creation to remain in a heightened state of defensive security and to:\n• Stay abreast of newly published exploits likely to be used by APT actors.\n• Hunt for regularly spawned processes containing “msedge --headlessnew --disable-gpu”.\n• Hunt for headless MS Edge processes downloading .CSS files.\n• Monitor for downloaded archives containing .CMD files.\n• Monitor for DLL hijacking via modified WindowsCodecs.dll files.\n• Monitor for filenames containing an unusually large number of\nconsecutive whitespaces.\n• Monitor network traffic for unusual or unsanctioned commercial service\nuse.\n• Monitor for suspicious use of browsers in headless mode.\n• Install and configure endpoint security software.\n• Update relevant network security monitoring rules.\n• Educate staff on the potential threats to the organization.\n\nIndicators of Compromise\nMD5, SHA1, SHA256, File Path, File Name, Command, Registry Key, Registry\nValue, Scheduled Task, Service Name\n\nIndicator\n\nIndicator\nContext\nType\n\nhttps://mockbin[.]org/bin/902ca47f-644d-4d44-88ec-060fdb7acaa4\n\nURL\n\nJS Dropper URL\n\nhttps://mockbin[.]org/bin/229f6d51-f534-466f-b642-e86811631083\n\nURL\n\nJS Dropper URL\n\nhttps://downloadingdoc.infinityfreeapp[.]com/filedwn.php\n\nURL\n\nJS Dropper URL\n\nhttps://document-c.infinityfreeapp[.]com/execdwn.php?\nid=aec02d48-92f3-45a5-a003-051369b51928\n\nURL\n\nJS Dropper URL\n\nhttps://downloaddoc.infinityfreeapp[.]com/execdwn.php?\nid=488354ce-01ce-4d45-b47a-88701d40c52a\n\nURL\n\nJS Dropper URL\n\nhttps://mockbin[.]org/bin/7cc44695-0c31-4620-bed4-2e60adf0a4b6\n\nURL\n\nJS Dropper URL\n\nhttps://mockbin[.]org/bin/92354a6a-ba1f-4a1a-abea-fba269cabd66\n\nURL\n\nJS Dropper URL\n\nhttps://downloaddoc.infinityfreeapp[.]com/execdwn.php?id=6a98168ff14f-4014-8b28-8329b0118936\n\nURL\n\nJS Dropper URL\n\n68bfa69cdbf947eac31e736b2e54244e829e302ea8dafd65edc6e0f879257a53\n\nsha256\n\narchive\n\n0db8cd7f349afe5a85cd3fd798e2cf4dcb7d2cbbdea3c312f2c7108c4347ada4\n\nsha256\n\nmalicious batch\nscript\n\na706778508af9e507d6d4b509276e9b82ce94f8a2ec913cc2deadba5aaa7d538 sha256\n\nmalicious batch\nscript\n\ned982645d677c04cb5846251924a12e0e2c9ed16d8fa800a628189faf5009c9f\n\nsha256\n\nmalicious batch\nscript\n\n896ca8488c9d8792bd0197646d857e0c2ae0312bbc6d812c12da45016f019264 sha256\n\nmalicious batch\nscript\n\n595590fdfa9618b7f7aab5b8795f9336d71c8918f60aa88dce5d4b07c7071a5a\n\nsha256\n\nmalicious batch\nscript\n\n726af8cd2d92691045ebe659d77acf4ae19b7172e383556befb79719fb78d7ce\n\nsha256\n\nmalicious batch\nscript\n\nab5aef93ffe694970374af638b407dbd56ea5a548235973f51cba67cd7baa07e\n\nsha256\n\nmalicious batch\nscript\n\n19e95b32b77d8dfd294c085793cd542d82eddac8e772818fea2826fa02a5cc54\n\nsha256\n\nmalicious batch\nscript\n\nf5b7a2d9872312e000acbe3dc8153707acecc5ba184f97ad6014327db16549c7\n\nsha256\n\nmalicious batch\nscript\n\nd281a1fa09e7810a4a9e13750d227f557e54370689fd86216332534bc9214918 sha256\n\nmalicious batch\nscript\n\na760b01841a120eccc22856af1c9a8e513871366ef329502f42f9648708720ca\n\nsha256\n\nmalicious batch\nscript\n\n103adb71848a31021692f5ba2ef1691eb29f3ded81b86954753f2f2fbeda08a7\n\nsha256\n\nmalicious batch\nscript\n\n47074a6d033966d07e4587705401533ad6c5fa2b11303c520a37999337d1a1eb sha256\n\nmalicious DLL\n\nIndicator\n\nIndicator\nContext\nType\n\n79fe0b155cf5d2b45d28946ad6ba47f7282b468af064c29346dcd1dcd0aec507\n\nsha256\n\nmalicious DLL\n\n9a798e0b14004e01c5f336aeb471816c11a62af851b1a0f36284078b8cf09847\n\nsha256\n\nmalicious DLL\n\n290b63be4b81ee8a569cb3298eac089b775acc07c82a2d9ea800de8314c6f342 sha256\n\nmalicious\njavascript dropper\n\ned56740c66609d2bbd39dc60cf29ee47743344a9a6861bee7c08ccfb27376506\n\nsha256\n\nmalicious lnk\n\na37140d97600573ace4fc31a9d289adcedb5c9cbfb92059b7184e46b635aaf57\n\nsha256\n\nmalicious visual\nbasic script\n\n9f5846193f545341b0c897947e07bc068712e396fe7c0863d43420bbd633aab1\n\nsha256\n\nnews_week_6.doc\n\nf983d786f4dc2d1793f6b28907c4035c96b6b5c8765ba12dc4510dab0fceabf5\n\nsha256\n\nnews_week_6.zip\n\n84638698fdcf2e9e45e7dd560c8d00fb4da6fa32dabaacd31b3538d38755dad4\n\nsha256\n\nnews_week_6.zip\n\n5b8c240083cba4442fb6bbb092efd430ce998530cc10fd181b3f71845ec190ce\n\nsha256\n\nnews_week_6.zip\n\n16bcd167162e4ded71b8c7e9a2587be821d3a752c71fcbb2ae64cf1088b62fc0\n\nsha256\n\nnews_week_6.zip\n\n1f4792dadaf346969c5e4870a01629594b6c371de21f8635c95aa6aba24ef24c\n\nsha256\n\nwar.docx\n\n8cc664ff412fc80485d0af61fb0617f818d37776e5a06b799f74fe0179b31768\n\nsha256\n\nwar.zip\n\n2ac6735e8e0b23b222161690adf172aec668894d170299e9ff2c54a4ec25b1f4\n\nsha256\n\nwar.zip\n\nd37779e16a92da7bd05eae50c64b36e2e2022eb441382be686fda4dbd1800e90 sha256\n\nwar.zip\n\n45e44afeb8b890004fd1cb535978d0754ceaa7129082cb72386a80a5532700d1 sha256\n\nZeyilname.zip\n\n22ed5c5cd9c6a351398f1e56efdfb16d52cd33cb4b206237487a03443d3de893\n\nsha256\n\nZeyilname.zip\n\n243bab79863327915c315c188c0589202f64b3500a3fee3e2c9f3d34e8e1f154\n\nsha256\n\nZeyliname.docx\n\n5a58e99a0ecdc461ce11c8253df9ea410076d56abc254628ed5ff4e5622acfde\n\nsha256\n\nRazumkov Centre\npdf\n\ne699a7971a38fe723c690f37ba81187eb8ed78e51846aa86aa89524c325358b4 sha256\n\nEU Parliament doc\n\n1cfa9dbc91e3d136cbd42670f5a587963dab5898e7bd68684966d6e07bcb23e2 sha256\n\nRoadmap.docx\n\n3cc52ef447578f4ab549f692013d7f2e849aba8cad83a8d63bf1569d874f38fa\n\nsha256\n\n2023-12-boisposition-onaccessing-capitalpr.docx\n\na50e32f52c249129655a9cb7be28b4efc32244c70f5ed1b4c4925b1b8f41199e\n\nsha256\n\nIN11897.pdf\n\nTo learn how IBM X-Force can help you with anything regarding\ncybersecurity including incident response, threat intelligence or offensive\nsecurity services schedule a meeting here.\nIf you are experiencing cybersecurity issues or an incident, contact X-Force\nto help: US hotline 1-888-241-9812 | Global hotline (+001) 312-212-8034.",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/v7cb9iaex4o4igqpq9xbxz9sne72klr3"
    ],
    "report_names": [
        "ITG05_operations_leverage_Israel-Hamas_conflict_lures_to_deliver_Headlace_malware(12-08-2023)"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2024-11-22T02:02:53.09478Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2024-11-22T02:00:02.469031Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "Pawn Storm",
                "Sednit",
                "IRON TWILIGHT",
                "TA422",
                "T-APT-12",
                "Fighting Ursa",
                "ITG05",
                "UAC-0028",
                "FANCY BEAR",
                "SNAKEMACKEREL",
                "Tsar Team",
                "Group 74",
                "G0007",
                "BlueDelta",
                "Fancy Bear",
                "Sofacy",
                "TG-4127",
                "STRONTIUM",
                "Grizzly Steppe",
                "ATK5",
                "FROZENLAKE",
                "SIG40",
                "Blue Athena",
                "APT-C-20",
                "Forest Blizzard"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2024-11-22T02:00:52.392704Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2024-11-22T02:02:01.181291Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1703124319327,
    "ts_updated_at": 1732240998241,
    "ts_creation_date": 1702978562000,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/c4e23fff156bef106fb15a96734b9fcf44d37061.pdf",
        "text": "https://archive.orkl.eu/c4e23fff156bef106fb15a96734b9fcf44d37061.txt",
        "img": "https://archive.orkl.eu/c4e23fff156bef106fb15a96734b9fcf44d37061.jpg"
    }
}