{
    "id": "4b983b93-d572-4c13-b7bc-424ac21086ea",
    "created_at": "2023-12-19T02:04:44.905434Z",
    "updated_at": "2024-11-22T02:03:08.23078Z",
    "deleted_at": null,
    "sha1_hash": "d88076abd0fbde4927a2948ca8065659e9ba6752",
    "title": "A cascade of compromise: unveiling Lazarus' new campaign",
    "authors": "Kaspersky",
    "file_creation_date": "2023-12-12T18:00:58Z",
    "file_modification_date": "2023-12-12T18:00:58Z",
    "file_size": 705041,
    "plain_text": "A cascade of compromise: unveiling Lazarus’ new\ncampaign\nsecurelist.com/unveiling-lazarus-new-campaign/110888\n\nAuthors\nSeongsu Park\nEarlier this year, a software vendor was compromised by the Lazarus malware delivered\nthrough unpatched legitimate software. What’s remarkable is that these software\nvulnerabilities were not new, and despite warnings and patches from the vendor, many of the\nvendor’s systems continued to use the flawed software, allowing the threat actor to exploit\nthem. Fortunately, a proactive response by us detected an attack on another vendor and\neffectively thwarted the attacker’s efforts.\nUpon further investigation, we discovered that the software vendor that developed the\nexploited software had previously fallen victim to Lazarus several times. This recurring\nbreach suggested a persistent and determined threat actor with the likely objective of\nstealing valuable source code or tampering with the software supply chain, and they\ncontinued to exploit vulnerabilities in the company’s software while targeting other software\nmakers.\n\nInfection timeline\n\nThe adversary demonstrated a high level of sophistication, employing advanced evasion\ntechniques and introducing SIGNBT malware for victim control. In addition, other malware\nfound in memory included Lazarus’ prominent LPEClient, a tool known for victim profiling and\npayload delivery that has previously been observed in attacks on defense contractors and\nthe cryptocurrency industry.\n\n1/11\n\nExecutive summary:\nA software vendor was compromised through the exploitation of another high-profile\nsoftware.\nThe SIGNBT malware used in this attack employed a diverse infection chain and\nsophisticated techniques.\nLPEClient used in this attack was observed executing a range of targeted attacks\nassociated with the Lazarus group.\nFor more information, please contact: intelreports@kaspersky.com\n\nSIGNBT loader\nIn mid-July 2023, we detected a series of attacks on several victims who had been targeted\nthrough legitimate security software designed to encrypt web communications using digital\ncertificates. The exact method by which this software was exploited to deliver the malware\nremains elusive. However, we identified post-exploitation activity within the processes of the\nlegitimate software. In one instance, while examining the memory of the compromised\nsecurity software from a victim’s system, we discovered the presence of the SIGNBT\nmalware accompanied by a shellcode. This shellcode was responsible for launching a\nWindows executable file directly in memory.\nThe actor uses various tactics to establish and maintain persistence on compromised\nsystems. These include the creation of a file called ualapi.dll in the system folder, which is\nautomatically loaded by the spoolsv.exe process at each system boot. Additionally, in several\ninstances, registry entries were recorded to execute legitimate files for the purpose of\nmalicious side-loading, further ensuring a resilient persistence mechanism.\n\nMethods for loading the final payload\n\n2/11\n\nLeveraging the spoolsv.exe process for hijacking purposes is a long-standing strategy for\nLazarus. Automatically loading the ualapi.dll file after each reboot is not a new technique for\nthis actor. We have seen similar tactics used by the Gopuram malware in the past.\nThe malicious ualapi.dll file was developed using a public source code known as Shareaza\nTorrent Wizard. It follows a typical Lazarus group approach of utilizing public source code as\na foundation and injecting specific malicious functions into it. This loader malware has a\nroutine to verify the victim. It retrieves the victim’s MachineGuid by reading it from the\nWindows registry and then compares it with an embedded MachineGuid value. To access\nthis embedded MachineGuid value, the malware locates the sequence “43 EB 8C BD 1D 98\n3D 14” and reads the DWORD immediately following it. Only if the victim’s MachineGuid\nmatches the expected one does the malware proceed to the next step. The malware then\nreads the payload from a hard-coded file path and continues its malicious activities.\nPayload path: C:\\Windows\\system32\\config\\systemprofile\\appdata\\Local\\tw-100a-a00e14d9.tmp\nThe loader process retrieves the first 32 bytes from tw-100a-a00-e14d9.tmp and uses this\ndata as an AES decryption key to decrypt the remaining contents. Once decrypted, the\npayload, a Windows executable identified as SIGNBT, is loaded directly into memory. In this\ncase, the loaded payload also reads the configuration file from the same path, but with a\nslightly different file name.\nConfig file: C:\\Windows\\system32\\config\\systemprofile\\appdata\\Local\\tw-100b-a00e14d9.tmp\nInside this file is a base64-encoded string, mirroring the approach used in the previous\nSIGNBT malware method. The first 32 characters of this string serve as the AES decryption\nkey, while the subsequent data contains configuration information used by the malware. This\ndecrypted configuration data includes details such as three C2 addresses, which are referred\nto as proxies, sleep intervals, version information, monitored targets, and various other\nparameters critical to the malware’s operation.\n\nSIGNBT\nThe majority of SIGNBT malware instances are launched through the malware loader, which\noperates exclusively in memory. Upon execution, the malware begins communicating with\nthe C2 server by sending a beacon after initialization of its configuration data. In its C2\ncommunication, the malware uses distinctive strings that start with SIGNBT. This unique\ncharacteristic has earned it the designation of SIGNBT. In addition, the malware uses\ndifferent prefixes at each stage of its C2 operation to verify and maintain its activities.\nPrefix name\n\nDescription\n\n3/11\n\nSIGNBTLG\n\nInitial connection.\n\nSIGNBTKE\n\nSuccess – update the key and ask for a profiling process.\n\nSIGNBTGC\n\nAsk for commands.\n\nSIGNBTFI\n\nOperation failed.\n\nSIGNBTSR\n\nOperation success.\n\nThe malware employs a multi-step process to create a 24-byte value for various purposes.\nFirst, it generates this value with the following components:\n1. 8 bytes of hard-coded value (SIGNBTLG): this is a fixed part of the value and serves\nto validate the legitimacy of the client’s connection.\n2. 8 bytes from the MD5 hash of the hostname: the first 8 bytes of the MD5 hash of the\nvictim’s computer name are included, helping to distinguishing each victim.\n3. 8 bytes of randomly generated identifier: another 8 bytes are randomly generated,\nprobably used for session identifiers.\nAfter creating this 24-byte value, the malware generates an additional 24 bytes of random\ndata. These two sets of 24 bytes are then XORed together using another randomly\ngenerated 24-byte key. Subsequently, both the resulting value and the 24-byte key are\nencoded with base64. Finally, these encoded values are combined with either three or seven\nrandomly generated HTTP parameter names. In all future C2 communications, the malware\nuses a similar structure, making it more challenging to detect and analyze its\ncommunications.\n\n4/11\n\nStructure of HTTP POST data\n\nThe malware uses a mechanism to validate the response data received from the C2 server.\nSpecifically, it checks to see if the response data contains a hard-coded HTML script.\n1\n\n<!DOCTYPE html><html><head></head><body marginwidth=\"0\" marginheight=\"0\"\n\n2\n\nstyle=\"background-color:transparent\"><script>\n\n3\n\n[delivered data]\n\n4\n\n</script></body></html>\n\nDuring the validation process, the malware decodes the first 12 bytes from the C2 server\nusing base64, replacing the spaces with plus signs to create a seven-character string. This\nprocess is then repeated with the next 12 bytes. The first seven characters from each set are\nthen XORed and compared to the “success” string. This repetitive procedure is applied to\nevery HTTP communication sequence to verify that the response aligns with the expected\n“success” criterion.\nNext, the malware sends HTTP requests with the SIGNBTKE header, and if it receives a\n“success” message from the C2 server, it activates the getInfo function within the CCBrush\nclass. This function gathers various information about the victim’s computer, such as\ncomputer name, product name, OS details, system uptime, CPU information, system locale,\ntime zone, network status, and malware configuration data. After sending this systemspecific information, the malware sends another HTTP request with the SIGNBTGC prefix,\nthis time using a randomly chosen embedded HTTP parameter from a list of 100 possible\nparameter names.\n1\n\nclient, output, h, slotname, adk, adf, pi, w, format, url, ea, flash, tt_state, dt, bpp,\n\n2\n\nbdt, idt, shv, ptt, saldr, frm, ife, pv, ga_vid, ga_sid, ga_hid, ga_fc, nhd, u_tz, u_his,\n\n3\n\nu_java, u_h, u_w, u_ah, u_aw, u_cd, u_nplug, u_nmime, adx, ady, biw, bih, isw, ish,\nifk,\n\n4\n5\n6\n7\n\nscr_x, scr_y, eid, oid, pvsid, pem, loc, eae, brdim, vis, rsz, abl, pfx, fu, bc, ifi, uci,\nfsb, dtd, atyp, ei, s, t, bl, imn, ima, imad, aftp, adh, conn, ime, imex, imeh, imea,\nimeb, wh, scp, net, mem, sto, sys, rt, zx, su, tb, calp, rui, u, XU, TREX, UID, SID, dr,\nXDR, dt\n\n5/11\n\nThe data received from the C2 server is decrypted using AES with a decryption key obtained\nfrom a SIGNBTLG HTTP request. If the decrypted data is “keep”, the malware responds with\nan “OK” message using the SIGNBTSR prefix, indicating a successful communication. If\nthere are problems, the malware uses the SIGNBTFI prefix to convey the nature of the\nproblem or failure in communication. To summarize, the C2 communication process can be\ndescribed as follows:\n\nC2 communication process\n\nIf the delivered data does not equal “keep”, indicating that specific instructions or actions are\nrequired, the malware proceeds to invoke the corresponding class and function for backdoor\nbehavior. The SIGNBT malware is equipped with an extensive set of functionalities designed\nto exert control over the victim’s system. To perform these functions, the malware receives\ninstructions from the C2 server in the form of a class name, function name, and any\nnecessary parameters. It then executes the relevant function embedded in the malware’s\ncodebase.\nClass name\n\nFunction name\n\nCCBrush\n\ngetInfo, testConnect, setSleep, setHibernate, sendConfig, setConfig\n\n6/11\n\nCCList\n\ngetProcessList, processKill, runFile, runAsUser, injectDll, freeDll\n\nCCComboBox\n\ngetDriveList, getFileDir, changeFileTime, secDelete, folderProperty,\nchangeFileName, makeNewFolder\n\nCCButton\n\nstartDownload, upFile, selfMemload, scrCapture\n\nCCBitmap\n\nping, netshAdvfirewall, netstat, reg, sc, whoami, arp, nslookup,\nsysteminfo, ipconfig, net, ver, wmic, deploy, copy\n\nThe name of each backdoor command is straightforward, implementing commonly used\nWindows commands such as ping, netstat, and systeminfo. It’s important to note that the\nbackdoor is capable of implanting an additional payload for auto execution, internally named\n“deploy”. This backdoor function receives file paths via command-line arguments decrypted\nwith AES. Using this command, SIGNBT has been observed to implant the phantom DLL we\nalready described in the SIGNBT loader section above.\nBased on the analysis, it is evident that the actor’s initial compromise of the victim involved\nexploiting vulnerabilities within the software exploit. They then proceeded to deploy the\nSIGNBT malware using a DLL side-loading technique. Furthermore, the actor used the\nbackdoor capability “deploy” to implant an additional payload for automated execution. This\nmultifaceted attack demonstrates a high level of sophistication and a deliberate effort to\ninfiltrate and maintain control over the victim’s system.\n\nLPEClient\nUsing the comprehensive backdoor as described above, the actor deploys additional\nmalware in the victim’s memory. Notably, these newly delivered malware variants\npredominantly execute in the system’s memory only, without touching the disk. Based on our\ntelemetry, the actor has been observed to deliver such tools as LPEClient and credential\ndumping utilities to the victim machines.\n\nAdditional payload delivered by SIGNBT\n\nThe LPEClient malware is not new and was first discovered during an investigation of a\ndefense contractor attack in 2020. It is designed to collect victim information and download\nadditional payloads from a remote server to run in memory. Although it has been previously\n\n7/11\n\nnoted in our threat intelligence reports to our customers, recent discoveries indicate that\nLPEClient has undergone significant evolution. It now employs advanced techniques to\nimprove its stealth and avoid detection, such as disabling user-mode syscall hooking and\nrestoring system library memory sections. This indicates a continued effort by the threat\nactors to increase the sophistication and effectiveness of their malware.\n\nConnections with other campaigns\nOne of the malware strains employed in this attack, known as LPEClient, has featured\nprominently in recent activity attributed to the Lazarus group. This particular malware\nconsistently serves as the initial infection vector, enabling victim profiling and facilitating the\ndelivery of additional payloads. Over an extended period of time, one of these campaigns\nspecifically targeted defense contractors and nuclear engineers. In a recent incident, the\nthreat actor compromised a victim by delivering LPEClient via a Trojanized VNC or Putty\nclient for an intermediate infection. Another campaign targeting the cryptocurrency industry\nwas discovered in July 2023. In this financially motivated campaign, the actor leveraged the\nGopuram malware, associated with the 3CX supply chain attack. Interestingly, the actor also\nused LPEClient malware in this case. Prior to the introduction of the Gopuram cluster,\nLPEClient was used to deliver the subsequent malware. These three campaigns attributed to\nLazarus in 2023 illustrate different initial infection vectors and infection chains, but they\nconsistently relied on LPEClient malware to deliver the final payload.\n\nThe infection chains of the three campaigns attributed to Lazarus in 2023\n\nConclusions\n\n8/11\n\nThe Lazarus group remains a highly active and versatile threat actor in today’s cybersecurity\nlandscape. The threat actor has demonstrated a profound understanding of IT environments,\nrefining their tactics to include exploiting vulnerabilities in high-profile software. This\napproach allows them to efficiently spread their malware once initial infections are achieved.\nMoreover, the activities of this notorious actor transcend geographic boundaries and industry\nsectors. They have targeted various industries, each with distinct objectives and using\ndifferent tools, tactics and techniques. This underscores their recent and ongoing activity\ncharacterized by sophisticated methods and unwavering motivations.\n\nIndicators of Compromise\nSIGNBT loader\n9cd90dff2d9d56654dbecdcd409e1ef3\n88a96f8730b35c7406d57f23bbba734d\n54df2984e833ba2854de670cce43b823\nAe00b0f490b122ebab614d98bb2361f7\ne6fa116ef2705ecf9677021e5e2f691e\n31af3e7fff79bc48a99b8679ea74b589\n\n%system%\\ualapi.dll\n%system%\\ualapi.dll\n%system%\\ualapi.dll\n%system%\\ualapi.dll\nC:\\GoogleD\\Coding\\JS\\Node\\winhttp.dll\n\nSIGNBT\n9b62352851c9f82157d1d7fcafeb49d3\nLPEClient\n3a77b5054c36e6812f07366fb70b007d\n%systme%\\wbem\\wbemcomn.dll\nE89fa6345d06da32f9c8786b65111928\n%ProgramData%\\Microsoft\\Windows\\ServiceSetting\\ESENT.dll\nFile path\nC:\\GoogleD\\Coding\\JS\\Node\\SgrmLpac.exe\nC:\\GoogleD\\Coding\\JS\\Node\\winhttp.dll\nC:\\Windows\\system32\\config\\systemprofile\\appdata\\Local\\tw-100a-a00-e14d9.tmp\nC:\\Windows\\system32\\config\\systemprofile\\appdata\\Local\\tw-100b-a00-e14d9.tmp\nC:\\ProgramData\\ntuser.008.dat\nC:\\ProgramData\\ntuser.009.dat\nC:\\ProgramData\\ntuser.001.dat\nC:\\ProgramData\\ntuser.002.dat\nC:\\ProgramData\\Microsoft\\Windows\\ServiceSetting\\ESENT.dll\nC2 servers\nhxxp://ictm[.]or[.]kr/UPLOAD_file/board/free/edit/index[.]php\nhxxp://samwoosystem[.]co[.]kr/board/list/write[.]asp\nhxxp://theorigin[.]co[.]kr:443/admin/management/index[.]php\nhxxp://ucware[.]net/skins/PHPMailer-master/index[.]php\n9/11\n\nhxxp://www[.]friendmc[.]com/upload/board/asp20062107[.]asp\nhxxp://www[.]hankooktop[.]com/ko/company/info[.]asp\nhxxp://www[.]khmcpharm[.]com/Lib/Modules/HtmlEditor/Util/read[.]cer\nhxxp://www[.]vietjetairkorea[.]com/INFO/info[.]asp\nhxxp://yoohannet[.]kr/min/tmp/process/proc[.]php\nhxxps://admin[.]esangedu[.]kr/XPaySample/submit[.]php\nhxxps://api[.]shw[.]kr/login_admin/member/login_fail[.]php\nhxxps://hicar[.]kalo[.]kr/data/rental/Coupon/include/inc[.]asp\nhxxps://hspje[.]com:80/menu6/teacher_qna[.]asp\nhxxps://kscmfs[.]or[.]kr/member/handle/log_proc[.]php\nhxxps://kstr[.]radiology[.]or[.]kr/upload/schedule/29431_1687715624[.]inc\nhxxps://little-pet[.]com/web/board/skin/default/read[.]php\nhxxps://mainbiz[.]or[.]kr/SmartEditor2/photo_uploader/popup/edit[.]asp\nhxxps://mainbiz[.]or[.]kr/include/common[.]asp\nhxxps://new-q-cells[.]com/upload/newsletter/cn/frame[.]php\nhxxps://pediatrics[.]or[.]kr/PubReader/build_css[.]php\nhxxps://pms[.]nninc[.]co[.]kr/app/content/board/inc_list[.]asp\nhxxps://safemotors[.]co[.]kr/daumeditor/pages/template/template[.]asp\nhxxps://swt-keystonevalve[.]com/data/editor/index[.]php\nhxxps://vnfmal2022[.]com/niabbs5/upload/gongji/index[.]php\nhxxps://warevalley[.]com/en/common/include/page_tab[.]asp\nhxxps://www[.]blastedlevels[.]com/levels4SqR8/measure[.]asp\nhxxps://www[.]droof[.]kr/Board/htmlEdit/PopupWin/Editor[.]asp\nhxxps://www[.]friendmc[.]com:80/upload/board/asp20062107[.]asp\nhxxps://www[.]hanlasangjo[.]com/editor/pages/page[.]asp\nhxxps://www[.]happinesscc[.]com/mobile/include/func[.]asp\nhxxps://www[.]healthpro[.]or[.]kr/upload/naver_editor/subview/view[.]inc\nhxxps://www[.]medric[.]or[.]kr/Controls/Board/certificate[.]cer\nhxxps://www[.]muijae[.]com/daumeditor/pages/template/simple[.]asp\nhxxps://www[.]muijae[.]com/daumeditor/pages/template/template[.]asp\nhxxps://www[.]nonstopexpress[.]com/community/include/index[.]asp\nhxxps://www[.]seoulanesthesia[.]or[.]kr/mail/mail_211230[.]html\nhxxps://www[.]seouldementia[.]or[.]kr/_manage/inc/bbs/jiyeuk1_ok[.]asp\nhxxps://www[.]siriuskorea[.]co[.]kr/mall/community/bbs_read[.]asp\nhxxps://yoohannet[.]kr/min/tmp/process/proc[.]php\n\nMITRE ATT&CK Mapping\nTactic\n\nTechniques\n\nInitial Access\n\nT1189\n\n10/11\n\nExecution\n\nT1203\n\nPersistence\n\nT1547.012, T1574.002\n\nPrivilege Escalation\n\nT1547.012\n\nDefense Evasion\n\nT1140, T1574.002, T1027.001, T1027.002, T1620\n\nCredential Access\n\nT1003.001\n\nDiscovery\n\nT1057, T1082, T1083\n\nCollection\n\nT1113\n\nCommand and Control\n\nT1071.001, T1132.002, T1573.001\n\nExfiltration\n\nT1041\n\nBackdoor\nLazarus\nMalware Descriptions\nMalware Technologies\nTargeted attacks\nVulnerabilities and exploits\nA cascade of compromise: unveiling Lazarus’ new campaign\nYour email address will not be published. Required fields are marked *\n\n11/11",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/v2z7vgbi74nivtd8hwghetsx04m4s0ah"
    ],
    "report_names": [
        "Kaspersky_cascade-of-compromise-unveiling-Lazarus-new-campaign(10-27-2023)"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2024-11-22T02:00:52.401401Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2024-11-22T02:02:01.066077Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2024-11-22T02:02:53.097417Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2024-11-22T02:02:53.099195Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2024-11-22T02:00:02.4824Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Hidden Cobra",
                "Nickel Academy",
                "ATK3",
                "Sapphire Sleet",
                "TA404",
                "BeagleBoyz",
                "Bureau 121",
                "Group 77",
                "Operation GhostSecret",
                "APT-C-26",
                "NICKEL GLADSTONE",
                "ATK117",
                "G0082",
                "Dark Seoul",
                "Diamond Sleet",
                "Andariel",
                "Appleworm",
                "COPERNICIUM",
                "Operation DarkSeoul",
                "Unit 121",
                "Bluenoroff",
                "G0032",
                "DEV-1222",
                "Labyrinth Chollima",
                "APT38",
                "Stardust Chollima",
                "Whois Hacking Team",
                "Citrine Sleet",
                "DEV-0139",
                "Lazarus group",
                "APT 38",
                "Hastati Group",
                "NewRomanic Cyber Army Team",
                "Subgroup: Bluenoroff",
                "Operation Troy",
                "Operation AppleJeus",
                "COVELLITE"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1702951484905,
    "ts_updated_at": 1732240988230,
    "ts_creation_date": 1702404058000,
    "ts_modification_date": 1702404058000,
    "files": {
        "pdf": "https://archive.orkl.eu/d88076abd0fbde4927a2948ca8065659e9ba6752.pdf",
        "text": "https://archive.orkl.eu/d88076abd0fbde4927a2948ca8065659e9ba6752.txt",
        "img": "https://archive.orkl.eu/d88076abd0fbde4927a2948ca8065659e9ba6752.jpg"
    }
}