{
    "id": "15fa95e3-2934-4a6c-a594-f9505593634f",
    "created_at": "2023-06-05T02:07:49.72881Z",
    "updated_at": "2024-11-22T02:03:47.641008Z",
    "deleted_at": null,
    "sha1_hash": "d9a7f59c8487d45f5b1504399ee6eada8f153fa5",
    "title": "2023-04-07 - Attack chain leads to XWORM and AGENTTESLA",
    "authors": "",
    "file_creation_date": "2023-06-04T12:28:42Z",
    "file_modification_date": "2023-06-04T12:28:42Z",
    "file_size": 2112399,
    "plain_text": "Attack chain leads to XWORM and AGENTTESLA\nelastic.co/security-labs/attack-chain-leads-to-xworm-and-agenttesla\n\nBy\nSalim Bitam\n07 April 2023\nEnglish\n\nKey Takeaways\nThreat actors are deploying known malware using their own custom .NET loaders\nThe threat actors employ simple and well-known tactics such as bypassing AMSI\nthrough patching and a basic custom .NET loader\nThe threat actors are abusing legitimate free file hosting services\n\nPreamble\nOur team has recently observed a new malware campaign that employs a well-developed\nprocess with multiple stages. The campaign is designed to trick unsuspecting users into\nclicking on the documents, which appear to be legitimate, but are in fact fake, the adversary\n\n1/11\n\nleverages weaponized word documents to execute malicious PowerShell scripts, and also\nutilizes a custom obfuscated .NET loader to load various malware strains, including XWORM\nand AGENTTESLA.\n\nRTF loader code analysis\nOverview\nDuring a recent investigation, we discovered a malicious word document named Card &\nBooking Details.docx. This document has been designed with the intent to deceive the\nvictim and includes two falsified scanned documents, namely a credit card and a passport.\nUpon opening the document, an RTF object hosted at\nwww.mediafire[.]com/file/79jzbqigitjp2v2/p2.rtf is fetched.\nThis RTF object contains a macro-enabled Excel object. When opened, this macro downloads\nan obfuscated powerShell script which in turn deploys different malware families.\nAt the time of this writing, we have observed two distinct malware families, namely XWORM\nand AGENTTESLA, have been deployed through this execution chain. Both malware families\nmentioned above are loaded into the compromised system's memory by the same custom\n.NET loader. Once loaded, the malicious payload can carry out a range of functions, such as\nstealing sensitive data and executing commands on the compromised system.\n\nIn this research post, we will walk through the initial execution of the malware and detail the\ncapabilities we discovered.\n\nExtracting the malicious VBA\n2/11\n\nThe RTF document contains multiple embedded objects, including an interesting one that\ncaught our attention: Excel.SheetMacroEnabled.\n\nWe can use rtfdumpy.py, a script developed by Didier Stevens to analyze RTF files, to dump\nthe object and olevba.py, a script developed by Philippe Lagadec, to extract any embedded\nVBA scripts from an OLE object. The extracted VBA script shown below downloads and\nexecutes a malicious powershell script from\nhttps://www.mediafire[.]com/file/xnqxmqlcj51501d/7000m.txt/file.\n\nPowershell script analysis\nThe malicious PowerShell script is obfuscated using string substitution to evade detection and\nmake analysis more difficult.\n\n3/11\n\nIt contains additional powershell script blocks in hex format that will be deployed in the\ninfected machine designed to prepare the environment by setting up persistence, bypassing\nAMSI, disabling Windows defender and creating a mechanism to update the malware. The\nultimate objective is to install two .NET binaries, namely a loader and a payload (XWORM /\nAGENTTESLA).\n\nDeleting the malicious document\nThe malware starts by deleting the original Word document, first killing the process\nWinword.exe and then deleting all .DOCX files located in the default Downloads and\nDesktop folders of every user. This initial step shows the malware's destructive nature and\nhow it can potentially harm the user's data.\n\nPersistence\nThe malware creates a directory in the path C:\\ProgramData\\MinMinons, which is used to\nstore other Powershell scripts and binaries. The currently running Powershell script is then\ncopied to C:\\ProgramData\\MinMinons\\Candlegraphy.___.\nNext, the malware deobfuscates the first embedded Powershell script which is used to create\npersistence. It first writes a JScript file that invokes the original Powershell script saved in\nC:\\ProgramData\\MinMinons\\Candlegraphy.___ through the activeXObject shell, then a\nscheduled task named “MOperaChrome” is created to run the JScript file using the Microsoft\nsigned Windows Script Host (WSH) utility, wscript.exe.\n4/11\n\nAMSI bypass\nThe second embedded powershell script is responsible for bypassing AMSI by patching the\namsiInitFailed flag. In doing so, the initialization of AMSI fails, leading to the prevention of\nany scan being initiated for the ongoing process. Furthermore, the PowerShell script proceeds\nto disable the Microsoft Windows Defender service.\n\nUser creation\nThe script creates a local administrator account named “System32” and adds it to the Remote\nDesktop Users group. This enables the attacker to log in via Remote Desktop Protocol (RDP).\nNext, the script disables the machine's firewall to allow inbound RDP connection attempts\nwhich aren’t filtered by edge controls.\n\nMalware update persistence\nThe third embedded script stores a secondary JScript file, whose purpose is downloading a\nrevised or updated version of the malware. This file is saved to a predetermined location at\nC:\\ProgramData\\MinMinons\\miguan.js. Furthermore, a scheduled task with the name\n(“miguaned”) is created to execute the JScript file through wscript.exe, similar to the\npreviously described task.\nThe JScript creates an instance of WScript.Shell object by calling ActiveXObject with the\nfollowing CLSID {F935DC22-1CF0-11D0-ADB9-00C04FD58A0B} which corresponds to Shell\nObject, then downloads from the URL https://billielishhui.blogspot[.]com/atom.xml the update\n5/11\n\npowershell malware.\n\n.NET loader\nThe custom DOTNET loader employs the P/INVOKE technique to call the native Windows\nAPI and inject a payload into a signed microsoft binary via process hollowing.\nThe loader’s code employs various obfuscation techniques to hinder analysis, including the\nuse of dead instruction, renamed symbols to make the code less readable and more\nconfusion and encoded strings. Fortunately a tool like de4dot can be used to output a humanreadable version of it.\n\n6/11\n\nThe malware leverages the LoadLibrary and GetProcAddress APIs to access the required\nWindows APIs. To obscure the names of these APIs, the loader stores them in an encoded\nformat within the binary file, utilizing a sequence of substitution and string reversal methods.\n\nThe loader then starts a process in a suspended state using CreateProcessA API. The\nfollowing is the list of executables it uses as a host for it’s malicious code:\nC:\\Windows\\Microsoft.NET\\Framework\\v4.0.30319\\RegSvcs.exe\nC:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\RegSvcs.exe\nC:\\Windows\\Microsoft.NET\\Framework\\v3.5\\Msbuild.exe\nThese binaries are signed and trusted by the system and can evade detection by security\nsoftware that relies on whitelisting system processes. It then uses Zwunmapviewofsection to\nunmap the memory of the target process, writes the payload to the suspended process and\nthen resume the thread using ResumeThread API.\n\nFinal payload\nDuring our research we discovered that the threat actor has been deploying different\npayloads. Namely, we observed 2 families: XWORM and AGENTTESLA.\nXWORM has gained notoriety in the underground criminal marketplace due to its ability to\nemploy sophisticated capabilities like virtualization and sandbox detection, used to avoid\ndetection and support persistence within an infected system.\nOf particular concern is the fact that XWORM is readily available on the internet as a cracked\nversion, with version 2.1 being especially prevalent. This highlights the dangers of\nunderground cybercrime markets and the ease with which malicious actors can access and\nutilize powerful tools.\n\n7/11\n\nTwo different versions of the XWORM family were observed versions 2.2 and 3.1. The\nfollowing is the configuration of a XWORM sample in plain text.\n\nAGENTTESLA is a trojan and credential stealer written in .NET. While it first emerged in 2014,\nit is now among the most active and malicious software. AGENTTESLA is affordably priced\nand includes support from the developers, making it easily accessible to cybercriminals with\nlimited technical skills.\nThe sample we analyzed was heavily obfuscated, masqueraded as an AVG installer,and\nleverages discord for C2. It uploads stolen information to the attacker’s Discord channel via\nthe following webhook:\nhttps://discord[.]com/api/webhooks/1089956337733087274/uYNA_D8Ns1z9NZ3B1mGp0XXyGq785KLGIfEAZsrz3TJd5fvOjXA927F7bUTTzbNT6Zk.\n\n8/11\n\nObserved adversary tactics and techniques\nElastic uses the MITRE ATT&CK framework to document common tactics, techniques, and\nprocedures that threats use.\n\nTactics\nTactics represent the “why” of a technique or sub-technique. They represent the adversary’s\ntactical goals: the reason for performing an action.\n\nTechniques/subtechniques\nTechniques and Subtechniques represent how an adversary achieves a tactical goal by\nperforming an action.\n\nDetection logic\nYARA\nElastic Security has created YARA rules to identify this activity. Below are YARA rules to\nidentify XWORM and AGENTTESLA malware families.\n\n9/11\n\nrule Windows_Trojan_Xworm_732e6c12 {\nmeta:\nauthor = \"Elastic Security\"\nid = \"732e6c12-9ee0-4d04-a6e4-9eef874e2716\"\nfingerprint = \"afbef8e590105e16bbd87bd726f4a3391cd6a4489f7a4255ba78a3af761ad2f0\"\ncreation_date = \"2023-04-03\"\nlast_modified = \"2023-04-03\"\nos = \"Windows\"\narch = \"x86\"\ncategory_type = \"Trojan\"\nfamily = \"Xworm\"\nthreat_name = \"Windows.Trojan.Xworm\"\nsource = \"Manual\"\nmaturity = \"Diagnostic\"\nreference_sample =\n\"bf5ea8d5fd573abb86de0f27e64df194e7f9efbaadd5063dee8ff9c5c3baeaa2\"\nscan_type = \"File, Memory\"\nseverity = 100\nstrings:\n$str1 = \"startsp\" ascii wide fullword\n$str2 = \"injRun\" ascii wide fullword\n$str3 = \"getinfo\" ascii wide fullword\n$str4 = \"Xinfo\" ascii wide fullword\n$str5 = \"openhide\" ascii wide fullword\n$str6 = \"WScript.Shell\" ascii wide fullword\n$str7 = \"hidefolderfile\" ascii wide fullword\ncondition:\nall of them}\nrule Windows_Trojan_AgentTesla_d3ac2b2f {\nmeta:\nauthor = \"Elastic Security\"\nid = \"d3ac2b2f-14fc-4851-8a57-41032e386aeb\"\nfingerprint = \"cbbb56fe6cd7277ae9595a10e05e2ce535a4e6bf205810be0bbce3a883b6f8bc\"\ncreation_date = \"2021-03-22\"\nlast_modified = \"2022-06-20\"\nos = \"Windows\"\narch = \"x86\"\ncategory_type = \"Trojan\"\nfamily = \"AgentTesla\"\nthreat_name = \"Windows.Trojan.AgentTesla\"\nsource = \"Manual\"\nmaturity = \"Diagnostic, Production\"\nreference_sample =\n\"65463161760af7ab85f5c475a0f7b1581234a1e714a2c5a555783bdd203f85f4\"\nscan_type = \"File, Memory\"\nseverity = 100\nstrings:\n$a1 = \"GetMozillaFromLogins\" ascii fullword\n$a2 = \"AccountConfiguration+username\" wide fullword\n$a3 = \"MailAccountConfiguration\" ascii fullword\n10/11\n\n$a4 = \"KillTorProcess\" ascii fullword\n$a5 = \"SmtpAccountConfiguration\" ascii fullword\n$a6 = \"GetMozillaFromSQLite\" ascii fullword\n\n11/11",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-07 - Attack chain leads to XWORM and AGENTTESLA.pdf"
    ],
    "report_names": [
        "2023-04-07 - Attack chain leads to XWORM and AGENTTESLA.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1685930869728,
    "ts_updated_at": 1732241027641,
    "ts_creation_date": 1685881722000,
    "ts_modification_date": 1685881722000,
    "files": {
        "pdf": "https://archive.orkl.eu/d9a7f59c8487d45f5b1504399ee6eada8f153fa5.pdf",
        "text": "https://archive.orkl.eu/d9a7f59c8487d45f5b1504399ee6eada8f153fa5.txt",
        "img": "https://archive.orkl.eu/d9a7f59c8487d45f5b1504399ee6eada8f153fa5.jpg"
    }
}