{
    "id": "4f2e1847-8123-4c85-8205-67c81c5d927c",
    "created_at": "2023-12-12T02:05:59.75156Z",
    "updated_at": "2024-11-22T02:02:54.450464Z",
    "deleted_at": null,
    "sha1_hash": "e16339ec8a52ad200eae8d0fb6be95550d8f9c07",
    "title": "New Tool Set Found Used Against Organizations in the Middle East, Africa and the US",
    "authors": "Palo Alto Networks",
    "file_creation_date": "2023-12-11T02:46:03Z",
    "file_modification_date": "2023-12-11T02:46:03Z",
    "file_size": 3637632,
    "plain_text": "New Tool Set Found Used Against Organizations in the\nMiddle East, Africa and the US\nunit42.paloaltonetworks.com/new-toolset-targets-middle-east-africa-usa\nChema Garcia\n\nDecember 1, 2023\n\nBy Chema Garcia\nDecember 1, 2023 at 3:00 AM\nCategory: Malware\nTags: .NET Framework, Advanced URL Filtering, Advanced WildFire, Agent Raccoon,\nbackdoor, CL-STA-0002, CL-STA-0043, Cortex XDR, DNS, DNS security, Mimikatz,\nMimilite, Ntospy\n\nThis post is also available in: 日本語 (Japanese)\n\nExecutive Summary\nUnit 42 researchers observed a series of apparently related attacks against organizations in\nthe Middle East, Africa and the U.S. We will discuss a set of tools used in the course of the\nattacks that reveal clues about the threat actors’ activity. We are sharing this research to\nprovide detection, prevention and hunting recommendations to help organizations strengthen\ntheir overall security posture.\nThese tools were used to perform the following activities:\nEstablish backdoor capabilities\nFor command and control (C2)\nSteal user credentials.\nExfiltrate confidential information\nUnit 42 is sharing these results with the purpose of helping organizations defend against the\ntools observed here.\nWe assess with medium confidence that this threat activity cluster aligns to nation-state\nrelated threat actors due to the nature of the organizations that were compromised, the TTPs\nobserved and the customization of the tool set. We have not confirmed a particular nationstate or threat group.\nTools that were used in this cluster were the following:\n1/22\n\nA new backdoor we’ve named Agent Racoon\nThis malware family is written using the .NET framework and leverages the\ndomain name service (DNS) protocol to create a covert channel and provide\ndifferent backdoor functionalities. Threat actors have used this along with the\nother two tools in multiple attacks targeting organizations across the U.S., Middle\nEast and Africa. Its C2 infrastructure dates back to 2020.\nA new tool we’ve named Ntospy\nThis malware is a Network Provider DLL module designed to steal user\ncredentials.\nA customized version of Mimikatz called Mimilite\nThe compromised organizations belong to the following industries:\nEducation\nReal estate\nRetail\nNon-profit organizations\nTelecom companies\nGovernments\nBased on unique similarities in tools as well as tactics, techniques and procedures (TTPs),\nwe are tracking this threat activity cluster as CL-STA-0002.\nWhat follows is a detailed description of the activity we observed as well as characteristics of\nthe tool set.\nPalo Alto Networks customers receive protection from these threats through Cortex XDR as\nwell as Advanced URL Filtering, DNS Security and Advanced Wildfire. Organizations can\nengage the Unit 42 Incident Response team for specific assistance with this threat and\nothers.\nRelated Unit 42 Topics\n\nDNS, Mimikatz, Backdoor\n\nTable of Contents\nActivity Summary\nGaining Access to Credentials with Ntospy\nCredentials Dumping Through Mimilite\nAgent Racoon Backdoor\nData Exfiltration\nConclusion\nIndicators of Compromise\nAdditional Resources\n2/22\n\nActivity Summary\nThe threat actor used temporary directories such as C:\\Windows\\Temp and C:\\Temp to\ndeploy specific components of their tool set across the different affected organizations. They\nused the following similar filenames for batch and PowerShell scripts:\nc:\\windows\\temp\\crs.ps1\nc:\\windows\\temp\\ebat.bat\nc:\\windows\\temp\\install.bat\nc:\\windows\\temp\\mslb.ps1\nc:\\windows\\temp\\pb.ps1\nc:\\windows\\temp\\pb1.ps1\nc:\\windows\\temp\\pscan.ps1\nc:\\windows\\temp\\set_time.bat\nc:\\windows\\temp\\usr.ps1\nWhile the attackers commonly used Ntospy across the affected organizations, the Mimilite\ntool and the Agent Racoon malware have only been found in nonprofit and governmentrelated organizations’ environments.\nAfter each attack session, the threat actor leveraged cleanmgr.exe to clean up the\nenvironment used during the session.\n\nGaining Access to Credentials with Ntospy\nTo perform credential theft, the threat actor used a custom DLL module implementing a\nNetwork Provider. A Network Provider module is a DLL component implementing the\ninterface provided by Microsoft to support additional types of network protocols during the\nauthentication process.\nThis technique is pretty well documented. Sergey Polak demonstrated the technique at\nBlackHat back in 2004 at his session titled “Capturing Windows Passwords using the\nNetwork Provider API.” In 2020, researcher Grzegorz Tworek uploaded his tool NPPSpy to\nGitHub, which also implements this technique.\nDue to the file naming patterns of the DLL module, and as a reference to the previous\nresearch and tools, Unit 42 researchers named this malware family Ntospy. The threat actor\nregisters the Ntospy DLL module as a Network Provider module to hijack the authentication\nprocess, to get access to the user credentials every time the victim attempts to authenticate\nto the system.\nFigure 1 illustrates the path of the processes the malware used during the authentication\nprocess to load the malicious DLL module in an MS Exchange Server environment.\n\n3/22\n\nFigure 1. Image path of processes loading the malicious DLL component in an MS Exchange\nenvironment.\n\nThe threat actor’s implementation of this technique has some unique features. They created\ndifferent versions of the Ntospy malware over the time frame we observed. They all share\nsimilarities, such as the following:\nUsing filenames with Microsoft patch patterns.\n.msu extensions pretending to be Microsoft Update Package files to store the received\ncredentials in cleartext.\nRichPE header hashes that link different samples to the same compilation\nenvironment.\nTo install the DLL module, the threat actor registers a new Network Provider called credman.\nThey do so by using an installation script found at C:\\Windows\\Temp\\install.bat that installs\nthe Network Provider by using reg.exe. The malware then sets the DLL module path by\npointing to the malicious DLL module c:\\windows\\system32\\ntoskrnl.dll.\n\nFigure 2 shows static commonalities across the different DLL modules we identified as\nbelonging to the same malware family. The image also illustrates that there are overlaps on\nthe RichPE header hash as well as the PE sections of the samples.\n4/22\n\nFigure 2. Graph of static features relation across samples.\n\nIn the group of samples with the same RichPE header hash, we saw that they had been\ncompiled using the same environment. In this case, that was Visual Studio 2019 v16.0.0\nbuild 27508. Other samples of the malware family have been compiled on different\nenvironments or even tweaked to avoid overlapping.\nThe samples that don’t share the same build environment are actually similar in behavior, but\nthey have some differences in implementation. For instance, some of the malware samples\ncontain the file path used to store the credentials hard-coded in plain text. Figures 3 and 4\nshow how others use an encrypted file path and stack strings.\n\nFigure 3. Pseudocode showing the hard-coded file path in cleartext.\n\n5/22\n\nFigure 4. Pseudocode showing the file path encrypted with a stream cipher.\n\nDecrypting the file path at runtime shows that the versions using an encrypted file path also\nuse the same file path pattern, as shown in Figure 5.\n\nFigure 5. File path decrypted at runtime.\n\nAll the DLL modules we identified use the same file path pattern, abusing the .msu file\nextension to masquerade as a Microsoft Update Package. The following paths are used by\nthe malware samples:\nc:/programdata/microsoft/~ntuserdata.msu\nc:/programdata/package cache/windows10.0-kb5000736-x64.msu\nc:/programdata/package cache/windows10.0-kb5009543-x64.msu\nc:/programdata/packag~1/windows 6.1-kb4537803.msu\nAlso, the DLL files are stored in the following file paths:\nC:\\Windows\\System32\\ntoskrnl.dll\nC:\\Windows\\Temp\\ntoskrnl.dll\nC:\\Windows\\Temp\\ntos.dll\n\n6/22\n\nWhile the first file path is the one used to actually install the Network Provider module, the\nTemp directory is the working directory used by the threat actor to temporarily store the DLL\nmodules. As shown in the file paths above, the threat actor used Windows binary name\npatterns (based on the Windows system file named ntoskrnl.exe) in an attempt to trick\nvictims and analysts into overlooking the malicious DLL component.\nThe first activity is identified with the malware sample with the file hash SHA256\nbcd2bdea2bfecd09e258b8777e3825c4a1d98af220e7b045ee7b6c30bf19d6df. This overlaps\nwith another threat activity cluster that we call CL-STA-0043, originally published in June\n2023.\n\nCredentials Dumping Through Mimilite\nAnother tool used for gathering credentials and sensitive information is a customized version\nof the well-known Mimikatz tool that, according to references within the sample, the threat\nactor calls Mimilite.\nThe tool is a reduced version of Mimikatz, which needs to be given a password through the\ncommand line to run:\n1\n\nC:\\temp\\update.exe 1dsfjlosdf23dsfdfr\n\nWhen the binary is executed, it takes the command-line argument as a decryption key to\ndecrypt the actual payload using a stream cipher. Before executing the decrypted payload,\nthe binary verifies that the payload has been successfully decrypted with the right key by\nperforming an integrity check. This check is done by comparing the MD5 hash of the\ndecrypted payload with the hard-coded value b855dfde7f778f99a3724802715a0baa, as\nshown in the code snippet in Figure 6.\n\n7/22\n\nFigure 6. Execution logic.\n\nWhen executed properly, the tool dumps the credentials to the file path\nC:\\Windows\\Temp\\KB200812134.txt. This choice of filename is another attempt by the threat\nactors to masquerade as a Microsoft update.\nThe Mimilite sample was found at C:\\temp\\update.exe with the file hash SHA256\n3490ba26a75b6fb295256d077e0dbc13e4e32f9fd4e91fb35692dbf64c923c98. It was first\nuploaded to VirusTotal on 2020-05-11 05:43:00 UTC and first identified in the wild on 202102-12 21:54:35 UTC. What we find interesting is that according to VirusTotal, this sample has\nbeen uploaded and discovered in the wild using the following path and filename:\n1\n2\n3\n\nC:\\restrict\\analysis\\apt_sorted\\attack_case\\[REDACTED_LOCATION]\\[REDACTED_COU\nupdate.exe\n\nThe elements of this path might suggest that the same binary has been involved in some sort\nof research that the uploader believed was linked with nation-state actors.\n\nAgent Racoon Backdoor\n\n8/22\n\nThe Agent Racoon malware family is built to provide backdoor capabilities. It is written using\nthe .NET framework, and leverages DNS to establish a covert channel with the C2 server.\nUnit 42 researchers named the malware family Agent Racoon due to some references found\nwithin the code of the identified samples, as shown in Figure 7.\n\nFigure 7. .NET Project details.\n\nWhen executed, the threat has some predefined settings such as:\nThe base domain used to create the DNS covert channel\nA unique key per sample, used as a seed to generate an encryption password to\nencrypt the DNS communication\nA fallback DNS server if no DNS server can be read from the compromised system\nAll the C2 domains identified fulfill the same base pattern, with unique values for the four\ncharacter identifier across different samples:\n[4 characters].telemetry.[domain].com\nThe value of Program.dns_ip is different for each sample found, which could indicate that the\nthreat actor is building the binary with specific settings gathered from the targeted\nenvironment.\n\n9/22\n\nFigure 8. Main function of the malware sample.\n\nWith that pattern, the threat communicates with the C2 server by adding additional\nsubdomains to build the DNS query. It uses Internationalizing Domain Names for\nApplications’ (IDNA) domain names with Punycode encoding. This encoding type is a\nrepresentation of Unicode values over the ASCII encoding for internet hostnames.\nThe domain names follow the pattern below:\n[random_val].a.[4 characters].telemetry.[domain].com\nThe screenshot from Wireshark in Figure 9 illustrates a complete DNS query:\n\nFigure 9. Sample DNS query.\n\n10/22\n\nTo manage the communication with the C2 server, the malware uses a communication loop\nshown in Figure 10.\n\nFigure 10. Communication loop.\n\nThe following are some main features of the communication loop above:\nThe communication loop finishes when the answer xn--cc is received from the C2\nserver, or a communication error occurs.\n11/22\n\nThe randomized delay between messages can have multiple reasons:\nTo avoid network spikes.\nTo avoid potential network congestion.\nTo provide randomness as an attempt to avoid network beaconing detection.\nThe encryption of all the communication messages through Program.Util.RC.\nThe encryption routine implements a stream cipher that takes the initial unique key per\nsample Program.key (this.defaultkey), as shown in Figure 11. It then creates a 1-byte\nencryption key to later encrypt the message with an XOR.\n\nFigure 11. Stream cipher routine.\n\nDepending on the length of the message sent to the C2 server, different subdomains are\nadded to the query, as shown in the code snippet in Figure 12.\n\n12/22\n\nFigure 12. Partial request crafting.\n\nThe this.Rand() component of the fully qualified domain name (FQDN) build is intended to\navoid caching and ensure the request reaches out to the C2 server.\nAgent Racoon provides the following backdoor functionality:\nCommand execution\nFile uploading\nFile downloading\nAlthough Agent Racoon does not provide any sort of persistence mechanism by itself, during\nthe activity we observed, the threat was executed by using scheduled tasks.\nUnit 42 researchers discovered the following samples using different subdomains of\ntelemetry.geoinfocdn[.]com, as shown in Figure 13. The domain geoinfocdn[.]com was\nregistered on 2022/08/19 UTC for one year.\n\n13/22\n\nFigure 13. Samples linked with file path and base C2 domain.\n\nUnit 42 researchers were able to track the Agent Racoon malware family back to July 2022.\nTwo samples of the malware family were uploaded to VirusTotal from Egypt and Thailand in\nSeptember 2022 and July 2022 with the following SHA256 hashes:\n3a2d0e5e4bfd6db9c45f094a638d1f1b9d07110b9f6eb8874b75d968401ad69c\ndee7321085737da53646b1f2d58838ece97c81e3f2319a29f7629d62395dbfd1\nThese two samples used the same subdomain patterns, but this time the domain used for C2\nwas telemetry.geostatcdn[.]com. Threat actors performed the following activities regarding\nthis domain on the dates shown:\nRegistered: 2020/08/27 UTC\nFirst seen in the wild: 2021/06/17 23:10:58 UTC\nRenewed: 2021/08/18 UTC\nExpired: 2022/08/27 UTC\nFigure 14 shows that with this information, two groups of malware samples can be identified\nusing different C2 domain names and file paths since 2020.\n\n14/22\n\nFigure 14. Malware samples identified.\n\nThe threat actor tried to disguise the Agent Racoon binary as Google Update and MS\nOneDrive Updater binaries.\nThe malware developers made small modifications to the source code in an attempt to evade\ndetection. Some samples used a domain hard-coded in plain text to establish the DNS covert\nchannel (as shown in Figure 15), whereas other samples used a Base64 encoded string.\n\nFigure 15. Base64 encoded C2 domain.\n\nAside from the Base64 feature, the differences are in the settings and not in the actual\nsource code, except for the sample with SHA256 hash\n354048e6006ec9625e3e5e3056790afe018e70da916c2c1a9cb4499f83888a47.\nThis sample has a compilation timestamp that was modified and is outside the time frame of\nactivity: 2075/02/23 08:12:59 UTC.\nAs shown in Figure 16, the threat actor also tried to obfuscate the constant cmd.exe to avoid\nsignature-based detections. They did so by using the equivalent Base64 encoded value with\nthe added constant 399 so the equivalent Base64 encoded string can’t be detected through\nsignatures.\n\n15/22\n\nFigure 16. Obfuscated cmd.exe pattern.\n\nData Exfiltration\nUnit 42 researchers also identified the collection and successful exfiltration of confidential\ninformation, such as emails from MS Exchange environments, using PowerShell snap-ins to\ndump the emails.\n\nIn the search criteria from the command above, the threat actor used similar commands to\nsearch through different folders, mailboxes and dates to dump those emails.\nAfter dumping the emails, the threat actor tried to compress the .pst file with a command-line\nRAR tool before exfiltrating it:\n\nHowever, the threat actor canceled the attempt to compress the .pst file by using the tool\ntaskkill.exe approximately eight minutes later.\n\nEventually the threat actor discarded the usage of raren.exe and simply renamed the .pst\nfile, moving it to the IIS root directory and mimicking an error log in a compressed file to\ndownload it through the web server.\n\nAnd finally, the ai.pst file is removed.\n\n16/22\n\nThis process is repeated for several mailboxes with different search criteria.\nIn addition to the email exfiltration, Unit 42 researchers identified exfiltration of the victim’s\nRoaming Profile. A Roaming Profile is used to serve the same profile to the user when\nlogging in from different computers from the same Active Directory environment.\nTo exfiltrate this, the threat actor compressed the directory by using the standalone version\nof the 7-Zip tool (which they dropped into the system using certutil.exe), and split the\ncompressed file into chunks of 100 MB.\n\nLater, following the same procedure, the threat actor exfiltrated the content.\n\nConclusion\nOur hope in sharing the descriptions of this tool set is that readers can use this information to\nsearch their networks to identify other possible attacks using these tools. This tool set is not\nyet associated with a specific threat actor, and not entirely limited to a single cluster or\ncampaign.\nAs mentioned at the beginning of this article, we found an overlapping Ntospy sample with\nSHA256 bcd2bdea2bfecd09e258b8777e3825c4a1d98af220e7b045ee7b6c30bf19d6df with a\npreviously identified threat activity cluster CL-STA-0043. However, the overlaps are not\nlimited to that sample.\nWe have also identified two compromised organizations in common across both activity\nclusters. Some of the TTPs match on both clusters, such as the MS Exchange PowerShell\nsnap-ins and one of the Network Provider DLL modules.\n\n17/22\n\nUnit 42 researchers believe this threat activity cluster aligns with medium confidence to\nnation-state related threat actors for the following reasons:\nThe detection and defense evasion techniques used\nThe exfiltration activity observed\nThe victimology\nThe customization level of the tools used\nThe TTPs observed\nPalo Alto Networks customers receive protections from the threats discussed above through\nthe following products:\nCortex XDR includes detections and protections related to the IoCs shared in this\nresearch\nAdvanced URL Filtering and DNS Security blocks related C2 domains as malicious\nThe Advanced WildFire machine-learning models and analysis techniques have been\nreviewed and updated in light of the IoCs shared in this research\nIf you think you may have been compromised or have an urgent matter, get in touch with the\nUnit 42 Incident Response team or call:\nNorth America Toll-Free: 866.486.4842 (866.4.UNIT42)\nEMEA: +31.20.299.3130\nAPAC: +65.6983.8730\nJapan: +81.50.1790.0200\nPalo Alto Networks has shared these findings with our fellow Cyber Threat Alliance (CTA)\nmembers. CTA members use this intelligence to rapidly deploy protections to their customers\nand to systematically disrupt malicious cyber actors. Learn more about the Cyber Threat\nAlliance.\nMITRE ATT&CK Mapping\nDuring the research activity related to the tool set uncovered on this blog, Unit 42\nresearchers identified a set of TTPs, which we’ve mapped to the MITRE ATT&CK matrix in\nthe table below.\nID\n\nName\n\nT1003\n\nOS Credential Dumping\n\nT1018\n\nRemote System Discovery\n\nT1021.006\n\nRemote Services: Windows Remote Management\n\n18/22\n\nT1027.009\n\nObfuscated Files or Information: Embedded Payloads\n\nT1030\n\nData Transfer Size Limits\n\nT1036.005\n\nMasquerading: Match Legitimate Name or Location\n\nT1036.008\n\nMasquerading: Masquerade File Type\n\nT1041\n\nExfiltration Over C2 Channel\n\nT1046\n\nNetwork Service Discovery\n\nT1047\n\nWindows Management Instrumentation\n\nT1053.005\n\nScheduled Task/Job: Scheduled Task\n\nT1059.001\n\nCommand and Scripting Interpreter: PowerShell\n\nT1059.003\n\nCommand and Scripting Interpreter: Windows Command Shell\n\nT1070.004\n\nIndicator Removal: File Deletion\n\nT1070.006\n\nIndicator Removal: Timestomp\n\nT1071.004\n\nApplication Layer Protocol: DNS\n\nT1074\n\nData Staged\n\nT1078.002\n\nValid Accounts: Domain Accounts\n\nT1087.002\n\nAccount Discovery: Domain Account\n\nT1112\n\nModify Registry\n\nT1114\n\nEmail Collection\n\nT1132.001\n\nData Encoding: Standard Encoding\n\nT1136.002\n\nCreate Account: Domain Account\n\nT1140\n\nDeobfuscate/Decode Files or Information\n\nT1505.003\n\nServer Software Component: Web Shell\n\nT1556.008\n\nModify Authentication Process: Network Provider DLL\n\nT1560.001\n\nArchive Collected Data: Archive via Utility\n\nT1564.002\n\nHide Artifacts: Hidden Users\n\nT1570\n\nLateral Tool Transfer\n\n19/22\n\nT1573.001\n\nEncrypted Channel: Symmetric Cryptography\n\nT1583.001\n\nAcquire Infrastructure: Domains\n\nT1583.002\n\nAcquire Infrastructure: DNS Server\n\nT1587.001\n\nDevelop Capabilities: Malware\n\nIndicators of Compromise\nIoC\n\nType\n\n2632bcd0715a7223bda1779e107087964037039e1576d2175acaf61d3759360f\n\nSHA256\n\nae989e25a50a6faa3c5c487083cdb250dde5f0ecc0c57b554ab77761bdaed996\n\nSHA256\n\nC:\\Windows\\Temp\\install.bat\n\nFile path\n\nc:/programdata/microsoft/~ntuserdata.msu\n\nFile path\n\nc:/programdata/packag~1/windows 6.1-kb4537803.msu\n\nFile path\n\nc:/programdata/package cache/windows10.0-kb5009543-x64.msu\n\nFile path\n\nc:/programdata/package cache/windows10.0-kb5000736-x64.msu\n\nFile path\n\ncredman\n\nNetwork\nprovider\nname\n\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\credman\n\nRegistry\nkey path\n\nc:\\windows\\system32\\ntoskrnl.dll\n\nFile path\n\nC:\\Windows\\Temp\\ntos.dll\n\nFile path\n\nC:\\Windows\\Temp\\ntoskrnl.dll\n\nFile path\n\ne30f8596f1beda8254cbe1ac7a75839f5fe6c332f45ebabff88aadbce3938a19\n\nSHA256\n\n20/22\n\n1a4301019bdf42e7b2df801e04066a738d184deb22afcad9542127b0a31d5cfa\n\nSHA256\n\ne7682a61b6c5b0487593f880a09d6123f18f8c6da9c13ed43b43866960b7aa8e\n\nSHA256\n\n58e87c0d9c9b190d1e6e44eae64e9a66de93d8de6cbd005e2562798462d05b45\n\nSHA256\n\n7eb901a6dbf41bcb2e0cdcbb67c53ab722604d6c985317cb2b479f4c4de7cf90\n\nSHA256\n\nf45ea12579f636026d29009190221864f432dbc3e26e73d8f3ab7835fa595b86\n\nSHA256\n\nbcd2bdea2bfecd09e258b8777e3825c4a1d98af220e7b045ee7b6c30bf19d6df\n\nSHA256\n\nC:\\temp\\update.exe\n\nFile path\n\n1dsfjlosdf23dsfdfr\n\nEncryptio\nkey\n\nb855dfde7f778f99a3724802715a0baa\n\nMD5\n\n4351911f266eea8e62da380151a54d5c3fbbc7b08502f28d3224f689f55bffba\n\nSHA256\n\ne0748ce315037253f278f7f8f2820c7dd8827a93b6d22d37dafc287c934083c4\n\nSHA256\n\nbaed169ce874f6fe721e0d32128484b3048e9bf58b2c75db88d1a8b7d6bb938d\n\nSHA256\n\n3a2d0e5e4bfd6db9c45f094a638d1f1b9d07110b9f6eb8874b75d968401ad69c\n\nSHA256\n\n4351911f266eea8e62da380151a54d5c3fbbc7b08502f28d3224f689f55bffba\n\nSHA256\n\n354048e6006ec9625e3e5e3056790afe018e70da916c2c1a9cb4499f83888a47\n\nSHA256\n\ndee7321085737da53646b1f2d58838ece97c81e3f2319a29f7629d62395dbfd1\n\nSHA256\n\ngeostatcdn[.]com\n\nDomain\n\ntelemetry.geostatcdn[.]com\n\nDomain\n\nfdsb.telemetry.geostatcdn[.]com\n\nDomain\n\ndlbh.telemetry.geostatcdn[.]com\n\nDomain\n\nlc3w.telemetry.geostatcdn[.]com\n\nDomain\n\nhfhs.telemetry.geostatcdn[.]com\n\nDomain\n\ngeoinfocdn[.]com\n\nDomain\n\ntelemetry.geoinfocdn[.]com\n\nDomain\n\ng1sw.telemetry.geoinfocdn[.]com\n\nDomain\n\nc:/windows/temp/onedriveupdater.exe\n\nFile path\n\n21/22\n\nc:/windows/system32/msmdlb.exe\n\nFile path\n\nc:/windows/temp/onedriveupdater.exe\n\nFile path\n\nc:/program files (x86)/google/update/googleupdate.exe\n\nFile path\n\nc:\\windows\\temp\\mslb.ps1\n\nFile path\n\nc:\\windows\\temp\\set_time.bat\n\nFile path\n\nc:\\windows\\temp\\pscan.ps1\n\nFile path\n\nc:\\windows\\temp\\crs.ps1\n\nFile path\n\nc:\\windows\\temp\\usr.ps1\n\nFile path\n\nc:\\windows\\temp\\pb.ps1\n\nFile path\n\nc:\\windows\\temp\\ebat.bat\n\nFile path\n\nc:\\windows\\temp\\pb1.ps1\n\nFile path\n\nc:\\windows\\temp\\raren.exe\n\nFile path\n\naabbcc123\n\nPassword\n\n086a6618705223a8873448465717e288cf7cc6a3af4d9bf18ddd44df6f400488\n\nSHA256\n\nP@ssw0rd1\n\nPassword\n\nAssistance$\n\nUsername\n\nZaqwsx123\n\nPassword\n\n22/22",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/z7lwcyx3tk4dlsw4bivcrsi7gaj4u4vs"
    ],
    "report_names": [
        "PaloAlto_NewToolSet-Organizations-in-Middle-East-Africa-and-US(12-01-2023)"
    ],
    "threat_actors": [
        {
            "id": "ffc66b49-9396-46af-966f-9376c4315f32",
            "created_at": "2023-11-21T02:00:07.339061Z",
            "updated_at": "2024-11-22T02:00:02.910136Z",
            "deleted_at": null,
            "main_name": "CL-STA-0043",
            "aliases": [
                "TGR-STA-0043"
            ],
            "source_name": "MISPGALAXY:CL-STA-0043",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cff2cedd-a198-4e79-ae67-19048084ae7f",
            "created_at": "2024-06-20T02:02:09.945126Z",
            "updated_at": "2024-11-22T02:02:01.113113Z",
            "deleted_at": null,
            "main_name": "Operation Diplomatic Specter",
            "aliases": [
                "CL-STA-0043",
                "TGR-STA-0043"
            ],
            "source_name": "ETDA:Operation Diplomatic Specter",
            "tools": [
                "Agent Racoon",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTran",
                "HUC Packet Transmit Tool",
                "JuicyPotatoNG",
                "Kaba",
                "Korplug",
                "LadonGo",
                "Mimikatz",
                "Mimilite",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "Ntospy",
                "PCRat",
                "PlugX",
                "RedDelta",
                "SharpEfsPotato",
                "SinoChopper",
                "Sogu",
                "SweetSpecter",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "TunnelSpecter",
                "Xamtrav",
                "Yasso",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1702346759751,
    "ts_updated_at": 1732240974450,
    "ts_creation_date": 1702262763000,
    "ts_modification_date": 1702262763000,
    "files": {
        "pdf": "https://archive.orkl.eu/e16339ec8a52ad200eae8d0fb6be95550d8f9c07.pdf",
        "text": "https://archive.orkl.eu/e16339ec8a52ad200eae8d0fb6be95550d8f9c07.txt",
        "img": "https://archive.orkl.eu/e16339ec8a52ad200eae8d0fb6be95550d8f9c07.jpg"
    }
}