{
    "id": "2da7c38e-6050-454d-8ea4-299d8cb8c746",
    "created_at": "2023-12-12T02:06:22.195925Z",
    "updated_at": "2024-11-22T02:03:38.757236Z",
    "deleted_at": null,
    "sha1_hash": "ef854d3ab06b7acc16e2ab04a760468966d07805",
    "title": "AeroBlade on the Hunt Targeting the U.S. Aerospace Industry",
    "authors": "Blackberry",
    "file_creation_date": "2023-12-11T02:49:44Z",
    "file_modification_date": "2023-12-11T02:49:44Z",
    "file_size": 2431560,
    "plain_text": "AeroBlade on the Hunt Targeting the U.S. Aerospace\nIndustry\nblogs.blackberry.com/en/2023/11/aeroblade-on-the-hunt-targeting-us-aerospace-industry\nDmitry Bestuzhev, The BlackBerry Research & Intelligence Team\n\nSummary\nBlackBerry has uncovered a previously unknown threat actor targeting an aerospace organization in\nthe United States, with the apparent goal of conducting commercial and competitive cyber espionage.\nThe BlackBerry Threat Research and Intelligence team is tracking this threat actor as AeroBlade. The\nactor used spear-phishing as a delivery mechanism: A weaponized document, sent as an email\nattachment, contains an embedded remote template injection technique and a malicious VBA macro\ncode, to deliver the next stage to the final payload execution.\nEvidence suggests that the attacker’s network infrastructure and weaponization became operational\naround September 2022. BlackBerry assesses with medium to high confidence that the offensive\nphase of the attack occurred in July 2023. The attacker improved its toolset during that time, making it\nstealthier, while the network infrastructure remained the same.\nGiven the final payload functionality and the subject of the attack, BlackBerry assesses with medium\nto high confidence that the goal of this attack was commercial cyber espionage.\n\nBrief MITRE ATT&CK® Information\nTactic\n\nTechnique\n\nInitial Access\n\nT1566.001\n\nExecution\n\nT1204.002, T1059.005, T1203, T1559.002, T1559.001, T1106,\nT1059.003\n\nDefense Evasion\n\nT1027, T1140, T1221, T1036.005, T1027.001,\n\nPersistence\n\nT1137.001, T1053.005\n\nCommand-andControl\n\nT1071.001, T1001, T1573.001, T1105\n\nExfiltration\n\nT1041, T1029\n\n1/13\n\nDiscovery\n\nT1083, T1082, T1033, T1016\n\nWeaponization and Technical Overview\nWeapons\n\nMS Office documents, PE 64\n\nAttack Vector\n\nSpear-phishing\n\nNetwork Infrastructure\n\nC2 server on port 443\n\nTargets\n\nAerospace industry in the United States\n\nTechnical Analysis\nContext\nThe BlackBerry Threat Research and Intelligence team recently uncovered two campaigns by a\npreviously unknown threat actor, which we have named AeroBlade, targeting an aerospace industry\ncompany in the U.S. We found two phases of the attack chain. The initial attack was conducted in\nSeptember 2022, and based on our technical analysis, we have concluded this was a “testing” stage.\nThe second attack occurred in July 2023.\nThere are certain similarities between both campaigns:\nBoth lure documents were named “[redacted].docx.”\nThe final payload is a reverse shell.\nThe command-and-control (C2) server IP address is the same.\nThere are also some interesting differences between the two campaigns:\nThe final payload of the 2023 attack is stealthier and uses more obfuscation and anti-analysis\ntechniques.\nThe 2023 campaign's final payload includes an option to list directories from infected victims.\nDuring an attack, a malicious Microsoft Word document called [redacted].docx is delivered via email\nspear-phishing, which, when executed manually by the user, employs a remote template injection to\ndownload a second stage file called “[redacted].dotm”. This file in turn executes \"item3.xml\", which\ncreates a reverse shell connecting to \"redacted[.]redacted[.]com\" over port 443.\n\n2/13\n\nFigure 1 — AeroBlade execution chain\n\nAttack Vector\nFirst Stage\nThe first stage of the infection is a targeted email that has a malicious document attachment with the\nfilename [redacted].docx. When opened, the document displays text in a deliberately scrambled font,\nalong with a “lure” message asking the potential victim to click it to enable the content in MS Office.\nThe docx document employs remote template injection, MITRE ATT&CK technique T1221, to\ndownload the second stage of the infection.\n\n3/13\n\nFigure 2 — The malicious document displays text in a scrambled font, along with a visual lure asking\nthe user to click it to enable content\n\nFigure 3 — The “fixed” document that appears once the victim clicks the lure message to manually\nenable content\nThe next-stage information is saved in an XML (eXtensible Markup Language) file inside a .dotm file.\nA .dotm file is a document template created by Microsoft Word, containing the default layout, settings,\nand macros for a document.\n\nFigure 4 — Next stage parameter in the OLE file\nhxxp://[redacted].106.27. [redacted]/[redacted][.]dotm\nOnce the victim opens the file and executes it by manually clicking the “Enable Content” lure\nmessage, the [redacted].dotm document discretely drops a new file to the system, and opens it. The\nnewly downloaded document is readable, leading the victim to believe that the file initially received by\nemail is legitimate. In fact, it’s a classic cyber bait-and-switch, performed invisibly right under the\nvictim’s nose.\n\n4/13\n\nFigure 5 — A second document is discretely downloaded and opened in place of the original\nmalicious document\nIt’s interesting to note that the body of the first-stage document contains an executable library that\nruns with the help of the second stage — we’ll take a closer look at this executable library a little later\non in this report.\n\nFigure 6 — Location of the executable library in the file list in the [redacted].docx document\n\nSecond Stage\nThe second stage of execution is the OLE document which contains the macro. The macro runs the\nlibrary included in the first-stage document.\n\n5/13\n\nFigure 7 — A macro that runs a malicious PE file\nThe second-stage macro also copies the OLE document ([redacted].docx) to a hard-coded file name\nat a specific path:\nC:\\Users\\user\\AppData\\Local\\Temp\\[redacted].zip\nThe final execution stage will be an executable file run on the system using the macro.\n\nPayload\nThe final payload is a DLL that acts as a reverse shell that connects to a hard-coded C2 server.\nReverse shells allow attackers to open ports to the target machines, forcing communication and\nenabling a complete takeover of the device. It is therefore a severe security threat.\nThe DLL is also capable of listing all directories found on the now-infected system. It is a heavily\nobfuscated executable which implements complex techniques, such as:\nAnti-disassembly techniques to make analysis harder\nAPI hashing to hide its usage of Windows functions; The hash function used is Murmur.\nCustom encoding for each string used\nMultiple checks are implemented to avoid the malware running on an automated environment\nsuch as a sandbox; This impedes analysis.\nFor anti-disassembly, the executable contains control flow obfuscation, usage of data between code,\nand dead code-executed instructions that do not affect the malware. Dead code is a section in the\nsource code of a program which is executed, but whose result is never used in any other computation.\nThese techniques are all added to make analysis harder for defenders.\n6/13\n\nFigure 8 — Example of data between code, control flow obfuscation, and use of dead code\n\nFigure 9 — Usage of evil byte, a common technique to defeat the way disassembler tools work\n\nFigure 10 — Fixed evil byte showing real code execution\nThe executable also implements techniques that causes the malware to skip execution on automated\nsystems, such as sandboxes or antivirus (AV) emulators. These techniques include:\nComparing the position of the mouse cursor using the GetCursorPos() function\nComparing time elapsed on execution using the function GetTickCount()\nChecking to see if the number of processors is less than two, using the NumberOfProcessors\nfrom the Process Environment Block (PEB) structure\nChecking physical memory size using the function GlobalMemoryStatusEx()\n\nFigure 11 — Checking number of processors used by the victim’s machine\n\n7/13\n\nFigure 12 — Checking available physical memory on the victim’s machine\nAfter passing all those checks, the malicious DLL executes the following sequence:\nDecrypts embedded static configuration containing the C2 server information for it to connect to\nCollects system information from the infected machine\nSets persistence to survive upon system reboot\nFinally, it connects to the C2 server, transmitting all its collected information, and spawning a\nreverse shell, while also sending a list of directories found on the infected system.\n\nFigure 13 — Static configuration\nStatic configuration is AES encrypted, and once decrypted, contains the following structure:\nFirst DWORD: 0x154, unknown usage, static config size is hard-coded at 72 bytes\nSecond DWORD: 0x1BB, connects to TCP port 443\n16-byte string “Pa$$w0rd” seems to be a password to connect to the C2, but it is not used in\npractice\nC2 server points to: redacted[.]redacted[.]com\n\n8/13\n\nFigure 14 — Example of information collected from infected system\nBot-collected data structure is as follows:\nOffset 0x3: hard-coded unknown 16 bytes computed by custom unknown encode functions\nOffset 0x13: username using function GetUserNameA()\nOffset 0x43: computer name using function GetComputerNameA()\nOffset 0x73: file name being executed using function GetModuleFileNameA()\nOffset 0x178: IPV4 addresses using function GetAdaptersInfo()\nOffset0x1b8: MAC addresses using function GetAdaptersInfo()\nPersistence is achieved via Windows Task Scheduler, where a task named “WinUpdate2” is created\nto run every day at 10:10 AM. Task Scheduler functions are abused by using its COM object via the\nCoCreateInstance() function.\n\n9/13\n\nFigure 15 — Persistence is established through Windows Task Scheduler\n\nReverse Shell\nFinally, the reverse shell is executed in a stealthy way. First, it gets the default standard handle by\ncalling GetStdHandle(), then the ComSpec variable is retrieved using the GetEnvironmentVariableW()\nfunction, which by default is set to “C:\\Windows\\system32\\cmd.exe”. After that, a pipe is created\nusing CreatePipe(), and CreateProcessW() is executed, creating “cmd.exe.”\n\nFigure 16 — cmd.exe CreateProcess\nBesides the reverse shell, the final payload can collect a complete list of directories on the victim’s\nsystem by using the function GetLogicalDeviceStringsW(), looping through the list of files using\nFindFirstFileA()/FindNextFileA(), and then comparing with “..” to see if a given file is actually a\ndirectory.\n\nFigure 17 — String comparison with directories\nDuring our investigations, we found two samples from mid-2022: \"5[redacted sha-256]7\" and\n\"5[redacted sha-256]8\", which is also a reverse shell with a hard-coded C2 at \"[redacted][.]165\" —\nthe same IP address that the C2 server from the 2023 samples are pointing to. Both samples were\n\n10/13\n\ntargeting the aerospace industry.\nWhile the 2022 samples are obfuscated, unlike the 2023 samples, they do not contain stealthier\nfunctions such as API hashing, anti-analysis techniques, or encrypted static configuration. They also\ndon’t include the capability to list directories, nor are they able to send information to a remote server.\n\nNetwork Infrastructure\nIP\n\nDomain Name\n\n[redacted].217\n\nhxxp://[redacted].217/[redacted][.]dotm\nhxxp://[redacted].217/[redacted]\n\n[redacted].195\n\nredacted.redacted.com\n\n[redacted].165\n\nredacted.redacted.com\n\nTargets and Attribution\nBased on the content of the lure message, an aerospace company in the United States was the\nintended target for both campaigns.\nThe development of this threat group's toolkit indicates that the operator has been active for at least\none year. Exactly who is behind these two campaigns remains unknown.\n\nConclusions\nGiven the relatively sophisticated technical capabilities this threat actor deployed and the victim's\ntimelines, we conclude with a high degree of confidence that this was a commercial cyberespionage\ncampaign. Its purpose was most likely to gain visibility over the internal resources of its target in order\nto weigh its susceptibility to a future ransom demand.\nBased on the threat actor’s operations timelines — September 2022 and then July 2023 — we can\nsurmise that this shows the group’s interest in the target remained consistent between the first and\nsecond campaign, as evidenced by the increased complexity of the second campaign compared to\nthe first. During the time that elapsed between the two campaigns we observed, the threat actor put\nconsiderable effort into developing additional resources to ensure they could secure access to the\nsought-after information, and that they could exfiltrate it successfully.\n\nAPPENDIX 1 – Referential Indicators of Compromise (IoCs)\n\n11/13\n\nSecond\nStage\nSha 265\nMD5\nSha 265\nMD5\n\n16bd34c3f00288e46d8e3fdb67916aa7c68d8a0622f2c76c57112dae36c76875\n885B04081BD89F5E23CBC59723052601\n6d515dafef42a5648754de3c0fa6adfcb8b57af1c1d69e629b0d840dab7f91ec\n62D3FF36EC8A721488E512E1C94B2744\nabc348d3cc40521afc165aa6dc2d66fd9e654d91e3d66461724ac9490030697f\nA04D2C0AA0A798047161118B5D5816AA\n\nSha 256\nMD5\n\nDisclaimer: The private version of this report is available upon request. It includes but is not limited\nto, the complete and contextual MITRE ATT&CK® mapping, MITRE D3FEND™ countermeasures,\nAttack Flow by MITRE, and other threat detection content for tooling, network traffic, complete IoCs\nlist, Yara rules, Sigma rules, and system behavior. Please email us at cti@blackberry.com for more\ninformation.\nFor similar articles and news delivered straight to your inbox, subscribe to the BlackBerry Blog.\nRelated Reading\n\nAbout Dmitry Bestuzhev\nDmitry Bestuzhev is Senior Director, CTI (Cyber Threat Intelligence) at BlackBerry.\nPrior to BlackBerry, Dmitry was Head of Kaspersky's Global Research and Analysis Team for Latin\nAmerica, where he oversaw the company's experts' anti-malware development work in the region.\nDmitry has more than 20 years of experience in IT security across a wide variety of roles. His field of\nexpertise covers everything from traditional online fraud to targeted high-profile attacks on financial\nand governmental institutions. His main focus in research is on producing Threat Intelligence reports\non financially motivated targeted attacks.\n\n12/13\n\nAbout The BlackBerry Research & Intelligence Team\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats, providing\nintelligence analysis for the benefit of defenders and the organizations they serve.\n\n13/13",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/d4eigscymt12dg8lsnevf48duihx5bwz"
    ],
    "report_names": [
        "Blackberry_AeroBlade-Targeting-US-Aerospace-Industry(11-30-2023)"
    ],
    "threat_actors": [
        {
            "id": "b2d90939-4491-40e6-9ba1-7f97f6908af9",
            "created_at": "2024-01-18T02:02:33.896267Z",
            "updated_at": "2024-11-22T02:02:00.931137Z",
            "deleted_at": null,
            "main_name": "AeroBlade",
            "aliases": [],
            "source_name": "ETDA:AeroBlade",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e7501832-edc8-4dff-a979-17cdc3091f82",
            "created_at": "2023-12-08T02:00:05.738096Z",
            "updated_at": "2024-11-22T02:00:02.937322Z",
            "deleted_at": null,
            "main_name": "AeroBlade",
            "aliases": [],
            "source_name": "MISPGALAXY:AeroBlade",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1702346782195,
    "ts_updated_at": 1732241018757,
    "ts_creation_date": 1702262984000,
    "ts_modification_date": 1702262984000,
    "files": {
        "pdf": "https://archive.orkl.eu/ef854d3ab06b7acc16e2ab04a760468966d07805.pdf",
        "text": "https://archive.orkl.eu/ef854d3ab06b7acc16e2ab04a760468966d07805.txt",
        "img": "https://archive.orkl.eu/ef854d3ab06b7acc16e2ab04a760468966d07805.jpg"
    }
}