{
    "id": "d47a0e37-f5e2-4001-af12-6a08784ebd2f",
    "created_at": "2023-06-05T02:07:50.495492Z",
    "updated_at": "2024-11-22T02:03:44.467855Z",
    "deleted_at": null,
    "sha1_hash": "9994826c3d41466838248d2b71bee4116dc835d4",
    "title": "2023-02-16 - WIP26 Espionage - Threat Actors Abuse Cloud Infrastructure in Targeted Telco Attacks",
    "authors": "",
    "file_creation_date": "2023-06-04T12:56:09Z",
    "file_modification_date": "2023-06-04T12:56:09Z",
    "file_size": 899705,
    "plain_text": "WIP26 Espionage | Threat Actors Abuse Cloud\nInfrastructure in Targeted Telco Attacks\nsentinelone.com/labs/wip26-espionage-threat-actors-abuse-cloud-infrastructure-in-targeted-telco-attacks/\nAleksandar Milenkoski\n\nBy Aleksandar Milenkoski, Collin Farr, and Joey Chen, in collaboration with QGroup\n\nExecutive Summary\nA new threat cluster we track as WIP26 has been targeting telecommunication\nproviders in the Middle East.\nWe assess it is likely that WIP26 is espionage-related.\nWIP26 relies heavily on public Cloud infrastructure in an attempt to evade detection by\nmaking malicious traffic look legitimate.\nWIP26 involves the use of backdoors, dubbed CMD365 and CMDEmber, which abuse\nMicrosoft 365 Mail and Google Firebase services for C2 purposes.\nWIP26 also involves the use of Microsoft Azure and Dropbox instances as data\nexfiltration and malware hosting sites.\n\nOverview\nIn collaboration with QGroup GmbH, SentinelLabs is monitoring a threat activity we track as\nWIP26. The threat actor behind WIP26 has been targeting telecommunication providers in\nthe Middle East. WIP26 is characterized by the abuse of public Cloud infrastructure –\nMicrosoft 365 Mail, Microsoft Azure, Google Firebase, and Dropbox – for malware delivery,\ndata exfiltration, and C2 purposes.\nThe WIP26 activity is initiated by precision targeting of employees through WhatsApp\nmessages that contain Dropbox links to a malware loader. Tricking employees into\ndownloading and executing the loader ultimately leads to the deployment of backdoors that\nleverage Microsoft 365 Mail and Google Firebase instances as C2 servers. We refer to these\nbackdoors as CMD365 and CMDEmber, respectively. The main functionality of CMD365 and\nCMDEmber is to execute attacker-provided system commands using the Windows command\ninterpreter.\nThe use of public Cloud infrastructure for C2 purposes is an attempt to make malicious C2\nnetwork traffic look legitimate and therefore make detection harder for defenders. The\nCMD365 and CMDEmber samples we observed masquerade as utility software, such as a\nPDF editor or browser, and as software that conducts update operations. The masquerading\nattempt involves the use of filenames, application icons, and digital signatures that indicate\nexisting software vendors.\n1/13\n\nThis report provides details on the WIP26 threat activity and further context around the use\nof CMD365 and CMDEmber.\n\nIntrusion Vector and Activities\nThe initial intrusion vector succeeded through sending targeted WhatsApp messages to\nemployees. The messages contained Dropbox links to archive files that supposedly contain\nonly documents on poverty issues in the Middle East. The archives stored such documents,\nbut also a malware loader (PDFelement.exe) masquerading as the PDFelement application.\nThe PDFelement.exe malware loader has an invalid digital signature that indicates the\nvendor of the PDFelement application – Wondershare.\n\nThe digital signature of\n\nPDFelement.exe\nThe loader deploys the CMD365 backdoor, a .NET executable named Update.exe, and\ncreates a scheduled task named MicrosoftUpdatesA that executes CMD365 at system\nstartup for persistence.\n\n2/13\n\nThe MicrosoftUpdatesA scheduled task\nThe main functionality of CMD365 is to execute commands from a C2 hosted on a Microsoft\n365 Mail instance. This capability was used to conduct a variety of activities, such as\nreconnaissance, privilege escalation, staging of additional malware, and data exfiltration.\nAmong the malware deployed on compromised machines, we observed another CMD365\nsample in addition to the Update.exe – EdgeUpdater.exe. Further, we observed CMDEmber\nsamples, which use Google Firebase Realtime Database instances as C2 servers – .NET\nexecutables named Update.exe and Launcher.exe.\nThe exfiltrated data included users’ private browser data and reconnaissance information on\nparticular high-value hosts in the victim’s network. This is a typical precursor to the\nsubsequent targeting of these hosts. The data exfiltration was orchestrated through the\nexecution of PowerShell commands to transport key data to Microsoft Azure instances. The\nthreat actor behind WIP26 used the Windows Azure website\nsocialmsdnmicrosoft.azurewebsites[.]net as a malware hosting site and\nakam.azurewebsites[.]net as a data exfiltration site.\nIn addition to exfiltration, the threat actor utilized the open source tool Chisel masquerading\nas the Media Player Classic application with an invalid certificate signed as “Rare Ideas\nLLC”. This was used to create a TCP tunnel over HTTP from the IP address\n193.29.56[.]122, an IP that has previously been associated with Cobalt Strike activity. This\nwas the first and only direct access attempt that was not from Microsoft 365 Mail or Google\nFirebase instances.\nThe figure below gives an overview of the Cloud infrastructure the threat actor behind WIP26\nused for initial infection and as C2 servers, and exfiltration and malware hosting sites. We\ninformed Google, Microsoft, and Dropbox about the abuse of their infrastructure.\n\n3/13\n\nWIP26: Use of Cloud infrastructure\n\nCMD365: Abuse Of Microsoft 365 Mail\nCMD365 interacts using the Microsoft Graph API with a Microsoft 365 Mail inbox that has the\nrole of a C2 server. An open-source implementation of Graph API usage for C2\ncommunication is the Azure Outlook C2 tool.\n\n4/13\n\nThe CMD365 sample Update.exe is a .NET application that masquerades as the legitimate\nPostman application, signed with an invalid signature.\n\nThe digital signature of Update.exe\n\nThe core feature of CMD365 is to execute attacker-provided system commands as standard\ninput to an instance of the Windows command interpreter.\n\nCMD365\n\nexecutes a command\nCMD365 issues an HTTP POST request to login.microsoftonline[.]com to authenticate\nitself to a Microsoft 365 Mail inbox using valid credentials that are hardcoded in the malware.\nThe malware then receives an OAuth Bearer access token that it uses in the further\ninteraction with Microsoft 365.\n\n5/13\n\nCMD365 authenticates at Microsoft 365 Mail\nCMD365 then creates an inbox folder with a name that is unique for each infected machine.\nThe name is a combination of the physical address of the main active network interface on\nthe machine, the machine’s computer name, and the name of the user in whose context the\nmalware executes. CMD365 collects this information when it starts executing.\n\n6/13\n\nCMD365 builds a machine-specific inbox folder name\n\nCMD365 creates an inbox folder\nCMD365 polls the inbox folder for C2 commands by querying for emails whose subjects start\nwith the keyword Input. These emails contain C2 input intended for processing by CMD365\non infected machines.\n\nCMD365 polls for C2 commands\nThe C2 server and CMD365 exchange encrypted and Base64-encoded data. For data\nencryption and decryption, the malware uses the AES key Xc4u7x!A%D*GKaPdSr56tp2s5v8y/B? (in string format) and an empty initialization vector (IV).\n7/13\n\nCMD365 encrypts data\n\nCMDEmber: Abuse Of Google Firebase\nCMDEmber interacts with a Google Firebase Realtime Database instance that has the role\nof a C2 server. The CMDEmber sample Launcher.exe is a .NET application that\nmasquerades as the Opera browser and has an invalid signature that indicates the Opera\nNorway software vendor. CMDEmber uses the open-source Firebase library by Step Up\nLabs for communicating with the Google Firebase instances.\n\n8/13\n\nThe digital signature of\n\nLauncher.exe\nAs with CMD365, the core feature of CMDEmber is to execute system commands using the\nWindows command interpreter.\nWhen executed, CMDEmber connects to the Firebase instance https://gmall-52fb5default-rtdb.asia-southeast1.firebasedatabase[.]app/ or https://go0gle-servicedefault-rtdb.firebaseio[.]com, and then exfiltrates information about the infected\nmachine. The exfiltrated data includes some of the information that the CMDEmber collects –\nthe computer name, the bitness, name, and ID of the CMDEmber process, the name of the\nuser in whose context CMDEmber executes, and the IPv4 and physical addresses of all\noperational network interfaces on the infected machine.\nCMDEmber uses the MD5 hash of the Triple DES key\nMgirdhgi256HIKnuefsdf!dfgsdfkjsrht (in string format) to encrypt and decrypt the Base64\ndata exchanged with the C2.\nCMDEmber sends and receives data from the C2 server by issuing HTTP POST and GET\nrequests, respectively. The URL paths of these requests contain a unique identifier of each\ninfected machine, which is a combination of the ID and bitness of the CMDEmber process,\nand the physical addresses of the operational network interfaces at the victim machine.\n\n9/13\n\nCMDEmber exfiltrates machine information\nAfter exfiltrating information about the infected machine, CMDEmber polls the Firebase\ninstance for C2 commands by issuing HTTP GET requests that include the identifier of the\ninfected machine.\n\nCMDEmber polls for C2 commands\nThe data that the C2 server and CMDEmber exchange is in JSON format. The Firebase C2\nserver stores exchanged data with all infected machines in a JSON-formatted file such that\nthe nodes are the unique identifiers of the machines:\nThe who field indicates the communication direction. The value server marks data sent\nfrom the C2 server to an infected machine, whereas the value client marks data sent\nin the opposite direction.\nThe field data stores the actual data: attacker-provided commands, command outputs,\nor the information that CMDEmber exfiltrates from infected machines.\n\nExfiltrated machine\n\ninformation (obfuscated form)\n10/13\n\nCommand sent to an infected machine (deobfuscated form)\n\nCommand output from the infected machine (deobfuscated form)\n\nAttribution Analysis\nWe assess it is likely this activity is espionage-related. We track this activity as WIP26 – the\nWork-In-Progress (WIPxx) designation is used for unattributed activity clusters.\nThe initial intrusion vector we observed involved precision targeting: The threat actor sent\nWhatsApp messages to targets with download links to backdoor malware. Further, the\ntargeting of telecommunication providers in the Middle East suggests the motive behind this\nactivity is espionage-related. Communication providers are frequent targets of espionage\n\n11/13\n\nactivity due to the sensitive data they hold. Finally, evidence suggests that once they\nestablished a foothold, the threat actor targeted users’ private information and specific\nnetworked hosts of high value.\nThe threat actor behind WIP26 activity appears to have made some OPSEC errors. For\nexample, the JSON file where the Google Firebase C2 server stores data exchanged with\nmachines infected by CMDEmber is publicly accessible at the time of writing, providing\nfurther insights into the WIP26 activity.\nThe use of public Cloud infrastructure by APT groups is not unheard of. These threat actors\ncontinue to innovate in order to stay stealthy. This includes leveraging public Cloud\ninfrastructure for C2 purposes to blend in and make the detection of C2 traffic harder for\ndefenders.\nFor example, the North Korean APT 37 (InkySquid) has used the Microsoft Graph API for C2\noperations. Further, similar to CMD365, the SIESTAGRAPH backdoor, used in the REF2924\nintrusion set targeting the Foreign Affairs Office of an ASEAN member, leverages the\nMicrosoft Graph API to access Microsoft 365 Mail for C2 communication. Also, the DoNot\nthreat group, which is known for targeting Kashmiri non-profit organizations and Pakistani\ngovernment officials, has abused Google Firebase Cloud Messaging to stage malware.\nFinally, threat activity tied to APT28 (Fancy Bear) has leveraged Microsoft OneDrive services\nfor C2 purposes.\n\nConclusions\nThe WIP26 activity is a relevant example of threat actors continuously innovating their TTPs\nin an attempt to stay stealthy and circumvent defenses. The use of public Cloud\ninfrastructure for malware hosting, data exfiltration, and C2 purposes aims at making\nmalicious traffic look legitimate. This gives attackers the opportunity to conduct their activities\nunnoticed. We hope that this report helps to emphasize this tactic in the continuous effort to\nidentify threat groups engaged in targeting critical industries.\nSentinelLabs continues to track the WIP26 threat cluster to provide further insight into its\nevolution, future activity, and attribution.\n\nIndicators of Compromise\nType\n\nValue\n\nNote\n\nSHA-1\n\nB8313A185528F7D4F62853A44B64C29621627AE7\n\nThe PDFelement.exe\nmalware loader\n\nSHA-1\n\n8B95902B2C444BCDCCB8A481159612777F82BAD1\n\nCMD365 sample\n(Update.exe)\n12/13\n\nSHA-1\n\n3E10A3A2BE17DCF8E79E658F7443F6C3C51F8803\n\nCMD365 sample\n(EdgeUpdater.exe)\n\nSHA-1\n\nA7BD58C86CF6E7436CECE692DA8F78CEB7BA56A0\n\nCMDEmber sample\n(Launcher.exe)\n\nSHA-1\n\n6B5F7659CE48FF48F6F276DC532CD458BF15164C\n\nCMDEmber sample\n(Update.exe)\n\nDomain\n\nhttps://gmall-52fb5-default-rtdb.asiasoutheast1.firebasedatabase[.]app/\n\nGoogle Firebase\ninstance used for C2\npurposes\n\nDomain\n\nhttps://go0gle-service-default-rtdb.firebaseio[.]com/\n\nGoogle Firebase\ninstance used for C2\npurposes\n\nURL\n\nhttps://graph.microsoft[.]com/beta/users/3517e8166719-4b16-9b40-63cc779da77c/mailFolders\n\nMicrosoft 365 Mail\nlocation used for C2\npurposes\n\nURL\n\nhttps://www.dropbox[.]com/s/6a8u8wlpvv73fe4/\n\nDropbox malware\nhosting site\n\nURL\n\nhttps://www.dropbox[.]com/s/hbc5yz8z116zbi9/\n\nDropbox malware\nhosting site\n\nURL\n\nhttps://socialmsdnmicrosoft.azurewebsites[.]net/AAA/\n\nMicrosoft Azure\nmalware hosting site\n\nURL\n\nhttps://socialmsdnmicrosoft.azurewebsites[.]net/ABB/\n\nMicrosoft Azure\nmalware hosting site\n\nURL\n\nhttps://socialmsdnmicrosoft.azurewebsites[.]net/ABB/\n\nMicrosoft Azure\nmalware hosting site\n\nURL\n\nhttps://socialmsdnmicrosoft.azurewebsites[.]net/AMA/\n\nMicrosoft Azure\nmalware hosting site\n\nURL\n\nhttps://socialmsdnmicrosoft.azurewebsites[.]net/AS/\n\nMicrosoft Azure\nmalware hosting site\n\nURL\n\nhttps://akam.azurewebsites[.]net/api/File/Upload\n\nMicrosoft Azure data\nexfiltration site\n\nIP\naddress\n\n193.29.56[.]122\n\nChisel C2 server\n\n13/13",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-16 - WIP26 Espionage - Threat Actors Abuse Cloud Infrastructure in Targeted Telco Attacks.pdf"
    ],
    "report_names": [
        "2023-02-16 - WIP26 Espionage - Threat Actors Abuse Cloud Infrastructure in Targeted Telco Attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2024-11-22T02:00:02.53387Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Group",
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "521f07f0-a313-4ce7-9a1c-3c81b74e82d9",
            "created_at": "2023-02-18T02:04:24.772216Z",
            "updated_at": "2024-11-22T02:02:01.243244Z",
            "deleted_at": null,
            "main_name": "WIP26",
            "aliases": [],
            "source_name": "ETDA:WIP26",
            "tools": [
                "CMD365",
                "CMDEmber"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dbee5a02-e2d6-49d2-9bb5-5a9e93fd1de9",
            "created_at": "2023-11-07T02:00:07.108976Z",
            "updated_at": "2024-11-22T02:00:02.851164Z",
            "deleted_at": null,
            "main_name": "REF2924",
            "aliases": [],
            "source_name": "MISPGALAXY:REF2924",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2024-11-22T02:00:52.337241Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2024-11-22T02:00:02.573104Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "Operation Erebus",
                "Operation Daybreak",
                "Group123",
                "Reaper Group",
                "Ricochet Chollima",
                "G0067",
                "Group 123",
                "ScarCruft",
                "Venus 121",
                "APT 37",
                "Red Eyes",
                "ATK4",
                "Moldy Pisces",
                "TA-RedAnt",
                "InkySquid"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2024-11-22T02:02:53.09478Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2024-11-22T02:00:02.469031Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "Pawn Storm",
                "Sednit",
                "IRON TWILIGHT",
                "TA422",
                "T-APT-12",
                "Fighting Ursa",
                "ITG05",
                "UAC-0028",
                "FANCY BEAR",
                "SNAKEMACKEREL",
                "Tsar Team",
                "Group 74",
                "G0007",
                "BlueDelta",
                "Fancy Bear",
                "Sofacy",
                "TG-4127",
                "STRONTIUM",
                "Grizzly Steppe",
                "ATK5",
                "FROZENLAKE",
                "SIG40",
                "Blue Athena",
                "APT-C-20",
                "Forest Blizzard"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2024-11-22T02:00:52.392704Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2024-11-22T02:02:01.181291Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2024-11-22T02:02:01.154803Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1685930870495,
    "ts_updated_at": 1732241024467,
    "ts_creation_date": 1685883369000,
    "ts_modification_date": 1685883369000,
    "files": {
        "pdf": "https://archive.orkl.eu/9994826c3d41466838248d2b71bee4116dc835d4.pdf",
        "text": "https://archive.orkl.eu/9994826c3d41466838248d2b71bee4116dc835d4.txt",
        "img": "https://archive.orkl.eu/9994826c3d41466838248d2b71bee4116dc835d4.jpg"
    }
}