{
    "id": "6b189d4a-3dca-40ca-b960-f26863dccdd9",
    "created_at": "2024-07-26T02:05:41.433716Z",
    "updated_at": "2024-11-22T02:03:18.964468Z",
    "deleted_at": null,
    "sha1_hash": "b9da9325aa7d7e8f3042b12b046c04aa2b4f7842",
    "title": "Arid Viper poisons Android apps with AridSpy",
    "authors": "",
    "file_creation_date": "2024-07-25T13:58:51Z",
    "file_modification_date": "2024-07-25T13:58:51Z",
    "file_size": 2871456,
    "plain_text": "ESET RESEARCH\n\nArid Viper poisons Android apps with\nAridSpy\nESET researchers discovered Arid Viper espionage campaigns spreading trojanized apps to Android users\nin Egypt and Palestine\nLukas Stefanko\n\n13 Jun 2024 • 25 min. read\n\nESET researchers have identified five campaigns targeting Android users with trojanized apps. Most probably\ncarried out by the Arid Viper APT group, these campaigns started in 2022 and three of them are still ongoing at the\ntime of the publication of this blogpost. They deploy multistage Android spyware, which we named AridSpy, that\ndownloads first- and second-stage payloads from its C&C server to assist it avoiding detection. The malware is\ndistributed through dedicated websites impersonating various messaging apps, a job opportunity app, and a\nPalestinian Civil Registry app. Often these are existing applications that had been trojanized by the addition of\nAridSpy’s malicious code.\n\nKey points of the blogpost:\nESET Research discovered three-stage Android malware, which we named AridSpy, being distributed via five\ndedicated websites.\nAridSpy’s code is in some cases bundled into applications that provide legitimate functionality.\nWhile the first stage of AridSpy has been documented previously, here we also provide a full analysis of its\npreviously unknown later stages.\nAridSpy is a remotely controlled trojan that focuses on user data espionage.\nWe detected six occurrences of AridSpy, in Palestine and Egypt.\nWe attribute AridSpy with medium confidence to the Arid Viper APT group.\n\nArid Viper, also known as APT-C-23, Desert Falcons, or Two-tailed Scorpion, is a cyberespionage group that has\nbeen active since at least 2013. Known for targeting countries in the Middle East, the group has drawn attention\nover the years for its vast arsenal of malware for Android, iOS, and Windows platforms. We reported on the group\nand its then-newest spyware in a previous blogpost.\n\nOverview\nESET Research identified five Arid Viper campaigns targeting Android users. These campaigns delivered malware\nvia dedicated websites from which victims could download and manually install an Android application. Three\napps provided on these websites are legitimate apps trojanized with malicious code that we named AridSpy, whose\npurpose is espionage. You can see the overview scheme in Figure 1.\n\nFigure 1. Infiltration overview\n\nAridSpy was first analyzed by Zimperium in 2021; at the time, the malware only consisted of a single stage, with\nall the malicious code implemented in the trojanized application.\nThe second occurrence of AridSpy that ESET Research identified was being used in 2022 (and later analyzed by\n360 Beacon Labs in December 2022), where the malware operators targeted the FIFA World Cup in Qatar.\nImpersonating one of the many Kora applications, the campaign deployed the Kora442 app bundled with AridSpy.\nAs in the case of the sample analyzed by Zimperium, the malware still only had one stage at this time.\nIn March 2023, 360 Beacon Labs analyzed another Android campaign operated by Arid Viper and found a\nconnection between the Kora442 campaign and the Arid Viper group, based on use of the myScript.js file\nmentioned in Figure 1. We found the same connection in the campaigns discussed in this blogpost (as explained in\nthe Attribution section) It has proven to be a useful indicator to identify additional Arid Viper distribution\n\nthe Attribution section). It has proven to be a useful indicator to identify additional Arid Viper distribution\nwebsites.\nIn August 2023 we logged a detection of AridSpy in our telemetry and investigated further. We identified targets in\nPalestine and Egypt. New in these campaigns, AridSpy was turned into a multistage trojan, with additional\npayloads being downloaded from the C&C server by the initial, trojanized app.\nAt the time of this publication, three out of the five discovered campaigns are still active; the campaigns used\ndedicated websites to distribute malicious apps impersonating NortirChat, LapizaChat, and ReblyChat, and the\n‫( تطبيق املشغل‬machine translation: Operator application; we will refer to this as the job opportunity app) and ‫السجل‬\n‫( املدني الفلسطيني‬machine translation: Palestinian Civil Registry) apps. We discovered the following distribution\nwebsites via our telemetry, VirusTotal, and pivoting on the shared myScript.js script using the FOFA network\nsearch engine (which is an alternative to Shodan and Censys):\n\nlapizachat[.]com\nreblychat[.]com\nnortirchats[.]com\npariberychat[.]com (inactive)\nrenatchat[.]com (inactive)\n\nParallel to our investigation, the FOFA research team published a blogpost that discusses discovering seven\ndistribution websites with the myScript.js JavaScript file responsible for retrieving the download paths for\nArid Viper payloads. Four of these websites distributed various versions of AridSpy. The following two were\npreviously unknown to us:\n\nclemochat[.]com\nvoevanil[.]com\n\nIn this blogpost, we focus on AridSpy payloads that we could obtain from all the confirmed active distribution\nwebsites listed above.\nNote that these malicious apps have never been offered through Google Play and are downloaded from third-party\nsites. To install these apps, the potential victim is requested to enable the non-default Android option to install apps\nfrom unknown sources.\n\nVictimology\nAltogether we detected six occurrences of AridSpy in our telemetry, from Palestine and Egypt. The majority of the\nspyware instances registered in Palestine were for the malicious Palestinian Civil Registry app, with one other\n\ndetection not being part of any campaign mentioned in this blogpost. We then found the same first-stage payload\nbut with a different package name in Egypt. There was also another first-stage payload detected in Egypt, one that\nuses the same C&C servers as the samples in the LapizaChat and job opportunity campaigns.\n\nAttribution\nWe attribute AridSpy to Arid Viper with medium confidence, based on these indicators:\n\nAridSpy targeted organizations in Palestine and Egypt, which fits a subset of Arid Viper’s typical targeting.\nMultiple AridSpy distribution websites use a unique, malicious JavaScript file named myScript.js, which has been\npreviously linked to Arid Viper by 360 Beacon Labs and FOFA.\n\nmyScript.js was first discovered and linked to Arid Viper in 360 Beacon Labs’ March 30th, 2023 analysis of a\ndifferent Android campaign operated by Arid Viper. The (unnamed) malicious Android code used in that campaign\nwas previously attributed to the Arid Viper group. myScript.js was found on one of the distribution websites\nused in the campaign. The purpose of this JavaScript code was to download a malicious Android app hosted on the\ndistribution server.\nFigure 2 shows the part of the code that registers the handler for clicks on the website’s Download button, and\nFigure 3 displays JavaScript code that generates file paths to download the malicious app.\n\nFigure 2. Registration of a click event handler for the Download button\n\nFigure 3. JavaScript code responsible for downloading the malicious app\n\nAs pointed out by 360 Beacon Labs, this same JavaScript code was also used in the campaign that targeted the\nFIFA World Cup in Qatar with an earlier version of AridSpy, which we reported in 2022. In both campaigns, the\ndistribution websites used this specific myScript.js script to retrieve a malicious app from a server, although\nthe final payload was different.\nFinally, we found a very similar piece of JavaScript on the distribution websites for the campaigns discussed in\nthis blogpost, distributing NortirChat, LapizaChat, and ReblyChat. During our investigation, this linkage was\nindependently confirmed by the research team of the FOFA search engine, who found seven of the same\ndistribution websites that contained the myScript.js responsible for downloading Android AridSpy,\nand attributed this malware to Arid Viper.\nWe have not been able to link the JavaScript code used in these campaigns to any legitimate or open-source\nproject, which leads us to believe that this script is most likely specific to various Arid Viper campaigns\ndistributing Android malware.\nIt is possible that Arid Viper reused this distribution method, but switched to a new tool, AridSpy, for its new\ncampaigns, since the (unnamed) malware family the group used before was disclosed and analyzed by various\nresearchers and security companies.\nInterestingly, we also discovered a different version of myScript.js on the AridSpy distribution site,\nmasquerading as a Palestinian Civil Registry app. In this case, the script had the same purpose but not the same\nJavaScript code: instead of downloading AridSpy, this script just returned a hardcoded link to AridSpy.\nThis version of the script is based on a script available online, contrary to the earlier versions that appear to use a\ncustom-developed myScript.js file. When the earlier versions of myScript.js were disclosed and\nattributed to Arid Viper, the threat actors most likely changed its code to avoid their new code being connected to\nthe group.\n\nTechnical analysis\nInitial access\nThe distribution mechanism is very similar for all campaigns mentioned in this section. In order to gain initial\naccess to the device, the threat actors try to convince their potential victim to install a fake, but functional, app.\nOnce the target clicks the site’s Download button, myScript.js, hosted on the same server, is executed to\ngenerate the correct download file path for the malicious AridSpy. This script makes an AJAX request\nto api.php located on the same server and returns a specific file directory and name.\n\nTrojanized messaging applications\nStarting chronologically, we will first look at the campaign posing as LapizaChat, a malicious Android application\nthat was available for download from the dedicated lapizachat[.]com website. This website was registered\non January 16th, 2022 and is no longer active. Its interface can be seen in Figure 4.\n\nFigure 4. LapizaChat website\n\nIn an open directory on the server, there was not one, but actually three LapizaChat Android apps, stored in\ndifferent directories. One of the apps was a copy of the legitimate StealthChat: Private Messaging app and had no\nmalicious functionality. It contained the same legitimate messaging code as StealthChat, but with different\napplication icon, name, and package name. This app has been available on the distribution website since January\n18th, 2022.\nThe other two apps were trojanized versions of StealthChat: Private Messaging bundled with AridSpy’s malicious\ncode. Based on the last modification date, they were available on the server since July 5th, 2023 and September\n18th, 2023 respectively, based on the last modification date. The two malicious apps are very similar to each other;\nthe latter sample contains the same malicious code, with only minor, insignificant changes. It was this version that\nthe victim would download from the website after clicking the Download Now button. Filenames, last\nmodification dates, and hashes are listed in Table 1.\nTable 1. Samples available on lapizachat[.]com website\n\nFilename\n\nLast modified\n\nSHA-1\n\nDescription\n\nLapizaChat.apk\n\n2022‑01‑18\n\nD99D9689A7C893AFCE84\n04D273D6BA31446C998D\n\nThe legitimate StealthChat: Private\nMessaging application, version 1.8.42\n(6008042).\n\nLapizaChat_old.apk\n\n2023‑07‑05\n\n3485A0A51C6DAE251CDA\nD20B2F659B3815212162\nStealthChat trojanized with AridSpy,\ndistributed under the name LapizaChat.\n\nLapizaChat.apk\n\n2023‑09‑18\n\nF49B00896C99EA030DCC\nA0808B87E414BBDE1549\n\nWe identified two other campaigns that started distributing AridSpy after LapizaChat, this time posing as\nmessaging apps named NortirChat and ReblyChat. They were distributed (after clicking on the Download button)\n\nvia the websites nortirchats[.]com, registered on September 21st, 2022, and reblychat[.]com,\nregistered on April 30th, 2023; see Figure 5.\n\nFigure 5. NortirChat (left) and ReblyChat (right) distribution websites\n\nSimilar to the previous case, we were able to retrieve additional samples from open directories, including both the\nclean and trojanized versions of the messaging applications. NortirChat is based on the\nlegitimate Session messaging app, while ReblyChat is based on the legitimate Voxer Walkie Talkie Messenger. In\nboth cases, the trojanized applications have the same code but the malware developers changed the application\nicon, name, and package name. Table 2 and Table 3 list details of the applications retrieved from these servers.\nTable 2. Samples available on nortirchats[.]com website\n\nFilename\n\nLast modified\n\nSHA-1\n\nDescription\n\nNortirChat_old.apk\n\n2022‑09‑28\n\n13A89D28535FC1D53794\n6D7D017DA02671227924\nThe legitimate Session messaging app,\nversion 1.16.5 (3331).\n\nNortirChat.apk\n\n2023‑03‑19\n\n1878F674F59E81E86986\n0EB9A2269046DF5CE855\n\nNortirChat_old.apk\n\n2023‑06‑14\n\n2158D88BCE6368FAC3FC\nB7F3A508FE6B96B0CF8A\nSession app trojanized with AridSpy,\ndistributed under the name NortirChat.\n\nNortirChat.apk\n\n2023‑09‑11\n\nDB6B6326B772257FDDCB\n4BE7CF1A0CC0322387D8\n\nTable 3. Samples available on reblychat[.]com website\n\nFilename\n\nLast modified\n\nSHA-1\n\nDescription\n\nreblychat.apk\n\n2023‑06‑08\n\nFFDD0E387EB3FEF7CBD2\nE3DCA5D8924275C3FB94\n\nThe legitimate Voxer Walkie Talkie\nMessenger application, version 4.0.2.22408\n(3669119).\n\nreblychatold.apk\n\n2023‑06‑08\n\nA64D73C43B41F9A5B938\nAE8558759ADC474005C1\n\nreblychat.apk\n\n2023‑06‑11\n\n797073511A15EB85C1E9\nD8584B26BAA3A0B14C9E\n\nThe Voxer Walkie Talkie Messenger app\ntrojanized with AridSpy, distributed under the\nname ReblyChat.\n\nMasquerading as a Palestinian Civil Registry application\nMoving on from trojanizing chat applications for the time being, the operators then launched a campaign\ndistributing an app purporting to be from the Palestinian Civil Registry (‫)السجل املدني الفلسطيني‬. The malicious app\nclaims to offer general information about the residents of Palestine, such as name, place of residence, date of birth,\nID number, and other information. This campaign provides a malicious Android app available for download\nfrom palcivilreg[.]com, registered on May 30th, 2023; see Figure 6.\n\nFigure 6. palcivilreg[.]com website\n\nMachine translation of the website from Figure 6: “Palestinian Civil Registry. To find out information about any\nperson or search for any person’s identity number or date of birth, download the application to search the\nPalestinian civil registry.”\nThis website is advertised via a dedicated Facebook page – see Figure 7 – that was created on July 25th, 2023 and\nlinks directly to palcivilreg[.]com. We have reported this page to Facebook.\n\nFigure 7. Facebook page promoting the palcivilreg[.]com website for every Palestinian to\nidentify personal data\n\nMachine translation of the cover photo visible in Figure 7: “Palestinian Civil Registry. Search for any person’s\nname and obtain his full data. Get date of birth and age of any person. Ease of searching and entering the\napplication.”\nSelecting the ‫( تحميل‬Download, in Arabic; see Figure 6) button executes myScript.js, initiating download from\na hardcoded URL; see Figure 8. This instance of myScript.js code is slightly changed, compared to previously\nmentioned campaigns, but achieves the same results – retrieving a file from a malicious link. This version of the\nscript can be found in many tutorials available online; one of its first occurrences seems to be from February 2019.\n\nFigure 8. Content of myScript.js file\n\nThe Palestinian Civil Registry app is inspired by an app on Google Play that has been available for download since\nMarch 2020 and provides the same functionality as claimed on the palcivilreg[.]com site. The app on\nGoogle Play is linked to the website zezsoft.wuaze[.]com, which allows downloading iOS and Android\napps. At the time of this research, the iOS application was not available, and the Android app link refers to the filesharing storage site MediaFire, not to Google Play. This app was no longer available from MediaFire, so we are\nnot able to confirm whether that version was legitimate.\nBased on our investigation, the malicious app available on palcivilreg[.]com is not a trojanized version of\nthe app on Google Play; however, it uses that app’s legitimate server to retrieve information. This means that Arid\nViper was inspired by that app’s functionality but created its own client layer that communicates with the\nlegitimate server. Most likely, Arid Viper reverse engineered the legitimate Android app from Google Play and\nused its server for retrieving victims’ data.\n\nMasquerading as a job portal application\nThe last campaign we identified distributes AridSpy as an app named ‫( تطبيق املشغل‬machine translation: Operator\napplication; we refer to this as the job opportunity app), available for download from almoshell[.]website,\nregistered on August 19th, 2023. This website claims to provide a job to anyone who applies through the Android\napp. In this case, the malicious app is not a trojanized version of any legitimate app. When supposedly applying for\na job, AridSpy makes requests to almoshell[.]website for registered users. This service runs on a malware\ndistribution website, so it is difficult to identify whether any relevant work offers are returned to the app’s user or\nnot. The website is shown in Figure 9.\n\nFigure 9. Distribution website that allegedly provides a job by sending an application with the linked\nAndroid app\n\nThe job opportunity app has been available for download from this distribution site since August 20th, 2023; see\nFigure 10.\n\nFigure 10. Last modified sample update\n\ng\n\nfi\n\np\n\np\n\nToolset\nAll analyzed Android apps from these campaigns contain similar malicious code, and download first- and secondstage payloads; our analysis focuses on the NortirChat and LapizaChat campaigns, where we were able to obtain\nthe final payloads.\n\nTrojanized application\nThe campaigns mostly deploy legitimate apps that have been trojanized. In the analyzed LapizaChat and\nNortirChat cases, malicious functionality responsible for downloading a payload is implemented in\nthe apputils subpackage inserted into the legitimate messaging apps, as can be seen in Figure 11.\n\nFigure 11. Code comparison of legitimate StealthChat (left) and its trojanized version advertised as\nLapizaChat (right)\n\nAfter the initial start of the app, the malware looks for installed security software based on a hardcoded list of\ndozens of security applications, and reports the results to the C&C server. The complete list of these apps, along\nwith their package names, is in Table 4.\nTable 4. List of security apps in the order that they appear in the code\n\nApp name\n\nPackage name\n\nBitdefender Mobile Security\n\ncom.bitdefender.security\n\nAvast Antivirus & Security\n\ncom.avast.android.mobilesecurity\n\nMcAfee Security: Antivirus VPN\n\ncom.wsandroid.suite\n\nAvira Security Antivirus & VPN\n\ncom.avira.android\n\nMalwarebytes Mobile Security\n\norg.malwarebytes.antimalware\n\nKaspersky: VPN & Antivirus\n\ncom.kms.free\n\nESET Mobile Security Antivirus\n\ncom.eset.ems2.gp\n\nSophos Intercept X for Mobile\n\ncom.sophos.smsec\n\nDr.Web Security Space\n\ncom.drweb.pro\n\nMobile Security & Antivirus\n\ncom.trendmicro.tmmspersonal\n\nQuick Heal Total Security\n\ncom.quickheal.platform.advance.blue.market\n\nAntivirus and Mobile Security\n\ncom.quickheal.platform\n\nSecurity Antivirus Max Cleaner\n\ncom.maxdevlab.cleaner.security\n\nAVG AntiVirus & Security\n\ncom.antivirus\n\nAPUS Security:Antivirus Master\n\ncom.guardian.security.pri\n\nNorton360 Mobile Virus Scanner\n\ncom.symantec.mobilesecurity\n\n360 Security\n\ncom.qihoo.security\n\nLookout Life - Mobile Security\n\ncom.lookout\n\ndfndr security: antivirus\n\ncom.psafe.msuite\n\nVirus Cleaner, Antivirus Clean\n\nphone.antivirus.virus.cleaner.junk.clean.speed.\nbooster.master\n\nAntivirus & Virus Cleaner Lock\n\ncom.antivirus.mobilesecurity.viruscleaner.applock\n\nGO Security－AntiVirus, AppLock, Booster\n\ncom.jb.security\n\nZimperium MTD\n\ncom.zimperium.zips\n\nIntune Company Portal\n\ncom.microsoft.windowsintune.companyportal\n\nActive Shield Enterprise\n\ncom.better.active.shield.enterprise\n\nHarmony Mobile Protect\n\ncom.lacoon.security.fox\n\nLookout for Work\n\ncom.lookout.enterprise\n\nTrellix Mobile Security\n\ncom.mcafee.mvision\n\nMicrosoft Defender: Antivirus\n\ncom.microsoft.scmx\n\nSophos Mobile Control\n\ncom.sophos.mobilecontrol.client.android\n\nJamf Trust\n\ncom.wandera.android\n\nSEP Mobile\n\ncom.skycure.skycure\n\nPradeo Security\n\nnet.pradeo.service\n\nIf security software on the list is installed on the device, the malware will send this information to the C&C server.\nIf the server returns the value 0, then the first-stage payload will not be downloaded. If the server returns the\nvalue 1, then AridSpy proceeds and downloads the first-stage payload. In all cases that we observed, when a\nsecurity app was installed on the device, the server returned the value 0 and payloads were not downloaded.\nAridSpy uses trivial string obfuscation, where each string is declared by converting a character array into a string.\nThis method was used in every sample and even in the first published analysis by Zimperium. That same\nobfuscation is also applied in the first- and second-stage payloads. Figure 12 shows an example.\n\nFigure 12. String obfuscation\n\nIf security software is not installed, AridSpy downloads the AES-encrypted first-stage payload from its C&C\nserver. This payload is then decrypted using a hardcoded key, and the potential victim is asked to install it\nmanually. The first-stage payload impersonates an update of Google Play services, as displayed in Figure 13.\n\nFigure 13. Request to potential victim to install first-stage payload: left to right; LapizaChat, ReblyChat,\nand Palestinian Civil Registry\n\nFirst-stage payload\nDuring installation of the malicious update, the first-stage payload displays app names such as Play\nManager or Service Google. This payload works separately, without the necessity of having the trojanized\napp installed on the same device. This means that if the victim uninstalls the initial trojanized app, for example\nLapizaChat, AridSpy will not be in any way affected.\nFunctionality-wise, the first-stage payload is similar to the trojanized application. It is responsible for downloading\nthe second-stage payload, which is then dynamically loaded and executed. The first-stage payload downloads an\nAES-encrypted second-stage payload from a hardcoded URL and controls its further execution.\n\nSecond-stage payload\nThe second-stage payload is a Dalvik executable (dex); based on our observations, it always has the\nname prefLog.dex. The malicious functionality is implemented in this stage; however, it is operated by the\nfirst-stage payload, which loads it whenever necessary.\nAridSpy uses a Firebase C&C domain for receiving commands, and a different, hardcoded C&C domain, for data\nexfiltration. We reported the Firebase servers to Google, since it provides the service.\nWhen payloads are downloaded and executed, AridSpy sets listeners to monitor when the device screen is on and\noff. If the victim locks or unlocks the phone, AridSpy will take a picture using the front camera and send it to the\n\nexfiltration C&C server. Pictures are taken only if it is more than 40 minutes since the last picture was taken and\nthe battery level is above 15%. By default, these pictures are taken using the front camera; however, this can be\nchanged by receiving a command from the Firebase C&C server to use the rear camera. Images are archived in\nthe data.zip file on internal storage and uploaded to the exfiltration C&C server.\nAridSpy has a feature intended to avoid network detection – specifically C&C communication. It can deactivate\nitself, as AridSpy states in the code, by changing the exfiltration C&C server used for data upload to a dummy\nhardcoded androidd[.]com domain (a currently registered typosquat). This action occurs based on a command\nreceived from the Firebase C&C server. The dummy domain would probably look more legitimate, is not flagged\nas malicious, and might not trigger network detection systems.\nData exfiltration is initiated either by receiving a command from the Firebase C&C server or when a specifically\ndefined event is triggered. These events are defined in AndroidManifext.xml and are caused when actions\noccur, such as: internet connectivity changes, the app is installed or uninstalled, a phone call is made or received,\nan SMS message is sent or received, a battery charger is connected or disconnected, or the device reboots.\nIf any of these events occurs, AridSpy starts to gather various victim data and uploads it to the exfiltration C&C\nserver. It can collect:\n\ndevice location,\ncontact list,\ncall logs,\ntext messages,\nthumbnails of photos,\nthumbnails of recorded videos,\nrecorded phone calls,\nrecorded surrounding audio,\nmalware-taken photos,\nfile structure of external storage,\nsix WhatsApp databases (wa.db-wal, wa.db-shm, wa.db, msgstore.db-wal, msgstore.dbshm, msgstore.db) that contain exchanged messages and user contacts, if the device is rooted,\nbookmarks and search history from the default browser and Chrome, Samsung Browser, and Firefox apps if installed,\ndata in the clipboard,\n\nfiles from external storage with file size smaller than 30 MB and extensions .pdf, .doc, .docx, .xls, .xlsx,\n.ppt, .pptx, and .opus,\nthumbnails from the Samsung Gallery app stored in\nthe /storage/emulated/0/Android/data/com.sec.android.gallery3d/cache/ directory,\nall received notifications,\nFacebook Messenger and WhatsApp communication, and\nlogs of all text visible by misusing Accessibility services.\n\nBesides waiting for events to occur, the Arid Viper operator can extract specific information and upload it\nimmediately to the exfiltration C&C server by sending commands to the compromised device. AridSpy can receive\ncommands from its Firebase C&C server to obtain data or to control the malware. Operators can exfiltrate:\n\ndevice location,\ncontact list,\ntext messages,\ncall logs,\nthumbnails of photos,\nthumbnails of recorded videos,\na specific image from external storage based on an ID received from the Firebase C&C server,\na specific video from external storage based on an ID received from the Firebase C&C server,\nrecorded audio,\nimages taken on demand,\na specific file by file path received from the C&C, and\ndevice info such as whether Facebook Messenger and WhatsApp apps are installed, device storage, battery percentage,\ninternet connection, Wi-Fi connection data, screen on or off status, and the time zone.\n\nBy receiving control commands, it can:\n\ndeactivate communication by replacing the exfiltration C&C domain with the dummy value androidd[.]com,\nactivate communication by replacing the dummy androidd[.]com C&C domain with another domain name,\n\nallow data upload when on a mobile data plan, and\nchange the exfiltration C&C server for data upload.\n\nAridSpy can snoop on user activity by keylogging all text visible and editable in any application. On top of that, it\nspecifically focuses on Facebook Messenger and WhatsApp communications, which are stored and exfiltrated\nseparately. To accomplish this task, it misuses built-in accessibility services to record all text visible and uploads it\nto the exfiltration C&C server. Examples of stored WhatsApp communications can be seen in Figure 14.\n\nFigure 14. Victim’s WhatsApp communication (right) logged by AridSpy (left)\n\nBefore collected data is uploaded to the exfiltration C&C server, it is stored on internal storage,\nin /data/data/<package_name>/files/files/systems/, that belongs to AridSpy. The obtained\ncontact list, SMS, call logs, location, captured keys, file structures, and other text information are stored in plain\ntext as JSON files. All exfiltrated data is saved using specific filenames that might contain file IDs, filenames, time\nstamps, location, phone number, and AridSpy version. These values are divided by the delimiter #$&, as can be\nseen in Figure 15.\n\nFigure 15. Filenames of multimedia data exfiltrated from device (highlighted is the embedded malware\nversion number)\n\nAll these files from any particular subdirectory are then zipped into data.zip and encrypted using custom\nencryption. Each of the encrypted files uses a randomly generated filename with the _Father.zip suffix. This\nstring is hardcoded and appended to every file. The files are then uploaded to the exfiltration C&C server and\nremoved from the device.\nWhile going through the decompiled AridSpy code, we identified a version number, which is used as part of the\nfilename when exfiltrating victim data (#$&V30#$&), also visible in Figure 15 (highlighted is the version\nnumber). The AridSpy version has been changing across the campaigns and was included even with its first variant\ndisclosed in 2021. For some of the AridSpy samples, the version number is present in the trojanized app and also\nin the second-stage payload. This version might be different, since the downloaded payload can be updated. In\nTable 5, you can see the package names and their versions. Some trojanized apps contained the version number\nonly in their payloads, not in the body of the executable.\nTable 5. Malware versions found in samples\n\nApp name\n\nPackage name\n\nSHA-1\n\nVersion\n\nSystem Update\n\ncom.update.system.important\n\n52A508FEF60082E1E4EC\nE9109D2CEC1D407A0B92\n\n22\n\n[without app name]\n\ncom.weather.services.manager\n\nA934FB482F61D85DDA5E\n52A7015F1699BF55B5A9\n\n26\n\n[without app name]\n\ncom.studio.manager.app\n\n5F0213BA62B84221C962\n8F7D0A0CF87F27A45A28\n\n26\n\nKora442\n\ncom.app.projectappkora\n\n60B1DA6905857073C4C4\n6E7E964699D9C7A74EC7\n\n27\n\n‫تطبيق املشغل‬\n\ncom.app.workapp\n\n568E62ABC0948691D672\n36D9290D68DE34BD6C75\n\n29\n\nNortirChat\n\ncx.ring\n\nDB6B6326B772257FDDCB\n4BE7CF1A0CC0322387D8\n\n30\n\nprefLog.dex\n\ncom.services.android.handler\n\n16C8725362D1EBC8443C\n97C5AB79A1B6428FF87D\n\n30\n\nprefLog.dex\n\ncom.setting.manager.admin.handler\n\nE71F1484B1E3ACB4C8E8\n525BA1F5F8822AB7238B\n\n31\n\nThe Version column of the table suggests that the malware is regularly maintained.\nIt is worth mentioning that the trojanized malicious apps used for the Palestinian Civil Registry and job\nopportunity campaigns have implemented malicious functionality that is then also provided in the second-stage\npayload. It seems very unusual to download a payload if the same functionality is already included. The duplicated\nmalicious functionality doesn’t seem to be an intended behavior, as it is not implemented in samples for other\ncampaigns; rather, it might be code left over from a time before the malware was updated to provide two additional\nstages. Even so, these two trojanized apps can receive commands and spy on victims without needing additional\npayloads. Naturally, the second-stage payload carries the latest updates and malicious code changes, which can be\npushed to other ongoing campaigns.\n\nConclusion\nFive campaigns, most likely operated by the Arid Viper APT group, distribute Android spyware, which we've\nnamed AridSpy, via dedicated websites, with AridSpy’s malicious code implanted into various trojanized apps.\nThis malware family has two additional stages that are downloaded from a C&C server. The purpose of the\nsecond-stage payload is espionage via victim data exfiltration. AridSpy also has a hardcoded internal version\nnumber that differs in these five campaigns and from other samples disclosed before. This information suggests\nthat AridSpy is maintained and might receive updates or functionality changes.\n\nFor any inquiries about our research published on WeLiveSecurity, please contact us\nat threatintel@eset.com\nESET Research offers private APT intelligence reports and data feeds. For any inquiries about this\nservice, visit the ESET Threat Intelligence page.\n\nIoCs\nA comprehensive list of Indicators of Compromise (IoCs) and samples can be found in our GitHub repository.\n\nFiles\n\nSHA-1\n\nFilename\n\nDetection\n\nDescription\n\n797073511A15EB85C1E9\nD8584B26BAA3A0B14C9E\n\ncom.rebelvox.rebly.apk\n\nAndroid/Spy.AridSpy.A\n\nAridSpy trojanized\napplication.\n\n5F0213BA62B84221C962\n8F7D0A0CF87F27A45A28\n\ncom.studio.manager.app.apk\n\nAndroid/Spy.AridSpy.A\n\nThe first stage of\nAridSpy.\n\nA934FB482F61D85DDA5E\n52A7015F1699BF55B5A9\n\ncom.weather.services.\nmanager.apk\n\nAndroid/Spy.AridSpy.A\n\nThe first stage of\nAridSpy.\n\nF49B00896C99EA030DCC\nA0808B87E414BBDE1549\n\ncom.chat.lapiza.apk\n\nAndroid/Spy.AridSpy.A\n\nAridSpy trojanized\napplication.\n\n3485A0A51C6DAE251CDA\nD20B2F659B3815212162\n\ncom.chat.lapiza.apk\n\nAndroid/Spy.AridSpy.A\n\nAridSpy trojanized\napplication.\n\n568E62ABC0948691D672\n36D9290D68DE34BD6C75\n\ncom.app.workapp.apk\n\nAndroid/Spy.AridSpy.A\n\nAridSpy trojanized\napplication.\n\nDB6B6326B772257FDDCB\n4BE7CF1A0CC0322387D8\n\ncx.ring.apk\n\nAndroid/Spy.AridSpy.A\n\nAridSpy trojanized\napplication.\n\n2158D88BCE6368FAC3FC\nB7F3A508FE6B96B0CF8A\n\ncx.ring.apk\n\nAndroid/Spy.AridSpy.A\n\nAridSpy trojanized\napplication.\n\nB806B89B8C44F4674888\n8C1F8C3F05DF2387DF19\n\ncom.app.civilpal.apk\n\nAndroid/Spy.AridSpy.A\n\nAridSpy trojanized\napplication.\n\nE71F1484B1E3ACB4C8E8\n525BA1F5F8822AB7238B\n\nprefLog.dex\n\nAndroid/Spy.AridSpy.A\n\nThe second stage of\nAridSpy.\n\n16C8725362D1EBC8443C\n97C5AB79A1B6428FF87D\n\nprefLog.dex\n\nAndroid/Spy.AridSpy.A\n\nThe second stage of\nAridSpy.\n\nA64D73C43B41F9A5B938\nAE8558759ADC474005C1\n\ncom.rebelvox.rebly.apk\n\nAndroid/Spy.AridSpy.A\n\nAridSpy trojanized\napplication.\n\nC999ACE5325B7735255D\n9EE2DD782179AE21A673\n\nupdate.apk\n\nAndroid/Spy.AridSpy.A\n\nThe first stage of\nAridSpy.\n\n78F6669E75352F08A8B0\nCA155377EEE06E228F58\n\nupdate.apk\n\nAndroid/Spy.AridSpy.A\n\nThe first stage of\nAridSpy.\n\n8FF57DC85A7732E4A9D1\n44F20B68E5BC9E581300\n\nupdate.apk\n\nAndroid/Spy.AridSpy.A\n\nThe first stage of\nAridSpy.\n\nNetwork\nIP\n\nDomain\n\nHosting\nprovider\n\nFirst seen\n\nDetails\n\n23.106.223[.]54\n\ngameservicesplay[.]com\n\nLeaseWeb USA,\nInc. Seattle\n\n2023‑05‑25\n\nC&C server.\n\n23.106.223[.]135\n\ncrashstoreplayer[.]website\n\nLeaseWeb USA,\nInc. Seattle\n\n2023‑08‑19\n\nC&C server.\n\n23.254.130[.]97\n\nreblychat[.]com\n\nHostwinds LLC.\n\n2023‑05‑01\n\nDistribution\nwebsite.\n\nGoogle LLC\n\n2024‑02‑15\n\nC&C server.\n\nproj31e67a.firebaseio[.]com\nproj-95dae.firebaseio[.]com\n35.190.39[.]113\n\nproj-2bedf.firebaseio[.]com\nproj-54ca0.firebaseio[.]com\nproject445ebbd.firebaseio[.]com\n\n45.87.81[.]169\n\nwww.palcivilreg[.]com\n\nHostinger NOC\n\n2023‑06‑01\n\nDistribution\nwebsite.\n\n64.44.102[.]198\n\nanalyticsandroid[.]com\n\nNexeon\nTechnologies,\nInc.\n\n2023‑04‑01\n\nC&C server.\n\n66.29.141[.]173\n\nalmoshell[.]website\n\nNamecheap, Inc.\n\n2023‑08‑20\n\nDistribution\nwebsite.\n\n68.65.121[.]90\n\norientflags[.]com\n\nNamecheap Inc\n\n2022‑03‑16\n\nC&C server\n\n68.65.121[.]90\n\norientflags[.]com\n\nNamecheap, Inc.\n\n2022 03 16\n\nC&C server.\n\n68.65.121[.]120\n\nelsilvercloud[.]com\n\nNamecheap, Inc.\n\n2021‑11‑13\n\nC&C server.\n\nNamecheap, Inc.\n\n2022‑01‑19\n\nDistribution\nwebsite.\n\nwww.lapizachat[.]com\n68.65.122[.]94\nlapizachat[.]com\n\n162.0.224[.]52\n\nalwaysgoodidea[.]com\n\nNamecheap, Inc.\n\n2022‑09‑27\n\nC&C server.\n\n198.187.31[.]161\n\nnortirchats[.]com\n\nNamecheap, Inc.\n\n2022‑09‑23\n\nDistribution\nwebsite.\n\n199.192.25[.]241\n\nultraversion[.]com\n\nNamecheap, Inc.\n\n2021‑10‑12\n\nC&C server.\n\nMITRE ATT&CK techniques\nThis table was built using version 15 of the MITRE ATT&CK framework.\n\nTactic\n\nID\n\nName\n\nDescription\n\nInitial Access\n\nT1660\n\nPhishing\n\nAridSpy has been distributed using dedicated\nwebsites impersonating legitimate services.\n\nT1398\n\nBoot or Logon\nInitialization Scripts\n\nAridSpy receives the BOOT_COMPLETED broadcast\nintent to activate at device startup.\n\nT1624.001\n\nEvent Triggered\nExecution: Broadcast\nReceivers\n\nAridSpy registers to receive\nthe NEW_OUTGOING_CALL, PHONE_STATE,\nSMS_RECEIVED, SMS_DELIVER,\nBOOT_COMPLETED, USER_PRESENT,\nCONNECTIVITY_CHANGE,\nACTION_POWER_CONNECTED,\nACTION_POWER_DISCONNECTED,\nPACKAGE_ADDED,\nand PACKAGE_CHANGE broadcast intents to\nactivate itself.\n\nT1407\n\nDownload New Code at\nRuntime\n\nAridSpy can download first- and second-stage\npayloads.\n\nPersistence\n\nDefense evasion\n\nDefense evasion\n\nDiscovery\n\nCollection\n\nT1406\n\nObfuscated Files or\nInformation\n\nAridSpy decrypts a downloaded payload with\nobfuscated code and strings.\n\nT1418\n\nSoftware Discovery\n\nAridSpy can identify whether Facebook Messenger\nand WhatsApp apps are installed on a device.\n\nT1418.001\n\nSoftware Discovery:\nSecurity Software\nDiscovery\n\nAridSpy can identify, from a predefined list, what\nsecurity software is installed.\n\nT1420\n\nFile and Directory\nDiscovery\n\nAridSpy can list files and directories on external\nstorage.\n\nT1426\n\nSystem Information\nDiscovery\n\nAridSpy can extract information about the device\nincluding device model, device ID, and common\nsystem information.\n\nT1422\n\nSystem Network\nConfiguration Discovery\n\nAridSpy extracts the IMEI number.\n\nT1512\n\nVideo Capture\n\nAridSpy can take photos.\n\nT1532\n\nArchive Collected Data\n\nAridSpy encrypts data before extraction.\n\nT1533\n\nData from Local System\n\nAridSpy can exfiltrate files from a device.\n\nT1417.001\n\nInput Capture:\nKeylogging\n\nAridSpy can log all text visible and specifically log\nFacebook Messenger and WhatsApp chat\ncommunication.\n\nT1517\n\nAccess Notifications\n\nAridSpy can collect messages from various apps.\n\nT1429\n\nAudio Capture\n\nAridSpy can record audio from the microphone.\n\nT1414\n\nClipboard Data\n\nAridSpy can obtain clipboard contents.\n\nT1430\n\nLocation Tracking\n\nAridSpy tracks device location.\n\nT1636.002\n\nProtected User Data: Call\nLogs\n\nAridSpy can extract call logs.\n\nLogs\n\nT1636.003\n\nProtected User Data:\nContact List\n\nAridSpy can extract the device’s contact list.\n\nT1636.004\n\nProtected User Data: SMS\nMessages\n\nAridSpy can extract SMS messages.\n\nCommand and\nControl\n\nT1481.003\n\nWeb Service: One-Way\nCommunication\n\nAridSpy uses Google’s Firebase server as a C&C.\n\nExfiltration\n\nT1646\n\nExfiltration Over C2\nChannel\n\nAridSpy exfiltrates data using HTTPS.",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2024/2024.06.13.Arid_Viper_poisons_Android_apps_with_AridSpy/arid-viper-poisons-android-apps-with-aridspy.pdf"
    ],
    "report_names": [
        "arid-viper-poisons-android-apps-with-aridspy"
    ],
    "threat_actors": [
        {
            "id": "9ff60d4d-153b-4ed5-a2f7-18a21d2fa05d",
            "created_at": "2022-10-25T16:07:23.539852Z",
            "updated_at": "2024-11-22T02:02:01.00427Z",
            "deleted_at": null,
            "main_name": "Desert Falcons",
            "aliases": [
                "APT-C-23",
                "ATK 66",
                "Arid Viper",
                "Operation Arid Viper",
                "Operation Bearded Barbie",
                "Operation Rebound",
                "TAG-63",
                "TAG-CT1",
                "Two-tailed Scorpion"
            ],
            "source_name": "ETDA:Desert Falcons",
            "tools": [
                "AridSpy",
                "Barb(ie) Downloader",
                "BarbWire",
                "Desert Scorpion",
                "FrozenCell",
                "GlanceLove",
                "GnatSpy",
                "KasperAgent",
                "Micropsia",
                "PyMICROPSIA",
                "SpyC23",
                "Viper RAT",
                "ViperRAT",
                "VolatileVenom",
                "WinkChat",
                "android.micropsia"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b1979c55-037a-415f-b0a3-cab7933f5cd4",
            "created_at": "2024-04-24T02:00:49.561432Z",
            "updated_at": "2024-11-22T02:00:52.366821Z",
            "deleted_at": null,
            "main_name": "APT-C-23",
            "aliases": [
                "APT-C-23",
                "Arid Viper",
                "Desert Falcon",
                "TAG-63",
                "Grey Karkadann",
                "Big Bang APT",
                "Two-tailed Scorpion"
            ],
            "source_name": "MITRE:APT-C-23",
            "tools": [
                "Micropsia"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "77c08a4a-b3f9-43ee-9d84-04ba572b7564",
            "created_at": "2024-05-01T02:03:07.927023Z",
            "updated_at": "2024-11-22T02:02:52.96347Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SHADYSIDE",
            "aliases": [
                "Arid Viper ",
                "Desert Falcon ",
                "APT-C-23 "
            ],
            "source_name": "Secureworks:ALUMINUM SHADYSIDE",
            "tools": [
                " SpyC23",
                "Micropsia"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "efe6ff9a-822d-41a6-90c3-45265cac696b",
            "created_at": "2024-05-01T02:03:07.920302Z",
            "updated_at": "2024-11-22T02:02:52.961115Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SARATOGA",
            "aliases": [
                "Arid Viper",
                "Desert Falcon",
                "Extreme Jackal ",
                "Gaza CyberGang",
                "Gaza CyberGang",
                "Molerats ",
                "Operation DustySky ",
                "TA402",
                "APT-C-23"
            ],
            "source_name": "Secureworks:ALUMINUM SARATOGA",
            "tools": [
                " BrittleBush",
                " DarkComet",
                " LastConn",
                " Micropsia",
                " NimbleMamba",
                " PoisonIvy",
                " QuasarRAT",
                " XtremeRat",
                "BlackShades"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "929d794b-0e1d-4d10-93a6-29408a527cc2",
            "created_at": "2023-01-06T13:46:38.70844Z",
            "updated_at": "2024-11-22T02:00:02.563232Z",
            "deleted_at": null,
            "main_name": "AridViper",
            "aliases": [
                "Desert Falcon",
                "Arid Viper",
                "APT-C-23",
                "Bearded Barbie"
            ],
            "source_name": "MISPGALAXY:AridViper",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1721959541433,
    "ts_updated_at": 1732240998964,
    "ts_creation_date": 1721915931000,
    "ts_modification_date": 1721915931000,
    "files": {
        "pdf": "https://archive.orkl.eu/b9da9325aa7d7e8f3042b12b046c04aa2b4f7842.pdf",
        "text": "https://archive.orkl.eu/b9da9325aa7d7e8f3042b12b046c04aa2b4f7842.txt",
        "img": "https://archive.orkl.eu/b9da9325aa7d7e8f3042b12b046c04aa2b4f7842.jpg"
    }
}