{
    "id": "d3cdb4b6-15be-4249-afee-5f99f1343e31",
    "created_at": "2023-04-05T02:10:01.183899Z",
    "updated_at": "2024-11-22T02:03:16.921944Z",
    "deleted_at": null,
    "sha1_hash": "bd5f74994e56248677f9aad0a57ab1a18e67f222",
    "title": "2023-02-24 - Investigating the PlugX Trojan Disguised as a Legitimate Windows Debugger Tool",
    "authors": "",
    "file_creation_date": "2023-04-03T08:49:07Z",
    "file_modification_date": "2023-04-03T08:49:07Z",
    "file_size": 2953006,
    "plain_text": "Investigating the PlugX Trojan Disguised as a Legitimate Windows Debugger\nTool\ntrendmicro.com/en_us/research/23/b/investigating-the-plugx-trojan-disguised-as-a-legitimate-windows.html\nFebruary 24, 2023\n\nFigure 1. A digitally signed x32dbg.exe\n\n(ec5cf913773459da0fd30bb282fb0144b85717aa6ce660e81a0bad24a2f23e15)\n\nIntroduction\nTrend Micro’s Managed Extended Detection and Response (MxDR) team discovered that a file called x32dbg.exe was used (via\nthe DLL Search Order Hijacking or T1574.001 technique) to sideload a malicious DLL we identified as a variant of PlugX\n(Trojan.Win32.KORPLUG.AJ.enc). This file is a legitimate open-source debugger tool for Windows that is generally used to\nexamine kernel-mode and user-mode code, crash dumps, or CPU registers. Meanwhile, PlugX is a well-known remote access\ntrojan (RAT) that is used to gain remote access to and control over compromised machines. It allows an attacker to obtain\nunauthorized access to a system, steal sensitive data, and use the compromised machine for malicious purposes. The MxDR\nteam employed a number of advanced security technologies and solutions to gain a comprehensive understanding of the attack,\nwhich will be revealed in this report.\n\nInvestigating and analyzing the threat with MxDR\nBeing a legitimate application, x32dbg.exe’s valid digital signature can confuse some security tools, enabling threat actors to fly\nunder the radar, maintain persistence, escalate privileges, and bypass file execution restrictions.\nThe team's attention was first drawn to the command line execution of D:\\RECYCLER.BIN\\files\\x32dbg.exe which was flagged\nby a VisionOne Workbench alert. Further investigation revealed that this path led to a hidden folder on the USB storage device,\nwhich was found to contain a number of threat components.\n\n1/13\n\nFigure 2. Workbench model\n\ntriggered by the execution of x32dbg.exe\nWe uncovered a clear sequence of events that began with a suspicious command line execution launched via cmd.exe. The\ncommand line executed the file (ec5cf913773459da0fd30bb282fb0144b85717aa6ce660e81a0bad24a2f23e15 ) located at\nD:\\RECYCLER.BIN\\files\\x32dbg.exe. The file was signed by ”OpenSource Developer, Duncan Ogilvie” issued by Certum Code\nSigning. A visual representation of these events is displayed in Figure 3.\n\nCommand Line: \"C:\\Windows\\System32\\cmd.exe\" /q /c \"\\ \\RECYCLER.BIN\\files\\x32dbg.exe\"\nFile Path: \"D:\\ \\ \\RECYCLER.BIN\\files\\x32dbg.exe\"\nSHA256: ec5cf913773459da0fd30bb282fb0144b85717aa6ce660e81a0bad24a2f23e15\nSigner: Open-Source Developer, Duncan Ogilvie\n\nFigure 3. Vision One shows how cmd.exe calls x32dbg.exe from the external/non-system drive\nAfter executing D:\\RECYCLER.BIN\\files\\x32dbg.exe, all of the threat components are copied to the directory\nC:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop.\n\n2/13\n\nSubsequently, the file C:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop\\x32dbg.exe, a duplicate of the original\nfile, was invoked. The following command line was used to invoke the dropped file:\nCommand Line: \"C:\\Windows\\System32\\cmd.exe\" /q /c\"\nC:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop//x32dbg.exe”\n\nFigure 4. Files created in\n\nC:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop\n\nFigure 5. Files created “C:\\Users\\Public\\Public Mediae”\n\nFigure 6. Vision Ones shows how x32dbg.exe copies itself to various directories and renames itself as Mediae.exe\n\n3/13\n\nC:\\Users\\Public\\Public Mediae\\Mediae.exe followed the same procedure, creating a new directory at\nC:\\Users<username>\\Users\\ and copying the identical files as shown in Figure 7.\n\nFigure 7. The same set of files were created in C:\\Users\\\n\n<username>\\Users\\\nAs a result, a full set of the same files were present in three different directories. This indicated a clear attempt to establish\npersistence and evade detection by placing copies of the malicious files in multiple locations in the compromised system,\nspecifically:\nC:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop\nC:\\Users\\Public\\Public Mediae\\\nC:\\Users\\<username>\\Users\\\n\nAnalyzing persistence: how the attacker maintained access\nTo ensure continued access to the compromised systems, attacker used techniques involving the installation of persistence in\nthe registry, the creation of scheduled tasks to maintain access (even in case of system restarts), the implementation of changes\nin credentials, and other potential disruptions that could result in lost access.\n\nFigure 8. Persistence\n\nwas created in the scheduled task and run registry\nWe noticed the creation of a scheduled task via the schtasks command line utility to run a task at a specific time. In this case, the\nscheduled task is set to execute the x32dbg.exe file, the open source debugger tool that side loads PlugX, every five minutes.\nThe task is disguised under the name \"LKUFORYOU_1\" to make it more difficult to detect.\n\n4/13\n\nCommandline: schtasks /create /sc minute /mo 5 /tn LKUFORYOU_1 /tr\nC:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop\\x32dbg.exe /f\n\nA brief summary of the parameters used:\n/create: This option instructs the utility to create a new scheduled task.\n/sc minute: This option specifies the frequency at which the task will be executed, which in this case is every five minutes.\n/mo 5: This option sets the duration of the frequency for the scheduled task.\n/tn LKUFORYOU_1: This option sets the name of the task as \"LKUFORYOU_1\".\n/tr C:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop\\x32dbg.exe: This option specifies the path of the\nexecutable that will be executed when the task is triggered.\n/f: This option forces the task to be created without requiring user confirmation.\n\nFigure 9. The\n\nschtask utility was used to create persistence in the scheduled task\nFurther evidence supporting the persistence created by the scheduled task was discovered in the event logs via Event ID 100,\nwhich clearly showed the successful execution of the file (depicted in Figure 10).\n\n5/13\n\nFigure 10. VisionOne Windows\n\nevent log lelemetry for LKUFORYOU\nFigure 11 depicts where run registry keys were installed for persistence, and the data associated with them. These registry keys\nand values enable the threat to maintain persistence by automatically executing the x32dbg.exe file every time the user logs in.\nRegistry Key: HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nRegistry Value Name: x32dbg\nRegistry Value Data: C:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop\\x32dbg.exe\n\n6/13\n\nFigure 11. Persistence in the run registry (this image\n\ncame from ESX testing)\n\nHiding in plain sight: DLL sideloading with x32dbg.exe\nWe observed x32dbge.exe being used to sideload the PlugX file x32bridge.dll\n(0490ceace858ff7949b90ab4acf4867878815d2557089c179c9971b2dd0918b9, detected as Trojan.Win32.KORPLUG.AJ).\nSideloading can take advantage of the loader's DLL search order by placing the malicious payload(s) and victim program side by\nside. This process is likely used by malicious actors as a cover for operations carried out within a trusted, legitimate, and maybe\nelevated system or software process.\n\nFigure 12. x32dbge.exe sideloaded Plug X file\n\nx32bridge.dll (Trojan.Win32.KORPLUG.AJ)\nWe observed that the file akm.dat (0e9071714a4af0be1f96cffc3b0e58520b827d9e58297cb0e02d97551eca3799, detected as\nTrojan.Win32.KROPLUG.AJ) was also registered and executed via rundll32, a Windows component which attackers can abuse\nto facilitate the execution of malicious code. By using rundll32.exe to execute the file, the attackers can prevent security tools\nfrom monitoring this activity.\n\n7/13\n\nrundll32 SHELL32.DLL, ShellExec_RunDLL rundll32\nC:\\ProgramData\\UsersDate\\Windows_NT\\Windows\\User\\Desktop\\akm.dat,Start\n\nFigure\n\n13. The file akm.dat was executed via rundll32\n\nUnveiling the tactics used: An in-depth analysis of the threat\nThrough reverse engineering, we were able to gain a deep understanding of how the threat operates. By analyzing the tactics\nand techniques used by the attacker, we can identify and prevent similar attacks in the future.\nOur analysis of this attack in VisionOne revealed that the threat heavily relied on DLL sideloading, which is a typical behavior of\nPlugX. However, this variant was unique in that it employed several components to perform various functions, including\npersistence, propagation, and backdoor communication. As a result, we were able to identify and isolate the different files used\nby the attacker in their routine.\n\nPersistence and propagation: x32dbg.exe (with the components x32bridge.dll and\nx32bridge.dat)\nThe file x32dbg.exe is a legitimate executable of a debugging software which, when executed, imports x32bridge.dll and calls on\nthe functions BridgeStart and BridgeInit. The attackers took advantage of this and replaced the DLL with their own, containing\nthe same export functions but executing entirely different codes:\nBridgeStart – dummy code that does nothing\nBridgeInit – Loads x32bridge.dat, decrypts its contents, then proceeds with the execution of the decrypted code.\n\n8/13\n\nFigure\n\n14. The structure of x32dbg.exe and x32bridge.dll\nThe hardcoded key “HELLO_USA_PRISIDENT” is used to decode x32bridge.dat, after which execution will continue on the\ndecrypted code.\n\nFigure 15. Decoding x32bridge.dat using the hardcoded key\nIt will then check for an event named LKU_Test_0.1 (or creates it if not found). This is followed by the execution of akm.dat found\nin the same folder.\n\nFigure 16. Executing akm.dat\nNext, it creates the scheduled task LKUFORYOU_1 to run x32dbg.exe persistently like what was observed in our VisionOne\ninvestigation.\nIt then enumerates all drives and takes note of removable drives for its propagation routine. When found, it will delete files from\nany existing RECYCLER.BIN folder before creating a new one. It will copy its components that have the file extensions .exe, .dll,\nand .dat to the newly created folder and add a desktop.ini file.\n\n9/13\n\nFigure 17. Deleting the existing RECYCLER.BIN folder and creating a new one\nNext, it will proceed to its installation routine, where it copies all its components to several folders as listed on the VisionOne\nanalysis.\n\nFigure 18. The installation routine\nOnce installed, it will run the file Mediae.exe (same file as x32dbg.exe), which will remain in memory, looping through the\naforementioned routines.\n\nFigure 19. Running Mediae.exe\n\nMediae.exe also creates the event LKU_Test_0.2, possibly to signal a successful installation.\n\n10/13\n\nFigure 20. Creating LKU_Test_0.2\n\nAs also seen in the VisionOne analysis, the malware checks if it already has an AutoStart registry key (x32dbg), and creates one\nif there isn’t. Note that the execution path may vary depending on where x32dbg.exe / Mediae.exe was executed.\n\nNext stage loader: akm.dat\nThe file akm.dat is a DLL with a straightforward function — to execute the next phase of the DLL sideloading routine. Its export\nfunction Start will execute the file AUG.exe (also included in the previous installation from x32dbg.exe).\n\nFigure 21. The Start function executing AUG.exe\n\nThe backdoor UDP Shell: AUG.exe (with the components DismCore.dll and Groza_1.dat)\nAUG.exe is a copy of DISM.EXE, a legitimate Microsoft file which is also vulnerable to DLL sideloading. It imports the function\nDllGetClassObject from DismCore.dll, which will decrypt the contents of Groza_1.dat using the hardcoded key “Hapenexx is very\nbad”.\n\nFigure 22. Decrypting Groza_1.dat using the hardcoded key\nThe execution will continue on the decrypted code, which is a UDP Shell client that does the following:\nCollects host information such as the hostname, IP Address and Mac address and sends it to its command-and-control\n(C&C) server 160[.]20[.]147[.]254\nCreates a thread to continuously wait for C&C commands\nDecrypts C&C communication using the hardcoded key “Happiness is a way station between too much and too little.”\nHardcoded Debug Info found in file: C:\\Users\\guss\\Desktop\\Recent Work\\UDP SHELL\\0.7\nDLL\\UDPDLL\\Release\\UDPDLL.pdb\n\n11/13\n\nFigure\n\n23. The UDP shell client\n\nConclusion and Recommendations\nThe discovery and analysis of the malware attack using the open-source debugger tool x32dbg.exe shows us that DLL side\nloading is still used by threat actors today because it is an effective way to circumvent security measures and gain control of a\ntarget system. Despite advances in security technology, attackers continue to use this technique since it exploits a fundamental\ntrust in legitimate applications. This technique will remain viable for attackers to deliver malware and gain access to sensitive\ninformation as long as systems and applications continue to trust and load dynamic libraries.\nThis incident highlights the importance of having a strong and robust cybersecurity system in place, as threat actors continue to\nfind new ways to exploit vulnerabilities and launch sophisticated attacks. Trend Micro Managed Extended Detection and\nResponse (MxDR) helps in the prevention of DLL sideloading attacks by taking a comprehensive approach to detecting,\ninvestigating, and responding to security incidents.\nTrend XDR integrates a variety of security technologies, such as endpoint protection, network security, and cloud security, to\nprovide a comprehensive picture of an organization's security posture. This enables MxDR to detect and prevent DLL\nsideloading attacks by detecting and blocking malicious activity at various stages of the attack lifecycle before it can cause harm.\nFurthermore, XDR can perform in-depth analysis and investigation of security incidents, allowing organizations to understand the\nimpact and scope of an attack and respond appropriately.\n\n12/13\n\nHere are some recommendations that IT administrators can put into place to prevent DLL side loading attacks:\nImplement whitelisting: Allow only known and trusted applications to run on the system while blocking any suspicious or\nunknown ones.\nUse signed code: Ensure that all DLLs are signed with a trusted digital signature to ensure their authenticity and integrity.\nMonitor and control application execution: Monitor and control the execution of applications and their dependencies,\nincluding DLLs, to detect and prevent malicious activities.\nEducate end users: Inform users about the dangers of DLL sideloading attacks and encourage them to exercise caution\nwhen installing or running unfamiliar software.\nEndpoint protection: Use endpoint protection solutions that offer behavioral analysis and predictive machine learning for\nbetter security capabilities\nImplement effective incident response plans: Establish a clear and well-defined incident response plan to detect,\ncontain, and respond to security incidents as quickly as possible.\n\nIndicators of Compromise\nFile name\n\nSHA256\n\nDetection name\n\nx32dbg.exe\n\nec5cf913773459da0fd30bb282fb0144b85717aa6ce660e81a0bad24a2f23e15\n\nLegitimate Windows debugger\n\nx32bridge.dll\n\n0490ceace858ff7949b90ab4acf4867878815d2557089c179c9971b2dd0918b9\n\nTrojan.Win32.KORPLUG.AJ\n\nakm.dat\n\n0e9071714a4af0be1f96cffc3b0e58520b827d9e58297cb0e02d97551eca3799\n\nTrojan.Win32.KORPLUG.AJ\n\nx32bridge.dat\n\ne72e49dc1d95efabc2c12c46df373173f2e20dab715caf58b1be9ca41ec0e172\n\nTrojan.Win32.KORPLUG.AJ.enc\n\nDismCore.dll\n\nb4f1cae6622cd459388294afb418cb0af7a5cb82f367933e57ab8c1fb0a8a8a7\n\nTrojan.Win32.KORPLUG.AJ\n\nGroza_1.dat\n\n553ff37a1eb7e8dc226a83fa143d6aab8a305771bf0cec7b94f4202dcd1f55b2\n\nTrojan.Win32.KORPLUG.AJ.enc\n\nIP address / URL\n\nDescription\n\n160[.]20[.]147[.]254\n\nC&C Server\n\n13/13",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-24 - Investigating the PlugX Trojan Disguised as a Legitimate Windows Debugger Tool.pdf"
    ],
    "report_names": [
        "2023-02-24 - Investigating the PlugX Trojan Disguised as a Legitimate Windows Debugger Tool.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660601183,
    "ts_updated_at": 1732240996921,
    "ts_creation_date": 1680511747000,
    "ts_modification_date": 1680511747000,
    "files": {
        "pdf": "https://archive.orkl.eu/bd5f74994e56248677f9aad0a57ab1a18e67f222.pdf",
        "text": "https://archive.orkl.eu/bd5f74994e56248677f9aad0a57ab1a18e67f222.txt",
        "img": "https://archive.orkl.eu/bd5f74994e56248677f9aad0a57ab1a18e67f222.jpg"
    }
}