{
    "id": "17b560f5-adc2-4f38-a2f6-bfbac9a66b5e",
    "created_at": "2023-05-06T02:08:56.539588Z",
    "updated_at": "2024-11-22T02:03:35.79623Z",
    "deleted_at": null,
    "sha1_hash": "fb88b470acfc9bfac54ab1de1d9b883e746061b2",
    "title": "2023-04-26 - Chinese Alloy Taurus Updates PingPull Malware",
    "authors": "",
    "file_creation_date": "2023-05-05T02:07:27Z",
    "file_modification_date": "2023-05-05T02:07:27Z",
    "file_size": 1096555,
    "plain_text": "Chinese Alloy Taurus Updates PingPull Malware\nunit42.paloaltonetworks.com/alloy-taurus/\nUnit 42\n\nApril 26, 2023\n\nBy Unit 42\nApril 26, 2023 at 3:00 AM\nCategory: Malware\nTags: Advanced URL Filtering, Alloy Taurus, APT, China Chopper, Cortex XDR, Cortex\nXSIAM, Cortex XSOAR, DNS security, GALLIUM, next-generation firewall, PingPull,\nWildFire\n\nThis post is also available in: 日本語 (Japanese)\n\nExecutive Summary\nUnit 42 researchers recently identified a new variant of PingPull malware used by Alloy\nTaurus actors designed to target Linux systems. While following the infrastructure leveraged\nby the actor for this PingPull variant, we also identified their use of another backdoor we\ntrack as Sword2033.\n1/8\n\nThe first samples of PingPull malware date back to September 2021. Monitoring its use\nacross several campaigns, in June 2022 Unit 42 published research outlining the\nfunctionality of PingPull and attributed the use of the tool to Alloy Taurus.\nOperating since at least 2012, Alloy Taurus (aka GALLIUM, Softcell) is assessed to be a\nChinese advanced persistent threat (APT) group that routinely conducts cyberespionage\ncampaigns. This group has historically targeted telecommunications companies operating\nacross Asia, Europe and Africa. In recent years we have also observed the group expand\ntheir targeting to include financial institutions and government entities.\nWe provide a detailed breakdown of the following:\nA new variant of PingPull\nSword2033 samples linked to the same command and control (C2) infrastructure\nRecent activity by Alloy Taurus in South Africa and Nepal\nPalo Alto Networks customers receive protections from the threats described in this blog\nthrough Cortex XDR and WildFire malware analysis. The Advanced URL Filtering and DNS\nSecurity Cloud-Delivered Security Services can help protect against C2 infrastructure.\nRelated Unit 42 Topics\n\nAlloy Taurus, PingPull, Advanced Persistent Threat\n\nTable of Contents\nPingPull Linux Variant\nSword2033 Backdoor\nInfrastructure Analysis\nConclusion\nProtections and Mitigations\nIndicators of Compromise\nAdditional Resources\n\nPingPull Linux Variant\nOn March 7, 2023, the following sample was uploaded to VirusTotal.\nFilename\n\nnztloader\n\nFiletype\n\nELF\n\nSHA256\n\ncb0922d8b130504bf9a3078743294791201789c5a3d7bc0369afd096ea15f0ae\n\nTable 1. PingPull sample file details.\n\n2/8\n\nAt the time of writing, three out of 62 vendors found the sample to be malicious. Despite a\nlargely benign verdict, additional analysis has determined that this sample is a Linux variant\nof PingPull malware. This determination was made based on matching HTTP communication\nstructure, POST parameters, AES key, and C2 commands, which are outlined below.\nUpon execution, this sample is configured to communicate with the domain\nyrhsywu2009.zapto[.]org over port 8443 for C2. It uses a statically linked OpenSSL\n(OpenSSL 0.9.8e) library to interact with the domain over HTTPS via the following HTTP\nPOST request:\n\nFigure\n\n1. PingPull Linux variant POST request.\nThe payload then expects the C2 server to respond with data that is Base64 encoded\nciphertext, encrypted with AES using P29456789A1234sS as the key. This is the same key\nthat we previously observed in the original Windows PE variant of PingPull.\nOnce decoded, the cleartext resembles HTTP parameters and the payload will parse the\ncleartext for & and = with the following parameters:\n\nFigure\n\n2. PingPull HTTP parameters.\nThe value in the P29456789A1234sS parameter will contain a single upper case character\nbetween A and K, as well as M, which the payload will use as the command value. The\nvalues in the z0, z1 and z2 parameters are used for the arguments passed to the command.\nAfter running the command, the payload will send the results back to the C2 server via an\nHTTPS request that resembles the beacon request, but contains Base64 encoded\nciphertext. The command handler supports the following functionality that aligns with both\nChina Chopper capabilities and those observed in the PingPull Windows PE variant:\nCmd\n\nDescription\n\n3/8\n\nA\n\nGet the current directory\n\nB\n\nList folder\n\nC\n\nRead text file\n\nD\n\nWrite text file\n\nE\n\nDelete file or folder\n\nF\n\nRead binary file, convert to hex\n\nG\n\nWrite binary file, convert to hex\n\nH\n\nCopy file or folder\n\nI\n\nRename file\n\nJ\n\nCreate Directory\n\nK\n\nTimestomp file with specified timestamp in \"%04d-%d-%d %d:%d:%d\" format\n\nM\n\nRun command\n\nTable 2. PingPull command handler functionality.\nOf note, the HTTP parameters z0, z1 and z2 and command handlers A-K, M also align to\ncommands A-K, M observed in the web shell China Chopper. This suggests that Alloy Taurus\nis using code they might be familiar with, and they are integrating it into the development of\ncustom tooling.\n\nSword2033 Backdoor\nPivoting on the C2 domain, we identified one additional sample that also communicated with\nyrhsywu2009.zapto[.]org:\nSword2033\nSample 1\nFilename\n\nzimbra\n\nFiletype\n\nELF\n\nSHA256\n\n5ba043c074818fdd06ae1d3939ddfe7d3d35bab5d53445bc1f2f689859a87507\n\nTable 3. Related Sword2033 sample file details.\n\n4/8\n\nSimilar to the PingPull variant above, this sample was designed to connect to port 8443 over\nHTTPS. However, analysis of the sample revealed that it’s a simple backdoor that we track\nas Sword2033. This backdoor supports three basic functions:\nCmd\n\nDescription\n\n#up\n\nUploads a file to the system\n\n#dn\n\nDownloads a file from the system\n\nexc /c:\n\nExecutes a command, but appends ;echo <random number>\\n before running it\n\nTable 4. Sword2033 command handler functionality.\nThese three commands map to commands in a second command handler that uses A, C, D\nand M commands, which are identical in value and functionality with the PingPull commands\nidentified in Table 2 above.\nSearching for other recent samples of Sword2033, we identified a second sample:\nSword2033\nSample 2\nFilename\n\nHopke\n\nFiletype\n\nELF\n\nSHA256\n\ne39b5c32ab255ad284ae6d4dae8b4888300d4b5df23157404d9c8be3f95b3253\n\nTable 5. Additional Sword2033 sample file details.\nThis sample was seen in July 2022. Analysis of this sample revealed that it’s configured to\nconnect to 196.216.136[.]139, located in South Africa, for C2.\n\nInfrastructure Analysis\nAnalysis of the C2 domain yrhsywu2009.zapto[.]org found in the PingPull Linux variant and\nthe first Sword2033 sample shows it was most recently hosted on 5.181.25[.]99 until early\nFebruary 2023. However, a historical review of its hosting revealed that this domain resolved\nto 45.251.241[.]82 for a single day in April 2022. This IP was outlined as an active indicator\nof compromise (IoC) in our June 2022 report, thereby drawing a clear link to Alloy Taurus\nactivities.\nAnalysis of the C2 for the second Sword2033 sample (Hopke, referenced in Table 5) found\nthat the domain *.saspecialforces.co[.]za resolved to 196.216.136[.]139. This domain has\nbeen hosted on eight other IPs throughout its history with various mail-related subdomains.\n5/8\n\nNone of these IPs appear to have any affiliation with the South African government, but the\ndomain name gives the impression of a connection to the South African military. The\nestablishment of a C2 server that appears to impersonate the South African military is\nuniquely notable when analyzed in the context of recent events. In February 2023, South\nAfrica joined Russia and China to participate in combined naval exercises.\nAdditionally, 196.216.136[.]139 resolved to vpn729380678.softether[.]net from late\nDecember 2022 through mid-February 2023. Alloy Taurus is known for leveraging the\nSoftEther VPN service in their operations to facilitate access and maintain persistence to\ntheir targeted network.\nThreat actors often abuse, take advantage of or subvert legitimate products like SoftEther\nVPN for malicious purposes. This does not necessarily imply a flaw or malicious quality to\nthe legitimate product being abused.\n\nFigure 3. PingPull/Sword2033 infrastructure visualization.\nReviewing traffic to the Sword2033 C2 server 196.216.136[.]139, we identified sustained\nconnections originating from an IP that hosts several subdomains for an organization that\nfinances long-term urban infrastructure development projects in Nepal.\n\nConclusion\n6/8\n\nAlloy Taurus remains an active threat to telecommunications, finance and government\norganizations across Southeast Asia, Europe and Africa. The identification of a Linux variant\nof PingPull malware, as well as recent use of the Sword2033 backdoor, suggests that the\ngroup continues to evolve their operations in support of their espionage activities. We\nencourage all organizations to leverage our findings to inform the deployment of protective\nmeasures to defend against this threat group.\nPalo Alto Networks has shared these findings, including file samples and indicators of\ncompromise, with our fellow Cyber Threat Alliance (CTA) members. CTA members use this\nintelligence to rapidly deploy protections to their customers and to systematically disrupt\nmalicious cyber actors. Learn more about the Cyber Threat Alliance.\n\nProtections and Mitigations\nIn order to defend against the threats described in this blog, Palo Alto Networks recommends\norganizations employ the following capabilities:\nNetwork Security: Delivered through a Next-Generation Firewall (NGFW) configured\nwith machine learning enabled, and best-in-class, cloud-delivered security services.\nThis includes, for example, threat prevention, URL filtering, DNS security and a\nmalware prevention engine capable of identifying and blocking malicious samples and\ninfrastructure.\nEndpoint Security: Delivered through an XDR solution that is capable of identifying\nmalicious code through the use of advanced machine learning and behavioral\nanalytics. This solution should be configured to act on and block threats in real time as\nthey are identified.\nSecurity Automation: Delivered through an XSOAR or XSIAM solution capable of\nproviding SOC analysts with a comprehensive understanding of the threat derived by\nstitching together data obtained from endpoints, network, cloud and identity systems.\n\nSpecific Product Protections and Mitigations\nFor Palo Alto Networks customers, our products and services provide the following coverage\nassociated with this group:\nWildFire cloud-based threat analysis service accurately identifies the malware\ndescribed in this blog as malicious.\nAdvanced URL Filtering and DNS Security identify domains associated with Alloy\nTaurus as malicious.\nCortex XDR prevents the execution of known malware samples as malicious.\nIf you think you may have been compromised or have an urgent matter, get in touch with the\nUnit 42 Incident Response team or call:\n7/8\n\nNorth America Toll-Free: 866.486.4842 (866.4.UNIT42)\nEMEA: +31.20.299.3130\nAPAC: +65.6983.8730\nJapan: +81.50.1790.0200\n\nIndicators of Compromise\nPingPull Linux Variant\ncb0922d8b130504bf9a3078743294791201789c5a3d7bc0369afd096ea15f0ae\nSword2033\n5ba043c074818fdd06ae1d3939ddfe7d3d35bab5d53445bc1f2f689859a87507\ne39b5c32ab255ad284ae6d4dae8b4888300d4b5df23157404d9c8be3f95b3253\nAlloy Taurus Infrastructure\nyrhsywu2009.zapto[.]org\n*.saspecialforces.co[.]za\nvpn729380678.softether[.]net\n5.181.25[.]99\n196.216.136[.]139\n\nAdditional Resources\nGet updates from\nPalo Alto\nNetworks!\nSign up to receive the latest news, cyber threat intelligence and research from us\n\nBy submitting this form, you agree to our Terms of Use and acknowledge our Privacy\nStatement.\n\n8/8",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-26 - Chinese Alloy Taurus Updates PingPull Malware.pdf"
    ],
    "report_names": [
        "2023-04-26 - Chinese Alloy Taurus Updates PingPull Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "9faf32b7-0221-46ac-a716-c330c1f10c95",
            "created_at": "2022-10-25T16:07:23.652281Z",
            "updated_at": "2024-11-22T02:02:01.0339Z",
            "deleted_at": null,
            "main_name": "Gallium",
            "aliases": [
                "Alloy Taurus",
                "Granite Typhoon",
                "Phantom Panda"
            ],
            "source_name": "ETDA:Gallium",
            "tools": [
                "Agentemis",
                "BlackMould",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "Gh0stCringe RAT",
                "HTran",
                "HUC Packet Transmit Tool",
                "LaZagne",
                "Mimikatz",
                "NBTscan",
                "PingPull",
                "Plink",
                "Poison Ivy",
                "PsExec",
                "PuTTY Link",
                "QuarkBandit",
                "Quasar RAT",
                "QuasarRAT",
                "Reshell",
                "SPIVY",
                "SinoChopper",
                "SoftEther VPN",
                "Sword2033",
                "WCE",
                "WinRAR",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Yggdrasil",
                "cobeacon",
                "nbtscan",
                "netcat",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bf3ffe5-09ba-4378-8ea4-a6d748a494fd",
            "created_at": "2022-10-25T15:50:23.264584Z",
            "updated_at": "2024-11-22T02:00:52.301366Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "GALLIUM",
                "Granite Typhoon"
            ],
            "source_name": "MITRE:GALLIUM",
            "tools": [
                "ipconfig",
                "cmd",
                "China Chopper",
                "PoisonIvy",
                "at",
                "PlugX",
                "PingPull",
                "BlackMould",
                "Mimikatz",
                "PsExec",
                "HTRAN",
                "NBTscan",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c87ee2df-e528-4fa0-bed6-6ed29e390688",
            "created_at": "2023-01-06T13:46:39.150432Z",
            "updated_at": "2024-11-22T02:00:02.697492Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "Granite Typhoon",
                "Red Dev 4",
                "Alloy Taurus"
            ],
            "source_name": "MISPGALAXY:GALLIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1683338936539,
    "ts_updated_at": 1732241015796,
    "ts_creation_date": 1683252447000,
    "ts_modification_date": 1683252447000,
    "files": {
        "pdf": "https://archive.orkl.eu/fb88b470acfc9bfac54ab1de1d9b883e746061b2.pdf",
        "text": "https://archive.orkl.eu/fb88b470acfc9bfac54ab1de1d9b883e746061b2.txt",
        "img": "https://archive.orkl.eu/fb88b470acfc9bfac54ab1de1d9b883e746061b2.jpg"
    }
}